iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CrsrOn:1;
      uint64_t RESERVED_0:3;
      uint64_t CRSRNUM1_0:2;
      uint64_t RESERVED_1:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CrsrSize:1;
      uint64_t FRAMESYNC:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RED:8;
      uint64_t GREEN:8;
      uint64_t BLUE:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_PAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RED:8;
      uint64_t GREEN:8;
      uint64_t BLUE:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_PAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRX:10;
      uint64_t RESERVED_0:6;
      uint64_t CRSRY:10;
      uint64_t RESERVED_1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_XY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRCLIPX:6;
      uint64_t RESERVED_0:2;
      uint64_t CRSRCLIPY:6;
      uint64_t RESERVED_1:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CLIP;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRIM:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRIC:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRRIS:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRMIS:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTSTAT;

};

#define LCD_0 (*(volatile struct LCD_0_tag *) 0x40008000)

struct EEPROM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPHASE2:8;
      uint64_t RPHASE1:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RWSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOPROG:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOPROG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHASE3:8;
      uint64_t PHASE2:8;
      uint64_t PHASE1:8;
      uint64_t RESERVED:7;
      uint64_t LCK_PARWEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRDWN:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRDWN;

  uint8_t res1[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_CLR_EN:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_SET_EN:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t END_OF_PROG:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t EE_PROG_DONE:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_CLR_ST:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_SET_ST:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATSET;

};

#define EEPROM_0 (*(volatile struct EEPROM_0_tag *) 0x4000e000)

struct ETHERNET_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t DF:1;
      uint64_t BL:2;
      uint64_t ACS:1;
      uint64_t RESERVED_1:1;
      uint64_t DR:1;
      uint64_t RESERVED_2:1;
      uint64_t DM:1;
      uint64_t LM:1;
      uint64_t DO:1;
      uint64_t FES:1;
      uint64_t PS:1;
      uint64_t DCRS:1;
      uint64_t IFG:3;
      uint64_t JE:1;
      uint64_t RESERVED_3:1;
      uint64_t JD:1;
      uint64_t WD:1;
      uint64_t RESERVED_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:1;
      uint64_t HUC:1;
      uint64_t HMC:1;
      uint64_t DAIF:1;
      uint64_t PM:1;
      uint64_t DBF:1;
      uint64_t PCF:2;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t HPF:1;
      uint64_t RESERVED_2:20;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FRAME_FILTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HASHTABLE_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HASHTABLE_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GB:1;
      uint64_t W:1;
      uint64_t CR:4;
      uint64_t GR:5;
      uint64_t PA:5;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MII_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GD:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MII_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCB:1;
      uint64_t TFE:1;
      uint64_t RFE:1;
      uint64_t UP:1;
      uint64_t PLT:2;
      uint64_t RESERVED_0:1;
      uint64_t DZPQ:1;
      uint64_t RESERVED_1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FLOW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VL:16;
      uint64_t ETV:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_VLAN_TAG;

