iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define EVENTROUTER_0 (*(volatile struct EVENTROUTER_0_tag *) 0x40044000)

struct RTC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCCIF:1;
      uint64_t RTCALF:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ILR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKEN:1;
      uint64_t CTCRST:1;
      uint64_t RESERVED_0:2;
      uint64_t CCALEN:1;
      uint64_t RESERVED_1:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMSEC:1;
      uint64_t IMMIN:1;
      uint64_t IMHOUR:1;
      uint64_t IMDOM:1;
      uint64_t IMDOW:1;
      uint64_t IMDOY:1;
      uint64_t IMMON:1;
      uint64_t IMYEAR:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AMRSEC:1;
      uint64_t AMRMIN:1;
      uint64_t AMRHOUR:1;
      uint64_t AMRDOM:1;
      uint64_t AMRDOW:1;
      uint64_t AMRDOY:1;
      uint64_t AMRMON:1;
      uint64_t AMRYEAR:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECONDS:6;
      uint64_t RESERVED_0:2;
      uint64_t MINUTES:6;
      uint64_t RESERVED_1:2;
      uint64_t HOURS:5;
      uint64_t RESERVED_2:3;
      uint64_t DOW:3;
      uint64_t RESERVED_3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIME0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOM:5;
      uint64_t RESERVED_0:3;
      uint64_t MONTH:4;
      uint64_t RESERVED_1:4;
      uint64_t YEAR:12;
      uint64_t RESERVED_2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIME1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOY:12;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIME2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECONDS:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINUTES:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOURS:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOM:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOW:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOY:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MONTH:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MONTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YEAR:12;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) YEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALVAL:17;
      uint64_t CALDIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALIBRATION;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECONDS:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINUTES:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOURS:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOM:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOW:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOY:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADOY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MONTH:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YEAR:12;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AYRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV0:1;
      uint64_t EV1:1;
      uint64_t EV2:1;
      uint64_t GP_CLEARED:1;
      uint64_t RESERVED:27;
      uint64_t WAKEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTWAKE_EN0:1;
      uint64_t GPCLEAR_EN0:1;
      uint64_t POL0:1;
      uint64_t EV0_INPUT_EN:1;
      uint64_t RESERVED_0:6;
      uint64_t INTWAKE_EN1:1;
      uint64_t GPCLEAR_EN1:1;
      uint64_t POL1:1;
      uint64_t EV1_INPUT_EN:1;
      uint64_t RESERVED_1:6;
      uint64_t INTWAKE_EN2:1;
      uint64_t GPCLEAR_EN2:1;
      uint64_t POL2:1;
      uint64_t EV2_INPUT_EN:1;
      uint64_t RESERVED_2:6;
      uint64_t ERMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERCONTRO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER0:3;
      uint64_t RESERVED_0:5;
      uint64_t COUNTER1:3;
      uint64_t RESERVED_1:5;
      uint64_t COUNTER2:3;
      uint64_t RESERVED_2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERCOUNTERS;

