iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:6;
      uint64_t MIN:6;
      uint64_t HOUR:5;
      uint64_t DOY:9;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFIRSTSTAMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:6;
      uint64_t MIN:6;
      uint64_t HOUR:5;
      uint64_t DOY:9;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFIRSTSTAMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:6;
      uint64_t MIN:6;
      uint64_t HOUR:5;
      uint64_t DOY:9;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFIRSTSTAMP2;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:6;
      uint64_t MIN:6;
      uint64_t HOUR:5;
      uint64_t DOY:9;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERLASTSTAMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:6;
      uint64_t MIN:6;
      uint64_t HOUR:5;
      uint64_t DOY:9;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERLASTSTAMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:6;
      uint64_t MIN:6;
      uint64_t HOUR:5;
      uint64_t DOY:9;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERLASTSTAMP2;

};

#define RTC_0 (*(volatile struct RTC_0_tag *) 0x40046000)

struct CGU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCNT:9;
      uint64_t FCNT:14;
      uint64_t MEAS:1;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREQ_MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t BYPASS:1;
      uint64_t HF:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL_OSC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t FR:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0USB_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t BYPASS:1;
      uint64_t DIRECTI:1;
      uint64_t DIRECTO:1;
      uint64_t CLKEN:1;
      uint64_t RESERVED_0:1;
      uint64_t FRM:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_5:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0USB_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDEC:17;
      uint64_t SELP:5;
      uint64_t SELI:6;
      uint64_t SELR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0USB_MDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDEC:7;
      uint64_t RESERVED_0:5;
      uint64_t NDEC:10;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0USB_NP_DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t FR:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0AUDIO_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t BYPASS:1;
      uint64_t DIRECTI:1;
      uint64_t DIRECTO:1;
      uint64_t CLKEN:1;
      uint64_t RESERVED_0:1;
      uint64_t FRM:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t AUTOBLOCK:1;
      uint64_t PLLFRACT_REQ:1;
      uint64_t SEL_EXT:1;
      uint64_t MOD_PD:1;
      uint64_t RESERVED_5:9;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0AUDIO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDEC:17;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0AUDIO_MDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDEC:7;
      uint64_t RESERVED_0:5;
      uint64_t NDEC:10;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0AUDIO_NP_DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLFRACT_CTRL:22;
      uint64_t RESERVED:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0AUDIO_FRAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t BYPASS:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:3;
      uint64_t FBSEL:1;
      uint64_t DIRECT:1;
      uint64_t PSEL:2;
      uint64_t RESERVED_2:1;
      uint64_t AUTOBLOCK:1;
      uint64_t NSEL:2;
      uint64_t RESERVED_3:2;
      uint64_t MSEL:8;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_4:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:1;
      uint64_t IDIV:2;
      uint64_t RESERVED_1:7;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_2:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDIVA_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:1;
      uint64_t IDIV:4;
      uint64_t RESERVED_1:5;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_2:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDIVB_CTRL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:1;
      uint64_t IDIV:8;
      uint64_t RESERVED_1:1;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_2:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDIVE_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_SAFE_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_USB0_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_PERIPH_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_USB1_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_M3_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_SPIFI_CLK;

