iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res2[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP3_8;

  uint8_t res3[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP4_10;

  uint8_t res4[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP5_7;

  uint8_t res5[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP6_12;

  uint8_t res6[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP7_7;

