iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define GPIO_GROUP_INT0_0 (*(volatile struct GPIO_GROUP_INT0_0_tag *) 0x40088000)

struct GPIO_GROUP_INT1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t COMB:1;
      uint64_t TRIG:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA7;

