iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN7;

  uint8_t res4[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP0:1;
      uint64_t MPORTP1:1;
      uint64_t MPORTP2:1;
      uint64_t MPORTP3:1;
      uint64_t MPORTP4:1;
      uint64_t MPORTP5:1;
      uint64_t MPORTP6:1;
      uint64_t MPORTP7:1;
      uint64_t MPORTP8:1;
      uint64_t MPORTP9:1;
      uint64_t MPORTP10:1;
      uint64_t MPORTP11:1;
      uint64_t MPORTP12:1;
      uint64_t MPORTP13:1;
      uint64_t MPORTP14:1;
      uint64_t MPORTP15:1;
      uint64_t MPORTP16:1;
      uint64_t MPORTP17:1;
      uint64_t MPORTP18:1;
      uint64_t MPORTP19:1;
      uint64_t MPORTP20:1;
      uint64_t MPORTP21:1;
      uint64_t MPORTP22:1;
      uint64_t MPORTP23:1;
      uint64_t MPORTP24:1;
      uint64_t MPORTP25:1;
      uint64_t MPORTP26:1;
      uint64_t MPORTP27:1;
      uint64_t MPORTP28:1;
      uint64_t MPORTP29:1;
      uint64_t MPORTP30:1;
      uint64_t MPORTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN7;

  uint8_t res5[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP0:1;
      uint64_t SETP1:1;
      uint64_t SETP2:1;
      uint64_t SETP3:1;
      uint64_t SETP4:1;
      uint64_t SETP5:1;
      uint64_t SETP6:1;
      uint64_t SETP7:1;
      uint64_t SETP8:1;
      uint64_t SETP9:1;
      uint64_t SETP10:1;
      uint64_t SETP11:1;
      uint64_t SETP12:1;
      uint64_t SETP13:1;
      uint64_t SETP14:1;
      uint64_t SETP15:1;
      uint64_t SETP16:1;
      uint64_t SETP17:1;
      uint64_t SETP18:1;
      uint64_t SETP19:1;
      uint64_t SETP20:1;
      uint64_t SETP21:1;
      uint64_t SETP22:1;
      uint64_t SETP23:1;
      uint64_t SETP24:1;
      uint64_t SETP25:1;
      uint64_t SETP26:1;
      uint64_t SETP27:1;
      uint64_t SETP28:1;
      uint64_t SETP29:1;
      uint64_t SETP30:1;
      uint64_t SETP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET7;

  uint8_t res6[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR6;

