iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint32_t Mem_Manage_Address;
  uint32_t Bus_Fault_Address;
  uint8_t res9[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUMBER:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUNUMBER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR3;

  uint8_t res10[324];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTID:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Software_Trigger_Interrupt_Register;

};

#define M3_Peripherals_1 (*(volatile struct M3_Peripherals_1_tag *) 0xe000e008)

struct GPDMA_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSTAT0:1;
      uint64_t INTSTAT1:1;
      uint64_t INTSTAT2:1;
      uint64_t INTSTAT3:1;
      uint64_t INTSTAT4:1;
      uint64_t INTSTAT5:1;
      uint64_t INTSTAT6:1;
      uint64_t INTSTAT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTTCSTAT0:1;
      uint64_t INTTCSTAT1:1;
      uint64_t INTTCSTAT2:1;
      uint64_t INTTCSTAT3:1;
      uint64_t INTTCSTAT4:1;
      uint64_t INTTCSTAT5:1;
      uint64_t INTTCSTAT6:1;
      uint64_t INTTCSTAT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTTCCLEAR0:1;
      uint64_t INTTCCLEAR1:1;
      uint64_t INTTCCLEAR2:1;
      uint64_t INTTCCLEAR3:1;
      uint64_t INTTCCLEAR4:1;
      uint64_t INTTCCLEAR5:1;
      uint64_t INTTCCLEAR6:1;
      uint64_t INTTCCLEAR7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTCCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTERRSTAT0:1;
      uint64_t INTERRSTAT1:1;
      uint64_t INTERRSTAT2:1;
      uint64_t INTERRSTAT3:1;
      uint64_t INTERRSTAT4:1;
      uint64_t INTERRSTAT5:1;
      uint64_t INTERRSTAT6:1;
      uint64_t INTERRSTAT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTERRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTERRCLR0:1;
      uint64_t INTERRCLR1:1;
      uint64_t INTERRCLR2:1;
      uint64_t INTERRCLR3:1;
      uint64_t INTERRCLR4:1;
      uint64_t INTERRCLR5:1;
      uint64_t INTERRCLR6:1;
      uint64_t INTERRCLR7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTERRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAWINTTCSTAT0:1;
      uint64_t RAWINTTCSTAT1:1;
      uint64_t RAWINTTCSTAT2:1;
      uint64_t RAWINTTCSTAT3:1;
      uint64_t RAWINTTCSTAT4:1;
      uint64_t RAWINTTCSTAT5:1;
      uint64_t RAWINTTCSTAT6:1;
      uint64_t RAWINTTCSTAT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWINTTCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAWINTERRSTAT0:1;
      uint64_t RAWINTERRSTAT1:1;
      uint64_t RAWINTERRSTAT2:1;
      uint64_t RAWINTERRSTAT3:1;
      uint64_t RAWINTERRSTAT4:1;
      uint64_t RAWINTERRSTAT5:1;
      uint64_t RAWINTERRSTAT6:1;
      uint64_t RAWINTERRSTAT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWINTERRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLEDCHANNELS0:1;
      uint64_t ENABLEDCHANNELS1:1;
      uint64_t ENABLEDCHANNELS2:1;
      uint64_t ENABLEDCHANNELS3:1;
      uint64_t ENABLEDCHANNELS4:1;
      uint64_t ENABLEDCHANNELS5:1;
      uint64_t ENABLEDCHANNELS6:1;
      uint64_t ENABLEDCHANNELS7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENBLDCHNS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFTBREQ0:1;
      uint64_t SOFTBREQ1:1;
      uint64_t SOFTBREQ2:1;
      uint64_t SOFTBREQ3:1;
      uint64_t SOFTBREQ4:1;
      uint64_t SOFTBREQ5:1;
      uint64_t SOFTBREQ6:1;
      uint64_t SOFTBREQ7:1;
      uint64_t SOFTBREQ8:1;
      uint64_t SOFTBREQ9:1;
      uint64_t SOFTBREQ10:1;
      uint64_t SOFTBREQ11:1;
      uint64_t SOFTBREQ12:1;
      uint64_t SOFTBREQ13:1;
      uint64_t SOFTBREQ14:1;
      uint64_t SOFTBREQ15:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTBREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFTSREQ0:1;
      uint64_t SOFTSREQ1:1;
      uint64_t SOFTSREQ2:1;
      uint64_t SOFTSREQ3:1;
      uint64_t SOFTSREQ4:1;
      uint64_t SOFTSREQ5:1;
      uint64_t SOFTSREQ6:1;
      uint64_t SOFTSREQ7:1;
      uint64_t SOFTSREQ8:1;
      uint64_t SOFTSREQ9:1;
      uint64_t SOFTSREQ10:1;
      uint64_t SOFTSREQ11:1;
      uint64_t SOFTSREQ12:1;
      uint64_t SOFTSREQ13:1;
      uint64_t SOFTSREQ14:1;
      uint64_t SOFTSREQ15:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTSREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFTLBREQ0:1;
      uint64_t SOFTLBREQ1:1;
      uint64_t SOFTLBREQ2:1;
      uint64_t SOFTLBREQ3:1;
      uint64_t SOFTLBREQ4:1;
      uint64_t SOFTLBREQ5:1;
      uint64_t SOFTLBREQ6:1;
      uint64_t SOFTLBREQ7:1;
      uint64_t SOFTLBREQ8:1;
      uint64_t SOFTLBREQ9:1;
      uint64_t SOFTLBREQ10:1;
      uint64_t SOFTLBREQ11:1;
      uint64_t SOFTLBREQ12:1;
      uint64_t SOFTLBREQ13:1;
      uint64_t SOFTLBREQ14:1;
      uint64_t SOFTLBREQ15:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTLBREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFTLSREQ0:1;
      uint64_t SOFTLSREQ1:1;
      uint64_t SOFTLSREQ2:1;
      uint64_t SOFTLSREQ3:1;
      uint64_t SOFTLSREQ4:1;
      uint64_t SOFTLSREQ5:1;
      uint64_t SOFTLSREQ6:1;
      uint64_t SOFTLSREQ7:1;
      uint64_t SOFTLSREQ8:1;
      uint64_t SOFTLSREQ9:1;
      uint64_t SOFTLSREQ10:1;
      uint64_t SOFTLSREQ11:1;
      uint64_t SOFTLSREQ12:1;
      uint64_t SOFTLSREQ13:1;
      uint64_t SOFTLSREQ14:1;
      uint64_t SOFTLSREQ15:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTLSREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t M0:1;
      uint64_t M1:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACSYNC0:1;
      uint64_t DMACSYNC1:1;
      uint64_t DMACSYNC2:1;
      uint64_t DMACSYNC3:1;
      uint64_t DMACSYNC4:1;
      uint64_t DMACSYNC5:1;
      uint64_t DMACSYNC6:1;
      uint64_t DMACSYNC7:1;
      uint64_t DMACSYNC8:1;
      uint64_t DMACSYNC9:1;
      uint64_t DMACSYNC10:1;
      uint64_t DMACSYNC11:1;
      uint64_t DMACSYNC12:1;
      uint64_t DMACSYNC13:1;
      uint64_t DMACSYNC14:1;
      uint64_t DMACSYNC15:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNC;

  uint8_t res0[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0CONFIG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1CONFIG;

