iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res5[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MD:2;
      uint64_t RESERVED_1:2;
      uint64_t AM0:6;
      uint64_t RESERVED_2:1;
      uint64_t AM1:1;
      uint64_t RESERVED_3:4;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t RESERVED_0:6;
      uint64_t CAS:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS2;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MD:2;
      uint64_t RESERVED_1:2;
      uint64_t AM0:6;
      uint64_t RESERVED_2:1;
      uint64_t AM1:1;
      uint64_t RESERVED_3:4;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t RESERVED_0:6;
      uint64_t CAS:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS3;

  uint8_t res7[152];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t RESERVED_0:1;
      uint64_t PM:1;
      uint64_t RESERVED_1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t RESERVED_2:10;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_3:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN0;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t RESERVED_0:1;
      uint64_t PM:1;
      uint64_t RESERVED_1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t RESERVED_2:10;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_3:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN1;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t RESERVED_0:1;
      uint64_t PM:1;
      uint64_t RESERVED_1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t RESERVED_2:10;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_3:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN2;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t RESERVED_0:1;
      uint64_t PM:1;
      uint64_t RESERVED_1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t RESERVED_2:10;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_3:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN3;

