iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define ETHERNET_1 (*(volatile struct ETHERNET_1_tag *) 0x40010000)

struct ATIMER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOWNCOUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESETVAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESET;

  uint8_t res0[4048];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_EN:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_EN:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTAT:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTAT:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_STAT;

};

#define ATIMER_1 (*(volatile struct ATIMER_1_tag *) 0x40040000)

struct REGFILE_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_1_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGFILE_63;

