iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_EEPROM_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_EEPROM_STAT;

  uint8_t res6[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_WWDT_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_WWDT_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USART0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USART0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_UART1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_UART1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SSP0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SSP0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SCU_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SCU_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_CREG_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_CREG_STAT;

  uint8_t res7[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_RITIMER_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_RITIMER_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USART2_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USART2_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USART3_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USART3_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER2_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER2_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER3_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_TIMER3_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SSP1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SSP1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_QEI_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_QEI_STAT;

  uint8_t res8[456];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_USB0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_USB0_STAT;

  uint8_t res9[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_USB1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_USB1_STAT;

