iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PERIPH_RST:2;
      uint64_t MASTER_RST:2;
      uint64_t RESERVED_1:2;
      uint64_t WWDT_RST:2;
      uint64_t CREG_RST:2;
      uint64_t RESERVED_2:2;
      uint64_t RESERVED_3:2;
      uint64_t BUS_RST:2;
      uint64_t SCU_RST:2;
      uint64_t RESERVED_4:2;
      uint64_t RESERVED_5:2;
      uint64_t M0SUB_RST:2;
      uint64_t M3_RST:2;
      uint64_t RESERVED_6:2;
      uint64_t RESERVED_7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCD_RST:2;
      uint64_t USB0_RST:2;
      uint64_t USB1_RST:2;
      uint64_t DMA_RST:2;
      uint64_t SDIO_RST:2;
      uint64_t EMC_RST:2;
      uint64_t ETHERNET_RST:2;
      uint64_t RESERVED_0:2;
      uint64_t RESERVED_1:2;
      uint64_t FLASHA_RST:2;
      uint64_t RESERVED_2:2;
      uint64_t EEPROM_RST:2;
      uint64_t GPIO_RST:2;
      uint64_t FLASHB_RST:2;
      uint64_t RESERVED_3:2;
      uint64_t RESERVED_4:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_STATUS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0_RST:2;
      uint64_t TIMER1_RST:2;
      uint64_t TIMER2_RST:2;
      uint64_t TIMER3_RST:2;
      uint64_t RITIMER_RST:2;
      uint64_t SCT_RST:2;
      uint64_t MOTOCONPWM_RST:2;
      uint64_t QEI_RST:2;
      uint64_t ADC0_RST:2;
      uint64_t ADC1_RST:2;
      uint64_t DAC_RST:2;
      uint64_t RESERVED:2;
      uint64_t UART0_RST:2;
      uint64_t UART1_RST:2;
      uint64_t UART2_RST:2;
      uint64_t UART3_RST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_STATUS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C0_RST:2;
      uint64_t I2C1_RST:2;
      uint64_t SSP0_RST:2;
      uint64_t SSP1_RST:2;
      uint64_t I2S_RST:2;
      uint64_t SPIFI_RST:2;
      uint64_t CAN1_RST:2;
      uint64_t CAN0_RST:2;
      uint64_t RESERVED_0:2;
      uint64_t RESERVED_1:6;
      uint64_t RESERVED_2:2;
      uint64_t RESERVED_3:2;
      uint64_t RESERVED_4:2;
      uint64_t RESERVED_5:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_STATUS3;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CORE_RST:1;
      uint64_t PERIPH_RST:1;
      uint64_t MASTER_RST:1;
      uint64_t RESERVED_0:1;
      uint64_t WWDT_RST:1;
      uint64_t CREG_RST:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t BUS_RST:1;
      uint64_t SCU_RST:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t M0SUB_RST:1;
      uint64_t M3_RST:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t LCD_RST:1;
      uint64_t USB0_RST:1;
      uint64_t USB1_RST:1;
      uint64_t DMA_RST:1;
      uint64_t SDIO_RST:1;
      uint64_t EMC_RST:1;
      uint64_t ETHERNET_RST:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t FLASHA_RST:1;
      uint64_t RESERVED_9:1;
      uint64_t EEPROM_RST:1;
      uint64_t GPIO_RST:1;
      uint64_t FLASHB_RST:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_ACTIVE_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0_RST:1;
      uint64_t TIMER1_RST:1;
      uint64_t TIMER2_RST:1;
      uint64_t TIMER3_RST:1;
      uint64_t RITIMER_RST:1;
      uint64_t SCT_RST:1;
      uint64_t MOTOCONPWM_RST:1;
      uint64_t QEI_RST:1;
      uint64_t ADC0_RST:1;
      uint64_t ADC1_RST:1;
      uint64_t DAC_RST:1;
      uint64_t RESERVED_0:1;
      uint64_t UART0_RST:1;
      uint64_t UART1_RST:1;
      uint64_t UART2_RST:1;
      uint64_t UART3_RST:1;
      uint64_t I2C0_RST:1;
      uint64_t I2C1_RST:1;
      uint64_t SSP0_RST:1;
      uint64_t SSP1_RST:1;
      uint64_t I2S_RST:1;
      uint64_t SPIFI_RST:1;
      uint64_t CAN1_RST:1;
      uint64_t CAN0_RST:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:3;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_ACTIVE_STATUS1;

  uint8_t res2[684];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t CORE_RESET:1;
      uint64_t RESERVED_1:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PERIPHERAL_RESET:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT2;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t CORE_RESET:1;
      uint64_t RESERVED_1:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT5;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PERIPHERAL_RESET:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PERIPHERAL_RESET:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT9;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT13;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MASTER_RESET:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_EXT_STAT22;

