iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define TIMER2_1 (*(volatile struct TIMER2_1_tag *) 0x400c3000)

struct TIMER3_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0INT:1;
      uint64_t MR1INT:1;
      uint64_t MR2INT:1;
      uint64_t MR3INT:1;
      uint64_t CR0INT:1;
      uint64_t CR1INT:1;
      uint64_t CR2INT:1;
      uint64_t CR3INT:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t CRST:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0I:1;
      uint64_t MR0R:1;
      uint64_t MR0S:1;
      uint64_t MR1I:1;
      uint64_t MR1R:1;
      uint64_t MR1S:1;
      uint64_t MR2I:1;
      uint64_t MR2R:1;
      uint64_t MR2S:1;
      uint64_t MR3I:1;
      uint64_t MR3R:1;
      uint64_t MR3S:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0RE:1;
      uint64_t CAP0FE:1;
      uint64_t CAP0I:1;
      uint64_t CAP1RE:1;
      uint64_t CAP1FE:1;
      uint64_t CAP1I:1;
      uint64_t CAP2RE:1;
      uint64_t CAP2FE:1;
      uint64_t CAP2I:1;
      uint64_t CAP3RE:1;
      uint64_t CAP3FE:1;
      uint64_t CAP3I:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EMC0:2;
      uint64_t EMC1:2;
      uint64_t EMC2:2;
      uint64_t EMC3:2;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMODE:2;
      uint64_t CINSEL:2;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

};

#define TIMER3_1 (*(volatile struct TIMER3_1_tag *) 0x400c4000)

struct SCU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP0_1;

  uint8_t res0[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t RESERVED_0:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP1_20;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t RESERVED_0:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t RESERVED_0:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t RESERVED_0:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP2_12;

