iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_11;

  uint8_t res15[1104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSCLK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSCLK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSCLK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSCLK_3;

  uint8_t res16[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_AIM:1;
      uint64_t USB_ESEA:1;
      uint64_t USB_EPD:1;
      uint64_t RESERVED_0:1;
      uint64_t USB_EPWR:1;
      uint64_t USB_VBUS:1;
      uint64_t RESERVED_1:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSUSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCL_EFP:1;
      uint64_t RESERVED_0:1;
      uint64_t SCL_EHD:1;
      uint64_t SCL_EZI:1;
      uint64_t RESERVED_1:3;
      uint64_t SCL_ZIF:1;
      uint64_t SDA_EFP:1;
      uint64_t RESERVED_2:1;
      uint64_t SDA_EHD:1;
      uint64_t SDA_EZI:1;
      uint64_t RESERVED_3:3;
      uint64_t SDA_ZIF:1;
      uint64_t RESERVED_4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSI2C0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0_0_bitfield:1;
      uint64_t ADC0_1_bitfield:1;
      uint64_t ADC0_2_bitfield:1;
      uint64_t ADC0_3:1;
      uint64_t ADC0_4:1;
      uint64_t ADC0_5:1;
      uint64_t ADC0_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENAIO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC1_0_bitfield:1;
      uint64_t ADC1_1_bitfield:1;
      uint64_t ADC1_2_bitfield:1;
      uint64_t ADC1_3:1;
      uint64_t ADC1_4:1;
      uint64_t ADC1_5:1;
      uint64_t ADC1_6:1;
      uint64_t ADC1_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENAIO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC:1;
      uint64_t reservedSpace0:3;
      uint64_t BG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENAIO2;

  uint8_t res17[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DELAY:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCDELAYCLK;

  uint8_t res18[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMPLE_DELAY:4;
      uint64_t RESERVED_0:4;
      uint64_t DRV_DELAY:4;
      uint64_t RESERVED_1:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDDELAY;

  uint8_t res19[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN0:5;
      uint64_t PORTSEL0:3;
      uint64_t INTPIN1:5;
      uint64_t PORTSEL1:3;
      uint64_t INTPIN2:5;
      uint64_t PORTSEL2:3;
      uint64_t INTPIN3:5;
      uint64_t PORTSEL3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN4:5;
      uint64_t PORTSEL4:3;
      uint64_t INTPIN5:5;
      uint64_t PORTSEL5:3;
      uint64_t INTPIN6:5;
      uint64_t PORTSEL6:3;
      uint64_t INTPIN7:5;
      uint64_t PORTSEL7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL1;

};

#define SCU_1 (*(volatile struct SCU_1_tag *) 0x40086000)

struct GPIO_PIN_INT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMODE0:1;
      uint64_t PMODE1:1;
      uint64_t PMODE2:1;
      uint64_t PMODE3:1;
      uint64_t PMODE4:1;
      uint64_t PMODE5:1;
      uint64_t PMODE6:1;
      uint64_t PMODE7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENRL0:1;
      uint64_t ENRL1:1;
      uint64_t ENRL2:1;
      uint64_t ENRL3:1;
      uint64_t ENRL4:1;
      uint64_t ENRL5:1;
      uint64_t ENRL6:1;
      uint64_t ENRL7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENRL0:1;
      uint64_t SETENRL1:1;
      uint64_t SETENRL2:1;
      uint64_t SETENRL3:1;
      uint64_t SETENRL4:1;
      uint64_t SETENRL5:1;
      uint64_t SETENRL6:1;
      uint64_t SETENRL7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENRL0:1;
      uint64_t CENRL1:1;
      uint64_t CENRL2:1;
      uint64_t CENRL3:1;
      uint64_t CENRL4:1;
      uint64_t CENRL5:1;
      uint64_t CENRL6:1;
      uint64_t CENRL7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAF0:1;
      uint64_t ENAF1:1;
      uint64_t ENAF2:1;
      uint64_t ENAF3:1;
      uint64_t ENAF4:1;
      uint64_t ENAF5:1;
      uint64_t ENAF6:1;
      uint64_t ENAF7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENAF0:1;
      uint64_t SETENAF1:1;
      uint64_t SETENAF2:1;
      uint64_t SETENAF3:1;
      uint64_t SETENAF4:1;
      uint64_t SETENAF5:1;
      uint64_t SETENAF6:1;
      uint64_t SETENAF7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENAF0:1;
      uint64_t CENAF1:1;
      uint64_t CENAF2:1;
      uint64_t CENAF3:1;
      uint64_t CENAF4:1;
      uint64_t CENAF5:1;
      uint64_t CENAF6:1;
      uint64_t CENAF7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDET0:1;
      uint64_t RDET1:1;
      uint64_t RDET2:1;
      uint64_t RDET3:1;
      uint64_t RDET4:1;
      uint64_t RDET5:1;
      uint64_t RDET6:1;
      uint64_t RDET7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDET0:1;
      uint64_t FDET1:1;
      uint64_t FDET2:1;
      uint64_t FDET3:1;
      uint64_t FDET4:1;
      uint64_t FDET5:1;
      uint64_t FDET6:1;
      uint64_t FDET7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTAT0:1;
      uint64_t PSTAT1:1;
      uint64_t PSTAT2:1;
      uint64_t PSTAT3:1;
      uint64_t PSTAT4:1;
      uint64_t PSTAT5:1;
      uint64_t PSTAT6:1;
      uint64_t PSTAT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IST;

