iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define GPIO_GROUP_INT1_1 (*(volatile struct GPIO_GROUP_INT1_1_tag *) 0x40089000)

struct MCPWM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN0:1;
      uint64_t CENTER0:1;
      uint64_t POLA0:1;
      uint64_t DTE0:1;
      uint64_t DISUP0:1;
      uint64_t RESERVED_0:3;
      uint64_t RUN1:1;
      uint64_t CENTER1:1;
      uint64_t POLA1:1;
      uint64_t DTE1:1;
      uint64_t DISUP1:1;
      uint64_t RESERVED_1:3;
      uint64_t RUN2:1;
      uint64_t CENTER2:1;
      uint64_t POLA2:1;
      uint64_t DTE2:1;
      uint64_t DISUP2:1;
      uint64_t RESERVED_2:8;
      uint64_t INVBDC:1;
      uint64_t ACMODE:1;
      uint64_t DCMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN0_SET:1;
      uint64_t CENTER0_SET:1;
      uint64_t POLA0_SET:1;
      uint64_t DTE0_SET:1;
      uint64_t DISUP0_SET:1;
      uint64_t RESERVED_0:3;
      uint64_t RUN1_SET:1;
      uint64_t CENTER1_SET:1;
      uint64_t POLA1_SET:1;
      uint64_t DTE1_SET:1;
      uint64_t DISUP1_SET:1;
      uint64_t RESERVED_1:3;
      uint64_t RUN2_SET:1;
      uint64_t CENTER2_SET:1;
      uint64_t POLA2_SET:1;
      uint64_t DTE2_SET:1;
      uint64_t DISUP2_SET:1;
      uint64_t RESERVED_2:8;
      uint64_t INVBDC_SET:1;
      uint64_t ACMODE_SET:1;
      uint64_t DCMODE_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CON_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN0_CLR:1;
      uint64_t CENTER0_CLR:1;
      uint64_t POLA0_CLR:1;
      uint64_t DTE0_CLR:1;
      uint64_t DISUP0_CLR:1;
      uint64_t RESERVED_0:3;
      uint64_t RUN1_CLR:1;
      uint64_t CENTER1_CLR:1;
      uint64_t POLA1_CLR:1;
      uint64_t DTE1_CLR:1;
      uint64_t DISUP1_CLR:1;
      uint64_t RESERVED_1:3;
      uint64_t RUN2_CLR:1;
      uint64_t CENTER2_CLR:1;
      uint64_t POLA2_CLR:1;
      uint64_t DTE2_CLR:1;
      uint64_t DISUP2_CLR:1;
      uint64_t RESERVED_2:8;
      uint64_t INVBDC_CLR:1;
      uint64_t ACMOD_CLR:1;
      uint64_t DCMODE_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CON_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0MCI0_RE:1;
      uint64_t CAP0MCI0_FE:1;
      uint64_t CAP0MCI1_RE:1;
      uint64_t CAP0MCI1_FE:1;
      uint64_t CAP0MCI2_RE:1;
      uint64_t CAP0MCI2_FE:1;
      uint64_t CAP1MCI0_RE:1;
      uint64_t CAP1MCI0_FE:1;
      uint64_t CAP1MCI1_RE:1;
      uint64_t CAP1MCI1_FE:1;
      uint64_t CAP1MCI2_RE:1;
      uint64_t CAP1MCI2_FE:1;
      uint64_t CAP2MCI0_RE:1;
      uint64_t CAP2MCI0_FE:1;
      uint64_t CAP2MCI1_RE:1;
      uint64_t CAP2MCI1_FE:1;
      uint64_t CAP2MCI2_RE:1;
      uint64_t CAP2MCI2_FE:1;
      uint64_t RT0:1;
      uint64_t RT1:1;
      uint64_t RT2:1;
      uint64_t RESERVED:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0MCI0_RE_SET:1;
      uint64_t CAP0MCI0_FE_SET:1;
      uint64_t CAP0MCI1_RE_SET:1;
      uint64_t CAP0MCI1_FE_SET:1;
      uint64_t CAP0MCI2_RE_SET:1;
      uint64_t CAP0MCI2_FE_SET:1;
      uint64_t CAP1MCI0_RE_SET:1;
      uint64_t CAP1MCI0_FE_SET:1;
      uint64_t CAP1MCI1_RE_SET:1;
      uint64_t CAP1MCI1_FE_SET:1;
      uint64_t CAP1MCI2_RE_SET:1;
      uint64_t CAP1MCI2_FE_SET:1;
      uint64_t CAP2MCI0_RE_SET:1;
      uint64_t CAP2MCI0_FE_SET:1;
      uint64_t CAP2MCI1_RE_SET:1;
      uint64_t CAP2MCI1_FE_SET:1;
      uint64_t CAP2MCI2_RE_SET:1;
      uint64_t CAP2MCI2_FE_SET:1;
      uint64_t RT0_SET:1;
      uint64_t RT1_SET:1;
      uint64_t RT2_SET:1;
      uint64_t RESERVED:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPCON_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0MCI0_RE_CLR:1;
      uint64_t CAP0MCI0_FE_CLR:1;
      uint64_t CAP0MCI1_RE_CLR:1;
      uint64_t CAP0MCI1_FE_CLR:1;
      uint64_t CAP0MCI2_RE_CLR:1;
      uint64_t CAP0MCI2_FE_CLR:1;
      uint64_t CAP1MCI0_RE_CLR:1;
      uint64_t CAP1MCI0_FE_CLR:1;
      uint64_t CAP1MCI1_RE_CLR:1;
      uint64_t CAP1MCI1_FE_CLR:1;
      uint64_t CAP1MCI2_RE_CLR:1;
      uint64_t CAP1MCI2_FE_CLR:1;
      uint64_t CAP2MCI0_RE_CLR:1;
      uint64_t CAP2MCI0_FE_CLR:1;
      uint64_t CAP2MCI1_RE_CLR:1;
      uint64_t CAP2MCI1_FE_CLR:1;
      uint64_t CAP2MCI2_RE_CLR:1;
      uint64_t CAP2MCI2_FE_CLR:1;
      uint64_t RT0_CLR:1;
      uint64_t RT1_CLR:1;
      uint64_t RT2_CLR:1;
      uint64_t RESERVED:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPCON_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCTC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCTC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCTC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCLIM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCLIM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCLIM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DT0:10;
      uint64_t DT1:10;
      uint64_t DT2:10;
      uint64_t RESERVED:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCPA0:1;
      uint64_t CCPB0:1;
      uint64_t CCPA1:1;
      uint64_t CCPB1:1;
      uint64_t CCPA2:1;
      uint64_t CCPB2:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILIM0:1;
      uint64_t IMAT0:1;
      uint64_t ICAP0:1;
      uint64_t RESERVED_0:1;
      uint64_t ILIM1:1;
      uint64_t IMAT1:1;
      uint64_t ICAP1:1;
      uint64_t RESERVED_1:1;
      uint64_t ILIM2:1;
      uint64_t IMAT2:1;
      uint64_t ICAP2:1;
      uint64_t RESERVED_2:4;
      uint64_t ABORT:1;
      uint64_t RESERVED_3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILIM0_SET:1;
      uint64_t IMAT0_SET:1;
      uint64_t ICAP0_SET:1;
      uint64_t RESERVED_0:1;
      uint64_t ILIM1_SET:1;
      uint64_t IMAT1_SET:1;
      uint64_t ICAP1_SET:1;
      uint64_t RESERVED_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ILIM2_SET:1;
      uint64_t IMAT2_SET:1;
      uint64_t ICAP2_SET:1;
      uint64_t RESERVED_2:3;
      uint64_t ABORT_SET:1;
      uint64_t RESERVED_3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILIM0_CLR:1;
      uint64_t IMAT0_CLR:1;
      uint64_t ICAP0_CLR:1;
      uint64_t RESERVED_0:1;
      uint64_t ILIM1_CLR:1;
      uint64_t IMAT1_CLR:1;
      uint64_t ICAP1_CLR:1;
      uint64_t RESERVED_1:1;
      uint64_t ILIM2_CLR:1;
      uint64_t IMAT2_CLR:1;
      uint64_t ICAP2_CLR:1;
      uint64_t RESERVED_2:4;
      uint64_t ABORT_CLR:1;
      uint64_t RESERVED_3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC0MCI0_RE:1;
      uint64_t TC0MCI0_FE:1;
      uint64_t TC0MCI1_RE:1;
      uint64_t TC0MCI1_FE:1;
      uint64_t TC0MCI2_RE:1;
      uint64_t TC0MCI2_FE:1;
      uint64_t TC1MCI0_RE:1;
      uint64_t TC1MCI0_FE:1;
      uint64_t TC1MCI1_RE:1;
      uint64_t TC1MCI1_FE:1;
      uint64_t TC1MCI2_RE:1;
      uint64_t TC1MCI2_FE:1;
      uint64_t TC2MCI0_RE:1;
      uint64_t TC2MCI0_FE:1;
      uint64_t TC2MCI1_RE:1;
      uint64_t TC2MCI1_FE:1;
      uint64_t TC2MCI2_RE:1;
      uint64_t TC2MCI2_FE:1;
      uint64_t RESERVED:11;
      uint64_t CNTR0:1;
      uint64_t CNTR1:1;
      uint64_t CNTR2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC0MCI0_RE_SET:1;
      uint64_t TC0MCI0_FE_SET:1;
      uint64_t TC0MCI1_RE_SET:1;
      uint64_t TC0MCI1_FE_SET:1;
      uint64_t TC0MCI2_RE_SET:1;
      uint64_t TC0MCI2_FE_SET:1;
      uint64_t TC1MCI0_RE_SET:1;
      uint64_t TC1MCI0_FE_SET:1;
      uint64_t TC1MCI1_RE_SET:1;
      uint64_t TC1MCI1_FE_SET:1;
      uint64_t TC1MCI2_RE_SET:1;
      uint64_t TC1MCI2_FE_SET:1;
      uint64_t TC2MCI0_RE_SET:1;
      uint64_t TC2MCI0_FE_SET:1;
      uint64_t TC2MCI1_RE_SET:1;
      uint64_t TC2MCI1_FE_SET:1;
      uint64_t TC2MCI2_RE_SET:1;
      uint64_t TC2MCI2_FE_SET:1;
      uint64_t RESERVED:11;
      uint64_t CNTR0_SET:1;
      uint64_t CNTR1_SET:1;
      uint64_t CNTR2_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTCON_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC0MCI0_RE_CLR:1;
      uint64_t TC0MCI0_FE_CLR:1;
      uint64_t TC0MCI1_RE_CLR:1;
      uint64_t TC0MCI1_FE_CLR:1;
      uint64_t TC0MCI2_RE:1;
      uint64_t TC0MCI2_FE_CLR:1;
      uint64_t TC1MCI0_RE_CLR:1;
      uint64_t TC1MCI0_FE_CLR:1;
      uint64_t TC1MCI1_RE_CLR:1;
      uint64_t TC1MCI1_FE_CLR:1;
      uint64_t TC1MCI2_RE_CLR:1;
      uint64_t TC1MCI2_FE_CLR:1;
      uint64_t TC2MCI0_RE_CLR:1;
      uint64_t TC2MCI0_FE_CLR:1;
      uint64_t TC2MCI1_RE_CLR:1;
      uint64_t TC2MCI1_FE_CLR:1;
      uint64_t TC2MCI2_RE_CLR:1;
      uint64_t TC2MCI2_FE_CLR:1;
      uint64_t RESERVED:11;
      uint64_t CNTR0_CLR:1;
      uint64_t CNTR1_CLR:1;
      uint64_t CNTR2_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTCON_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILIM0_F:1;
      uint64_t IMAT0_F:1;
      uint64_t ICAP0_F:1;
      uint64_t RESERVED_0:1;
      uint64_t ILIM1_F:1;
      uint64_t IMAT1_F:1;
      uint64_t ICAP1_F:1;
      uint64_t RESERVED_1:1;
      uint64_t ILIM2_F:1;
      uint64_t IMAT2_F:1;
      uint64_t ICAP2_F:1;
      uint64_t RESERVED_2:4;
      uint64_t ABORT_F:1;
      uint64_t RESERVED_3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILIM0_F_SET:1;
      uint64_t IMAT0_F_SET:1;
      uint64_t ICAP0_F_SET:1;
      uint64_t RESERVED_0:1;
      uint64_t ILIM1_F_SET:1;
      uint64_t IMAT1_F_SET:1;
      uint64_t ICAP1_F_SET:1;
      uint64_t RESERVED_1:1;
      uint64_t ILIM2_F_SET:1;
      uint64_t IMAT2_F_SET:1;
      uint64_t ICAP2_F_SET:1;
      uint64_t RESERVED_2:4;
      uint64_t ABORT_F_SET:1;
      uint64_t RESERVED_3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILIM0_F_CLR:1;
      uint64_t IMAT0_F_CLR:1;
      uint64_t ICAP0_F_CLR:1;
      uint64_t RESERVED_0:1;
      uint64_t ILIM1_F_CLR:1;
      uint64_t IMAT1_F_CLR:1;
      uint64_t ICAP1_F_CLR:1;
      uint64_t RESERVED_1:1;
      uint64_t ILIM2_F_CLR:1;
      uint64_t IMAT2_F_CLR:1;
      uint64_t ICAP2_F_CLR:1;
      uint64_t RESERVED_2:4;
      uint64_t ABORT_F_CLR:1;
      uint64_t RESERVED_3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_CLR0:1;
      uint64_t CAP_CLR1:1;
      uint64_t CAP_CLR2:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_CLR;

