iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define I2S1_1 (*(volatile struct I2S1_1_tag *) 0x400a3000)

struct RITIMER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RITINT:1;
      uint64_t RITENCLR:1;
      uint64_t RITENBR:1;
      uint64_t RITEN:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOUNTER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

};

#define RITIMER_1 (*(volatile struct RITIMER_1_tag *) 0x400c0000)

struct QEI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESP:1;
      uint64_t RESPI:1;
      uint64_t RESV:1;
      uint64_t RESI:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIR:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRINV:1;
      uint64_t SIGMODE:1;
      uint64_t CAPMODE:1;
      uint64_t INVINX:1;
      uint64_t CRESPI:1;
      uint64_t RESERVED_0:11;
      uint64_t INXGATE:4;
      uint64_t RESERVED_1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXPOS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAXPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCMP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPOS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCMP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPOS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCMP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPOS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENCPOS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INXCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICMP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INXCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VELLOAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VELVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VELPC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VELCAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VELCMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VELCOMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILTA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FILTERPHA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILTB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FILTERPHB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FITLINX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FILTERINX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WINDOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICMP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INXCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICMP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INXCMP2;

  uint8_t res0[3972];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INX_EN:1;
      uint64_t TIM_EN:1;
      uint64_t VELC_EN:1;
      uint64_t DIR_EN:1;
      uint64_t ERR_EN:1;
      uint64_t ENCLK_EN:1;
      uint64_t POS0_Int:1;
      uint64_t POS1_Int:1;
      uint64_t POS2_Int:1;
      uint64_t REV_Int:1;
      uint64_t POS0REV_Int:1;
      uint64_t POS1REV_Int:1;
      uint64_t POS2REV_Int:1;
      uint64_t REV1_Int:1;
      uint64_t REV2_Int:1;
      uint64_t MAXPOS_Int:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INX_EN:1;
      uint64_t TIM_EN:1;
      uint64_t VELC_EN:1;
      uint64_t DIR_EN:1;
      uint64_t ERR_EN:1;
      uint64_t ENCLK_EN:1;
      uint64_t POS0_Int:1;
      uint64_t POS1_Int:1;
      uint64_t POS2_Int:1;
      uint64_t REV_Int:1;
      uint64_t POS0REV_Int:1;
      uint64_t POS1REV_Int:1;
      uint64_t POS2REV_Int:1;
      uint64_t REV1_Int:1;
      uint64_t REV2_Int:1;
      uint64_t MAXPOS_Int:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INX_Int:1;
      uint64_t TIM_Int:1;
      uint64_t VELC_Int:1;
      uint64_t DIR_Int:1;
      uint64_t ERR_Int:1;
      uint64_t ENCLK_Int:1;
      uint64_t POS0_Int:1;
      uint64_t POS1_Int:1;
      uint64_t POS2_Int:1;
      uint64_t REV_Int:1;
      uint64_t POS0REV_Int:1;
      uint64_t POS1REV_Int:1;
      uint64_t POS2REV_Int:1;
      uint64_t REV1_Int:1;
      uint64_t REV2_Int:1;
      uint64_t MAXPOS_Int:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INX_Int:1;
      uint64_t TIM_Int:1;
      uint64_t VELC_Int:1;
      uint64_t DIR_Int:1;
      uint64_t ERR_Int:1;
      uint64_t ENCLK_Int:1;
      uint64_t POS0_Int:1;
      uint64_t POS1_Int:1;
      uint64_t POS2_Int:1;
      uint64_t REV_Int:1;
      uint64_t POS0REV_Int:1;
      uint64_t POS1REV_Int:1;
      uint64_t POS2REV_Int:1;
      uint64_t REV1_Int:1;
      uint64_t REV2_Int:1;
      uint64_t MAXPOS_Int:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INX_Int:1;
      uint64_t TIM_Int:1;
      uint64_t VELC_Int:1;
      uint64_t DIR_Int:1;
      uint64_t ERR_Int:1;
      uint64_t ENCLK_Int:1;
      uint64_t POS0_Int:1;
      uint64_t POS1_Int:1;
      uint64_t POS2_Int:1;
      uint64_t REV_Int:1;
      uint64_t POS0REV_Int:1;
      uint64_t POS1REV_Int:1;
      uint64_t reservedSpace0:1;
      uint64_t REV1_Int:1;
      uint64_t REV2_Int:1;
      uint64_t MAXPOS_Int:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INX_Int:1;
      uint64_t TIM_Int:1;
      uint64_t VELC_Int:1;
      uint64_t DIR_Int:1;
      uint64_t ERR_Int:1;
      uint64_t ENCLK_Int:1;
      uint64_t POS0_Int:1;
      uint64_t POS1_Int:1;
      uint64_t POS2_Int:1;
      uint64_t REV_Int:1;
      uint64_t POS0REV_Int:1;
      uint64_t POS1REV_Int:1;
      uint64_t POS2REV_Int:1;
      uint64_t REV1_Int:1;
      uint64_t REV2_Int:1;
      uint64_t MAXPOS_Int:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

