iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define QEI_1 (*(volatile struct QEI_1_tag *) 0x400c6000)

struct GIMA_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP0_0_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP0_1_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP0_2_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP0_3_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP1_0_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP1_1_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP1_2_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP1_3_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP2_0_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP2_1_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP2_2_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP2_3_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP3_0_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP3_1_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP3_2_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP3_3_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_0_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_1_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_2_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_3_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_4_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_5_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_6_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTIN_7_IN;

