iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_255;

  uint8_t res1[3072];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP0:1;
      uint64_t DIRP1:1;
      uint64_t DIRP2:1;
      uint64_t DIRP3:1;
      uint64_t DIRP4:1;
      uint64_t DIRP5:1;
      uint64_t DIRP6:1;
      uint64_t DIRP7:1;
      uint64_t DIRP8:1;
      uint64_t DIRP9:1;
      uint64_t DIRP10:1;
      uint64_t DIRP11:1;
      uint64_t DIRP12:1;
      uint64_t DIRP13:1;
      uint64_t DIRP14:1;
      uint64_t DIRP15:1;
      uint64_t DIRP16:1;
      uint64_t DIRP17:1;
      uint64_t DIRP18:1;
      uint64_t DIRP19:1;
      uint64_t DIRP20:1;
      uint64_t DIRP21:1;
      uint64_t DIRP22:1;
      uint64_t DIRP23:1;
      uint64_t DIRP24:1;
      uint64_t DIRP25:1;
      uint64_t DIRP26:1;
      uint64_t DIRP27:1;
      uint64_t DIRP28:1;
      uint64_t DIRP29:1;
      uint64_t DIRP30:1;
      uint64_t DIRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR7;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP0:1;
      uint64_t MASKP1:1;
      uint64_t MASKP2:1;
      uint64_t MASKP3:1;
      uint64_t MASKP4:1;
      uint64_t MASKP5:1;
      uint64_t MASKP6:1;
      uint64_t MASKP7:1;
      uint64_t MASKP8:1;
      uint64_t MASKP9:1;
      uint64_t MASKP10:1;
      uint64_t MASKP11:1;
      uint64_t MASKP12:1;
      uint64_t MASKP13:1;
      uint64_t MASKP14:1;
      uint64_t MASKP15:1;
      uint64_t MASKP16:1;
      uint64_t MASKP17:1;
      uint64_t MASKP18:1;
      uint64_t MASKP19:1;
      uint64_t MASKP20:1;
      uint64_t MASKP21:1;
      uint64_t MASKP22:1;
      uint64_t MASKP23:1;
      uint64_t MASKP24:1;
      uint64_t MASKP25:1;
      uint64_t MASKP26:1;
      uint64_t MASKP27:1;
      uint64_t MASKP28:1;
      uint64_t MASKP29:1;
      uint64_t MASKP30:1;
      uint64_t MASKP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK7;

  uint8_t res3[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
      uint64_t PORT3:1;
      uint64_t PORT4:1;
      uint64_t PORT5:1;
      uint64_t PORT6:1;
      uint64_t PORT7:1;
      uint64_t PORT8:1;
      uint64_t PORT9:1;
      uint64_t PORT10:1;
      uint64_t PORT11:1;
      uint64_t PORT12:1;
      uint64_t PORT13:1;
      uint64_t PORT14:1;
      uint64_t PORT15:1;
      uint64_t PORT16:1;
      uint64_t PORT17:1;
      uint64_t PORT18:1;
      uint64_t PORT19:1;
      uint64_t PORT20:1;
      uint64_t PORT21:1;
      uint64_t PORT22:1;
      uint64_t PORT23:1;
      uint64_t PORT24:1;
      uint64_t PORT25:1;
      uint64_t PORT26:1;
      uint64_t PORT27:1;
      uint64_t PORT28:1;
      uint64_t PORT29:1;
      uint64_t PORT30:1;
      uint64_t PORT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN5;

