iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define System_Control_Space_NVIC_2 (*(volatile struct System_Control_Space_NVIC_2_tag *) 0xe000e100)

struct System_Control_Space_SysTick_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick_2 (*(volatile struct System_Control_Space_SysTick_2_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct WATCHDOG0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_LOAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_CTL_INTEN:1;
      uint64_t WDT_CTL_RESEN:1;
      uint64_t WDT_CTL_INTTYPE:1;
      uint64_t reservedSpace0:28;
      uint64_t WDT_CTL_WRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_ICR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_RIS_WDTRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_MIS_WDTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0MIS;

  uint8_t res0[1024];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t WDT_TEST_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0TEST;

  uint8_t res1[2020];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_LOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0LOCK;

};

#define WATCHDOG0 (*(volatile struct WATCHDOG0_tag *) 0x40000000)

struct WATCHDOG1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_LOAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_CTL_INTEN:1;
      uint64_t WDT_CTL_RESEN:1;
      uint64_t WDT_CTL_INTTYPE:1;
      uint64_t reservedSpace0:28;
      uint64_t WDT_CTL_WRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_ICR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_RIS_WDTRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_MIS_WDTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0MIS;

