iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res0[1024];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t WDT_TEST_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0TEST;

  uint8_t res1[2020];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_LOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG0LOCK;

};

#define WATCHDOG1 (*(volatile struct WATCHDOG1_tag *) 0x40001000)

struct SSI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CR0_DSS:4;
      uint64_t SSI_CR0_FRF:2;
      uint64_t SSI_CR0_SPO:1;
      uint64_t SSI_CR0_SPH:1;
      uint64_t SSI_CR0_SCR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CR1_LBM:1;
      uint64_t SSI_CR1_SSE:1;
      uint64_t SSI_CR1_MS:1;
      uint64_t reservedSpace0:1;
      uint64_t SSI_CR1_EOT:1;
      uint64_t reservedSpace1:1;
      uint64_t SSI_CR1_MODE:2;
      uint64_t SSI_CR1_DIR:1;
      uint64_t SSI_CR1_HSCLKEN:1;
      uint64_t SSI_CR1_FSSHLDFRM:1;
      uint64_t SSI_CR1_EOM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_DR_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_SR_TFE:1;
      uint64_t SSI_SR_TNF:1;
      uint64_t SSI_SR_RNE:1;
      uint64_t SSI_SR_RFF:1;
      uint64_t SSI_SR_BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CPSR_CPSDVSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_IM_RORIM:1;
      uint64_t SSI_IM_RTIM:1;
      uint64_t SSI_IM_RXIM:1;
      uint64_t SSI_IM_TXIM:1;
      uint64_t SSI_IM_DMARXIM:1;
      uint64_t SSI_IM_DMATXIM:1;
      uint64_t SSI_IM_EOTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0IM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_RIS_RORRIS:1;
      uint64_t SSI_RIS_RTRIS:1;
      uint64_t SSI_RIS_RXRIS:1;
      uint64_t SSI_RIS_TXRIS:1;
      uint64_t SSI_RIS_DMARXRIS:1;
      uint64_t SSI_RIS_DMATXRIS:1;
      uint64_t SSI_RIS_EOTRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_MIS_RORMIS:1;
      uint64_t SSI_MIS_RTMIS:1;
      uint64_t SSI_MIS_RXMIS:1;
      uint64_t SSI_MIS_TXMIS:1;
      uint64_t SSI_MIS_DMARXMIS:1;
      uint64_t SSI_MIS_DMATXMIS:1;
      uint64_t SSI_MIS_EOTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_ICR_RORIC:1;
      uint64_t SSI_ICR_RTIC:1;
      uint64_t reservedSpace0:2;
      uint64_t SSI_ICR_DMARXIC:1;
      uint64_t SSI_ICR_DMATXIC:1;
      uint64_t SSI_ICR_EOTIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_DMACTL_RXDMAE:1;
      uint64_t SSI_DMACTL_TXDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0DMACTL;

  uint8_t res0[3992];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_PP_HSCLK:1;
      uint64_t SSI_PP_MODE:2;
      uint64_t SSI_PP_FSSHLDFRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0PP;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CC_CS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CC;

};

#define SSI0 (*(volatile struct SSI0_tag *) 0x40008000)

struct SSI1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CR0_DSS:4;
      uint64_t SSI_CR0_FRF:2;
      uint64_t SSI_CR0_SPO:1;
      uint64_t SSI_CR0_SPH:1;
      uint64_t SSI_CR0_SCR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CR1_LBM:1;
      uint64_t SSI_CR1_SSE:1;
      uint64_t SSI_CR1_MS:1;
      uint64_t reservedSpace0:1;
      uint64_t SSI_CR1_EOT:1;
      uint64_t reservedSpace1:1;
      uint64_t SSI_CR1_MODE:2;
      uint64_t SSI_CR1_DIR:1;
      uint64_t SSI_CR1_HSCLKEN:1;
      uint64_t SSI_CR1_FSSHLDFRM:1;
      uint64_t SSI_CR1_EOM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_DR_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_SR_TFE:1;
      uint64_t SSI_SR_TNF:1;
      uint64_t SSI_SR_RNE:1;
      uint64_t SSI_SR_RFF:1;
      uint64_t SSI_SR_BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CPSR_CPSDVSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_IM_RORIM:1;
      uint64_t SSI_IM_RTIM:1;
      uint64_t SSI_IM_RXIM:1;
      uint64_t SSI_IM_TXIM:1;
      uint64_t SSI_IM_DMARXIM:1;
      uint64_t SSI_IM_DMATXIM:1;
      uint64_t SSI_IM_EOTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0IM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_RIS_RORRIS:1;
      uint64_t SSI_RIS_RTRIS:1;
      uint64_t SSI_RIS_RXRIS:1;
      uint64_t SSI_RIS_TXRIS:1;
      uint64_t SSI_RIS_DMARXRIS:1;
      uint64_t SSI_RIS_DMATXRIS:1;
      uint64_t SSI_RIS_EOTRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_MIS_RORMIS:1;
      uint64_t SSI_MIS_RTMIS:1;
      uint64_t SSI_MIS_RXMIS:1;
      uint64_t SSI_MIS_TXMIS:1;
      uint64_t SSI_MIS_DMARXMIS:1;
      uint64_t SSI_MIS_DMATXMIS:1;
      uint64_t SSI_MIS_EOTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_ICR_RORIC:1;
      uint64_t SSI_ICR_RTIC:1;
      uint64_t reservedSpace0:2;
      uint64_t SSI_ICR_DMARXIC:1;
      uint64_t SSI_ICR_DMATXIC:1;
      uint64_t SSI_ICR_EOTIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_DMACTL_RXDMAE:1;
      uint64_t SSI_DMACTL_TXDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0DMACTL;

  uint8_t res0[3992];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_PP_HSCLK:1;
      uint64_t SSI_PP_MODE:2;
      uint64_t SSI_PP_FSSHLDFRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0PP;

