iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSI_CC_CS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSI0CC;

};

#define SSI3 (*(volatile struct SSI3_tag *) 0x4000b000)

struct PWM0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_CTL_GLOBALSYNC0:1;
      uint64_t PWM_CTL_GLOBALSYNC1:1;
      uint64_t PWM_CTL_GLOBALSYNC2:1;
      uint64_t PWM_CTL_GLOBALSYNC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_SYNC_SYNC0:1;
      uint64_t PWM_SYNC_SYNC1:1;
      uint64_t PWM_SYNC_SYNC2:1;
      uint64_t PWM_SYNC_SYNC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0SYNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_ENABLE_PWM0EN:1;
      uint64_t PWM_ENABLE_PWM1EN:1;
      uint64_t PWM_ENABLE_PWM2EN:1;
      uint64_t PWM_ENABLE_PWM3EN:1;
      uint64_t PWM_ENABLE_PWM4EN:1;
      uint64_t PWM_ENABLE_PWM5EN:1;
      uint64_t PWM_ENABLE_PWM6EN:1;
      uint64_t PWM_ENABLE_PWM7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0ENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_INVERT_PWM0INV:1;
      uint64_t PWM_INVERT_PWM1INV:1;
      uint64_t PWM_INVERT_PWM2INV:1;
      uint64_t PWM_INVERT_PWM3INV:1;
      uint64_t PWM_INVERT_PWM4INV:1;
      uint64_t PWM_INVERT_PWM5INV:1;
      uint64_t PWM_INVERT_PWM6INV:1;
      uint64_t PWM_INVERT_PWM7INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0INVERT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_FAULT_FAULT0:1;
      uint64_t PWM_FAULT_FAULT1:1;
      uint64_t PWM_FAULT_FAULT2:1;
      uint64_t PWM_FAULT_FAULT3:1;
      uint64_t PWM_FAULT_FAULT4:1;
      uint64_t PWM_FAULT_FAULT5:1;
      uint64_t PWM_FAULT_FAULT6:1;
      uint64_t PWM_FAULT_FAULT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0FAULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_INTEN_INTPWM0:1;
      uint64_t PWM_INTEN_INTPWM1:1;
      uint64_t PWM_INTEN_INTPWM2:1;
      uint64_t PWM_INTEN_INTPWM3:1;
      uint64_t reservedSpace0:12;
      uint64_t PWM_INTEN_INTFAULT0:1;
      uint64_t PWM_INTEN_INTFAULT1:1;
      uint64_t PWM_INTEN_INTFAULT2:1;
      uint64_t PWM_INTEN_INTFAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_RIS_INTPWM0:1;
      uint64_t PWM_RIS_INTPWM1:1;
      uint64_t PWM_RIS_INTPWM2:1;
      uint64_t PWM_RIS_INTPWM3:1;
      uint64_t reservedSpace0:12;
      uint64_t PWM_RIS_INTFAULT0:1;
      uint64_t PWM_RIS_INTFAULT1:1;
      uint64_t PWM_RIS_INTFAULT2:1;
      uint64_t PWM_RIS_INTFAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_ISC_INTPWM0:1;
      uint64_t PWM_ISC_INTPWM1:1;
      uint64_t PWM_ISC_INTPWM2:1;
      uint64_t PWM_ISC_INTPWM3:1;
      uint64_t reservedSpace0:12;
      uint64_t PWM_ISC_INTFAULT0:1;
      uint64_t PWM_ISC_INTFAULT1:1;
      uint64_t PWM_ISC_INTFAULT2:1;
      uint64_t PWM_ISC_INTFAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0ISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_STATUS_FAULT0:1;
      uint64_t PWM_STATUS_FAULT1:1;
      uint64_t PWM_STATUS_FAULT2:1;
      uint64_t PWM_STATUS_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_FAULTVAL_PWM0:1;
      uint64_t PWM_FAULTVAL_PWM1:1;
      uint64_t PWM_FAULTVAL_PWM2:1;
      uint64_t PWM_FAULTVAL_PWM3:1;
      uint64_t PWM_FAULTVAL_PWM4:1;
      uint64_t PWM_FAULTVAL_PWM5:1;
      uint64_t PWM_FAULTVAL_PWM6:1;
      uint64_t PWM_FAULTVAL_PWM7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0FAULTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_ENUPD_ENUPD0:2;
      uint64_t PWM_ENUPD_ENUPD1:2;
      uint64_t PWM_ENUPD_ENUPD2:2;
      uint64_t PWM_ENUPD_ENUPD3:2;
      uint64_t PWM_ENUPD_ENUPD4:2;
      uint64_t PWM_ENUPD_ENUPD5:2;
      uint64_t PWM_ENUPD_ENUPD6:2;
      uint64_t PWM_ENUPD_ENUPD7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0ENUPD;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_CTL_ENABLE:1;
      uint64_t PWM_0_CTL_MODE:1;
      uint64_t PWM_0_CTL_DEBUG:1;
      uint64_t PWM_0_CTL_LOADUPD:1;
      uint64_t PWM_0_CTL_CMPAUPD:1;
      uint64_t PWM_0_CTL_CMPBUPD:1;
      uint64_t PWM_0_CTL_GENAUPD:2;
      uint64_t PWM_0_CTL_GENBUPD:2;
      uint64_t PWM_0_CTL_DBCTLUPD:2;
      uint64_t PWM_0_CTL_DBRISEUPD:2;
      uint64_t PWM_0_CTL_DBFALLUPD:2;
      uint64_t PWM_0_CTL_FLTSRC:1;
      uint64_t PWM_0_CTL_MINFLTPER:1;
      uint64_t PWM_0_CTL_LATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_INTEN_INTCNTZERO:1;
      uint64_t PWM_0_INTEN_INTCNTLOAD:1;
      uint64_t PWM_0_INTEN_INTCMPAU:1;
      uint64_t PWM_0_INTEN_INTCMPAD:1;
      uint64_t PWM_0_INTEN_INTCMPBU:1;
      uint64_t PWM_0_INTEN_INTCMPBD:1;
      uint64_t reservedSpace0:2;
      uint64_t PWM_0_INTEN_TRCNTZERO:1;
      uint64_t PWM_0_INTEN_TRCNTLOAD:1;
      uint64_t PWM_0_INTEN_TRCMPAU:1;
      uint64_t PWM_0_INTEN_TRCMPAD:1;
      uint64_t PWM_0_INTEN_TRCMPBU:1;
      uint64_t PWM_0_INTEN_TRCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_RIS_INTCNTZERO:1;
      uint64_t PWM_0_RIS_INTCNTLOAD:1;
      uint64_t PWM_0_RIS_INTCMPAU:1;
      uint64_t PWM_0_RIS_INTCMPAD:1;
      uint64_t PWM_0_RIS_INTCMPBU:1;
      uint64_t PWM_0_RIS_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_ISC_INTCNTZERO:1;
      uint64_t PWM_0_ISC_INTCNTLOAD:1;
      uint64_t PWM_0_ISC_INTCMPAU:1;
      uint64_t PWM_0_ISC_INTCMPAD:1;
      uint64_t PWM_0_ISC_INTCMPBU:1;
      uint64_t PWM_0_ISC_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_ISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_LOAD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_CMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_CMPA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_CMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_CMPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_GENA_ACTZERO:2;
      uint64_t PWM_0_GENA_ACTLOAD:2;
      uint64_t PWM_0_GENA_ACTCMPAU:2;
      uint64_t PWM_0_GENA_ACTCMPAD:2;
      uint64_t PWM_0_GENA_ACTCMPBU:2;
      uint64_t PWM_0_GENA_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_GENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_GENB_ACTZERO:2;
      uint64_t PWM_0_GENB_ACTLOAD:2;
      uint64_t PWM_0_GENB_ACTCMPAU:2;
      uint64_t PWM_0_GENB_ACTCMPAD:2;
      uint64_t PWM_0_GENB_ACTCMPBU:2;
      uint64_t PWM_0_GENB_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_GENB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_DBCTL_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_DBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_DBRISE_DELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_DBRISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_DBFALL_DELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_DBFALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_FLTSRC0_FAULT0:1;
      uint64_t PWM_0_FLTSRC0_FAULT1:1;
      uint64_t PWM_0_FLTSRC0_FAULT2:1;
      uint64_t PWM_0_FLTSRC0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_FLTSRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_FLTSRC1_DCMP0:1;
      uint64_t PWM_0_FLTSRC1_DCMP1:1;
      uint64_t PWM_0_FLTSRC1_DCMP2:1;
      uint64_t PWM_0_FLTSRC1_DCMP3:1;
      uint64_t PWM_0_FLTSRC1_DCMP4:1;
      uint64_t PWM_0_FLTSRC1_DCMP5:1;
      uint64_t PWM_0_FLTSRC1_DCMP6:1;
      uint64_t PWM_0_FLTSRC1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_FLTSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_MINFLTPER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_MINFLTPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_CTL_ENABLE:1;
      uint64_t PWM_1_CTL_MODE:1;
      uint64_t PWM_1_CTL_DEBUG:1;
      uint64_t PWM_1_CTL_LOADUPD:1;
      uint64_t PWM_1_CTL_CMPAUPD:1;
      uint64_t PWM_1_CTL_CMPBUPD:1;
      uint64_t PWM_1_CTL_GENAUPD:2;
      uint64_t PWM_1_CTL_GENBUPD:2;
      uint64_t PWM_1_CTL_DBCTLUPD:2;
      uint64_t PWM_1_CTL_DBRISEUPD:2;
      uint64_t PWM_1_CTL_DBFALLUPD:2;
      uint64_t PWM_1_CTL_FLTSRC:1;
      uint64_t PWM_1_CTL_MINFLTPER:1;
      uint64_t PWM_1_CTL_LATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_INTEN_INTCNTZERO:1;
      uint64_t PWM_1_INTEN_INTCNTLOAD:1;
      uint64_t PWM_1_INTEN_INTCMPAU:1;
      uint64_t PWM_1_INTEN_INTCMPAD:1;
      uint64_t PWM_1_INTEN_INTCMPBU:1;
      uint64_t PWM_1_INTEN_INTCMPBD:1;
      uint64_t reservedSpace0:2;
      uint64_t PWM_1_INTEN_TRCNTZERO:1;
      uint64_t PWM_1_INTEN_TRCNTLOAD:1;
      uint64_t PWM_1_INTEN_TRCMPAU:1;
      uint64_t PWM_1_INTEN_TRCMPAD:1;
      uint64_t PWM_1_INTEN_TRCMPBU:1;
      uint64_t PWM_1_INTEN_TRCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_RIS_INTCNTZERO:1;
      uint64_t PWM_1_RIS_INTCNTLOAD:1;
      uint64_t PWM_1_RIS_INTCMPAU:1;
      uint64_t PWM_1_RIS_INTCMPAD:1;
      uint64_t PWM_1_RIS_INTCMPBU:1;
      uint64_t PWM_1_RIS_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_ISC_INTCNTZERO:1;
      uint64_t PWM_1_ISC_INTCNTLOAD:1;
      uint64_t PWM_1_ISC_INTCMPAU:1;
      uint64_t PWM_1_ISC_INTCMPAD:1;
      uint64_t PWM_1_ISC_INTCMPBU:1;
      uint64_t PWM_1_ISC_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_ISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_LOAD_LOAD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_COUNT_COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_CMPA_COMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_CMPA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_CMPB_COMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_CMPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_GENA_ACTZERO:2;
      uint64_t PWM_1_GENA_ACTLOAD:2;
      uint64_t PWM_1_GENA_ACTCMPAU:2;
      uint64_t PWM_1_GENA_ACTCMPAD:2;
      uint64_t PWM_1_GENA_ACTCMPBU:2;
      uint64_t PWM_1_GENA_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_GENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_GENB_ACTZERO:2;
      uint64_t PWM_1_GENB_ACTLOAD:2;
      uint64_t PWM_1_GENB_ACTCMPAU:2;
      uint64_t PWM_1_GENB_ACTCMPAD:2;
      uint64_t PWM_1_GENB_ACTCMPBU:2;
      uint64_t PWM_1_GENB_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_GENB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_DBCTL_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_DBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_DBRISE_RISEDELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_DBRISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_DBFALL_FALLDELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_DBFALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_FLTSRC0_FAULT0:1;
      uint64_t PWM_1_FLTSRC0_FAULT1:1;
      uint64_t PWM_1_FLTSRC0_FAULT2:1;
      uint64_t PWM_1_FLTSRC0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_FLTSRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_FLTSRC1_DCMP0:1;
      uint64_t PWM_1_FLTSRC1_DCMP1:1;
      uint64_t PWM_1_FLTSRC1_DCMP2:1;
      uint64_t PWM_1_FLTSRC1_DCMP3:1;
      uint64_t PWM_1_FLTSRC1_DCMP4:1;
      uint64_t PWM_1_FLTSRC1_DCMP5:1;
      uint64_t PWM_1_FLTSRC1_DCMP6:1;
      uint64_t PWM_1_FLTSRC1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_FLTSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_MINFLTPER_MFP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_MINFLTPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_CTL_ENABLE:1;
      uint64_t PWM_2_CTL_MODE:1;
      uint64_t PWM_2_CTL_DEBUG:1;
      uint64_t PWM_2_CTL_LOADUPD:1;
      uint64_t PWM_2_CTL_CMPAUPD:1;
      uint64_t PWM_2_CTL_CMPBUPD:1;
      uint64_t PWM_2_CTL_GENAUPD:2;
      uint64_t PWM_2_CTL_GENBUPD:2;
      uint64_t PWM_2_CTL_DBCTLUPD:2;
      uint64_t PWM_2_CTL_DBRISEUPD:2;
      uint64_t PWM_2_CTL_DBFALLUPD:2;
      uint64_t PWM_2_CTL_FLTSRC:1;
      uint64_t PWM_2_CTL_MINFLTPER:1;
      uint64_t PWM_2_CTL_LATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_INTEN_INTCNTZERO:1;
      uint64_t PWM_2_INTEN_INTCNTLOAD:1;
      uint64_t PWM_2_INTEN_INTCMPAU:1;
      uint64_t PWM_2_INTEN_INTCMPAD:1;
      uint64_t PWM_2_INTEN_INTCMPBU:1;
      uint64_t PWM_2_INTEN_INTCMPBD:1;
      uint64_t reservedSpace0:2;
      uint64_t PWM_2_INTEN_TRCNTZERO:1;
      uint64_t PWM_2_INTEN_TRCNTLOAD:1;
      uint64_t PWM_2_INTEN_TRCMPAU:1;
      uint64_t PWM_2_INTEN_TRCMPAD:1;
      uint64_t PWM_2_INTEN_TRCMPBU:1;
      uint64_t PWM_2_INTEN_TRCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_RIS_INTCNTZERO:1;
      uint64_t PWM_2_RIS_INTCNTLOAD:1;
      uint64_t PWM_2_RIS_INTCMPAU:1;
      uint64_t PWM_2_RIS_INTCMPAD:1;
      uint64_t PWM_2_RIS_INTCMPBU:1;
      uint64_t PWM_2_RIS_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_ISC_INTCNTZERO:1;
      uint64_t PWM_2_ISC_INTCNTLOAD:1;
      uint64_t PWM_2_ISC_INTCMPAU:1;
      uint64_t PWM_2_ISC_INTCMPAD:1;
      uint64_t PWM_2_ISC_INTCMPBU:1;
      uint64_t PWM_2_ISC_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_ISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_LOAD_LOAD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_COUNT_COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_CMPA_COMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_CMPA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_CMPB_COMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_CMPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_GENA_ACTZERO:2;
      uint64_t PWM_2_GENA_ACTLOAD:2;
      uint64_t PWM_2_GENA_ACTCMPAU:2;
      uint64_t PWM_2_GENA_ACTCMPAD:2;
      uint64_t PWM_2_GENA_ACTCMPBU:2;
      uint64_t PWM_2_GENA_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_GENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_GENB_ACTZERO:2;
      uint64_t PWM_2_GENB_ACTLOAD:2;
      uint64_t PWM_2_GENB_ACTCMPAU:2;
      uint64_t PWM_2_GENB_ACTCMPAD:2;
      uint64_t PWM_2_GENB_ACTCMPBU:2;
      uint64_t PWM_2_GENB_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_GENB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_DBCTL_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_DBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_DBRISE_RISEDELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_DBRISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_DBFALL_FALLDELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_DBFALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_FLTSRC0_FAULT0:1;
      uint64_t PWM_2_FLTSRC0_FAULT1:1;
      uint64_t PWM_2_FLTSRC0_FAULT2:1;
      uint64_t PWM_2_FLTSRC0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_FLTSRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_FLTSRC1_DCMP0:1;
      uint64_t PWM_2_FLTSRC1_DCMP1:1;
      uint64_t PWM_2_FLTSRC1_DCMP2:1;
      uint64_t PWM_2_FLTSRC1_DCMP3:1;
      uint64_t PWM_2_FLTSRC1_DCMP4:1;
      uint64_t PWM_2_FLTSRC1_DCMP5:1;
      uint64_t PWM_2_FLTSRC1_DCMP6:1;
      uint64_t PWM_2_FLTSRC1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_FLTSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_MINFLTPER_MFP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_MINFLTPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_CTL_ENABLE:1;
      uint64_t PWM_3_CTL_MODE:1;
      uint64_t PWM_3_CTL_DEBUG:1;
      uint64_t PWM_3_CTL_LOADUPD:1;
      uint64_t PWM_3_CTL_CMPAUPD:1;
      uint64_t PWM_3_CTL_CMPBUPD:1;
      uint64_t PWM_3_CTL_GENAUPD:2;
      uint64_t PWM_3_CTL_GENBUPD:2;
      uint64_t PWM_3_CTL_DBCTLUPD:2;
      uint64_t PWM_3_CTL_DBRISEUPD:2;
      uint64_t PWM_3_CTL_DBFALLUPD:2;
      uint64_t PWM_3_CTL_FLTSRC:1;
      uint64_t PWM_3_CTL_MINFLTPER:1;
      uint64_t PWM_3_CTL_LATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_INTEN_INTCNTZERO:1;
      uint64_t PWM_3_INTEN_INTCNTLOAD:1;
      uint64_t PWM_3_INTEN_INTCMPAU:1;
      uint64_t PWM_3_INTEN_INTCMPAD:1;
      uint64_t PWM_3_INTEN_INTCMPBU:1;
      uint64_t PWM_3_INTEN_INTCMPBD:1;
      uint64_t reservedSpace0:2;
      uint64_t PWM_3_INTEN_TRCNTZERO:1;
      uint64_t PWM_3_INTEN_TRCNTLOAD:1;
      uint64_t PWM_3_INTEN_TRCMPAU:1;
      uint64_t PWM_3_INTEN_TRCMPAD:1;
      uint64_t PWM_3_INTEN_TRCMPBU:1;
      uint64_t PWM_3_INTEN_TRCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_RIS_INTCNTZERO:1;
      uint64_t PWM_3_RIS_INTCNTLOAD:1;
      uint64_t PWM_3_RIS_INTCMPAU:1;
      uint64_t PWM_3_RIS_INTCMPAD:1;
      uint64_t PWM_3_RIS_INTCMPBU:1;
      uint64_t PWM_3_RIS_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_ISC_INTCNTZERO:1;
      uint64_t PWM_3_ISC_INTCNTLOAD:1;
      uint64_t PWM_3_ISC_INTCMPAU:1;
      uint64_t PWM_3_ISC_INTCMPAD:1;
      uint64_t PWM_3_ISC_INTCMPBU:1;
      uint64_t PWM_3_ISC_INTCMPBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_ISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_LOAD_LOAD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_COUNT_COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_CMPA_COMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_CMPA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_CMPB_COMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_CMPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_GENA_ACTZERO:2;
      uint64_t PWM_3_GENA_ACTLOAD:2;
      uint64_t PWM_3_GENA_ACTCMPAU:2;
      uint64_t PWM_3_GENA_ACTCMPAD:2;
      uint64_t PWM_3_GENA_ACTCMPBU:2;
      uint64_t PWM_3_GENA_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_GENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_GENB_ACTZERO:2;
      uint64_t PWM_3_GENB_ACTLOAD:2;
      uint64_t PWM_3_GENB_ACTCMPAU:2;
      uint64_t PWM_3_GENB_ACTCMPAD:2;
      uint64_t PWM_3_GENB_ACTCMPBU:2;
      uint64_t PWM_3_GENB_ACTCMPBD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_GENB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_DBCTL_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_DBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_DBRISE_RISEDELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_DBRISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_DBFALL_FALLDELAY:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_DBFALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_FLTSRC0_FAULT0:1;
      uint64_t PWM_3_FLTSRC0_FAULT1:1;
      uint64_t PWM_3_FLTSRC0_FAULT2:1;
      uint64_t PWM_3_FLTSRC0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_FLTSRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_FLTSRC1_DCMP0:1;
      uint64_t PWM_3_FLTSRC1_DCMP1:1;
      uint64_t PWM_3_FLTSRC1_DCMP2:1;
      uint64_t PWM_3_FLTSRC1_DCMP3:1;
      uint64_t PWM_3_FLTSRC1_DCMP4:1;
      uint64_t PWM_3_FLTSRC1_DCMP5:1;
      uint64_t PWM_3_FLTSRC1_DCMP6:1;
      uint64_t PWM_3_FLTSRC1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_FLTSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_MINFLTPER_MFP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_MINFLTPER;

  uint8_t res1[1728];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_FLTSEN_FAULT0:1;
      uint64_t PWM_0_FLTSEN_FAULT1:1;
      uint64_t PWM_0_FLTSEN_FAULT2:1;
      uint64_t PWM_0_FLTSEN_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_FLTSEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_FLTSTAT0_FAULT0:1;
      uint64_t PWM_0_FLTSTAT0_FAULT1:1;
      uint64_t PWM_0_FLTSTAT0_FAULT2:1;
      uint64_t PWM_0_FLTSTAT0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_FLTSTAT0;

