iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_0_FLTSTAT1_DCMP0:1;
      uint64_t PWM_0_FLTSTAT1_DCMP1:1;
      uint64_t PWM_0_FLTSTAT1_DCMP2:1;
      uint64_t PWM_0_FLTSTAT1_DCMP3:1;
      uint64_t PWM_0_FLTSTAT1_DCMP4:1;
      uint64_t PWM_0_FLTSTAT1_DCMP5:1;
      uint64_t PWM_0_FLTSTAT1_DCMP6:1;
      uint64_t PWM_0_FLTSTAT1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_0_FLTSTAT1;

  uint8_t res2[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_FLTSEN_FAULT0:1;
      uint64_t PWM_1_FLTSEN_FAULT1:1;
      uint64_t PWM_1_FLTSEN_FAULT2:1;
      uint64_t PWM_1_FLTSEN_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_FLTSEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_FLTSTAT0_FAULT0:1;
      uint64_t PWM_1_FLTSTAT0_FAULT1:1;
      uint64_t PWM_1_FLTSTAT0_FAULT2:1;
      uint64_t PWM_1_FLTSTAT0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_FLTSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_1_FLTSTAT1_DCMP0:1;
      uint64_t PWM_1_FLTSTAT1_DCMP1:1;
      uint64_t PWM_1_FLTSTAT1_DCMP2:1;
      uint64_t PWM_1_FLTSTAT1_DCMP3:1;
      uint64_t PWM_1_FLTSTAT1_DCMP4:1;
      uint64_t PWM_1_FLTSTAT1_DCMP5:1;
      uint64_t PWM_1_FLTSTAT1_DCMP6:1;
      uint64_t PWM_1_FLTSTAT1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_1_FLTSTAT1;

  uint8_t res3[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_FLTSEN_FAULT0:1;
      uint64_t PWM_2_FLTSEN_FAULT1:1;
      uint64_t PWM_2_FLTSEN_FAULT2:1;
      uint64_t PWM_2_FLTSEN_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_FLTSEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_FLTSTAT0_FAULT0:1;
      uint64_t PWM_2_FLTSTAT0_FAULT1:1;
      uint64_t PWM_2_FLTSTAT0_FAULT2:1;
      uint64_t PWM_2_FLTSTAT0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_FLTSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_2_FLTSTAT1_DCMP0:1;
      uint64_t PWM_2_FLTSTAT1_DCMP1:1;
      uint64_t PWM_2_FLTSTAT1_DCMP2:1;
      uint64_t PWM_2_FLTSTAT1_DCMP3:1;
      uint64_t PWM_2_FLTSTAT1_DCMP4:1;
      uint64_t PWM_2_FLTSTAT1_DCMP5:1;
      uint64_t PWM_2_FLTSTAT1_DCMP6:1;
      uint64_t PWM_2_FLTSTAT1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_2_FLTSTAT1;

  uint8_t res4[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_FLTSEN_FAULT0:1;
      uint64_t PWM_3_FLTSEN_FAULT1:1;
      uint64_t PWM_3_FLTSEN_FAULT2:1;
      uint64_t PWM_3_FLTSEN_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_FLTSEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_FLTSTAT0_FAULT0:1;
      uint64_t PWM_3_FLTSTAT0_FAULT1:1;
      uint64_t PWM_3_FLTSTAT0_FAULT2:1;
      uint64_t PWM_3_FLTSTAT0_FAULT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_FLTSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_3_FLTSTAT1_DCMP0:1;
      uint64_t PWM_3_FLTSTAT1_DCMP1:1;
      uint64_t PWM_3_FLTSTAT1_DCMP2:1;
      uint64_t PWM_3_FLTSTAT1_DCMP3:1;
      uint64_t PWM_3_FLTSTAT1_DCMP4:1;
      uint64_t PWM_3_FLTSTAT1_DCMP5:1;
      uint64_t PWM_3_FLTSTAT1_DCMP6:1;
      uint64_t PWM_3_FLTSTAT1_DCMP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0_3_FLTSTAT1;

  uint8_t res5[1588];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_PP_GCNT:4;
      uint64_t PWM_PP_FCNT:4;
      uint64_t PWM_PP_ESYNC:1;
      uint64_t PWM_PP_EFAULT:1;
      uint64_t PWM_PP_ONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0PP;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_CC_PWMDIV:3;
      uint64_t reservedSpace0:5;
      uint64_t PWM_CC_USEPWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM0CC;

};

#define PWM0 (*(volatile struct PWM0_tag *) 0x40028000)

struct QEI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_CTL_ENABLE:1;
      uint64_t QEI_CTL_SWAP:1;
      uint64_t QEI_CTL_SIGMODE:1;
      uint64_t QEI_CTL_CAPMODE:1;
      uint64_t QEI_CTL_RESMODE:1;
      uint64_t QEI_CTL_VELEN:1;
      uint64_t QEI_CTL_VELDIV:3;
      uint64_t QEI_CTL_INVA:1;
      uint64_t QEI_CTL_INVB:1;
      uint64_t QEI_CTL_INVI:1;
      uint64_t QEI_CTL_STALLEN:1;
      uint64_t QEI_CTL_FILTEN:1;
      uint64_t reservedSpace0:2;
      uint64_t QEI_CTL_FILTCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_STAT_ERROR:1;
      uint64_t QEI_STAT_DIRECTION:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_POS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0POS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_MAXPOS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0MAXPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_LOAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_TIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0TIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_SPEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0SPEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_INTEN_INDEX:1;
      uint64_t QEI_INTEN_TIMER:1;
      uint64_t QEI_INTEN_DIR:1;
      uint64_t QEI_INTEN_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_RIS_INDEX:1;
      uint64_t QEI_RIS_TIMER:1;
      uint64_t QEI_RIS_DIR:1;
      uint64_t QEI_RIS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QEI_ISC_INDEX:1;
      uint64_t QEI_ISC_TIMER:1;
      uint64_t QEI_ISC_DIR:1;
      uint64_t QEI_ISC_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEI0ISC;

