iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define QEI0 (*(volatile struct QEI0_tag *) 0x4002c000)

struct TIMER0_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAMR_TAMR:2;
      uint64_t TIMER_TAMR_TACMR:1;
      uint64_t TIMER_TAMR_TAAMS:1;
      uint64_t TIMER_TAMR_TACDIR:1;
      uint64_t TIMER_TAMR_TAMIE:1;
      uint64_t TIMER_TAMR_TAWOT:1;
      uint64_t TIMER_TAMR_TASNAPS:1;
      uint64_t TIMER_TAMR_TAILD:1;
      uint64_t TIMER_TAMR_TAPWMIE:1;
      uint64_t TIMER_TAMR_TAMRSU:1;
      uint64_t TIMER_TAMR_TAPLO:1;
      uint64_t TIMER_TAMR_TACINTD:1;
      uint64_t TIMER_TAMR_TCACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBMR_TBMR:2;
      uint64_t TIMER_TBMR_TBCMR:1;
      uint64_t TIMER_TBMR_TBAMS:1;
      uint64_t TIMER_TBMR_TBCDIR:1;
      uint64_t TIMER_TBMR_TBMIE:1;
      uint64_t TIMER_TBMR_TBWOT:1;
      uint64_t TIMER_TBMR_TBSNAPS:1;
      uint64_t TIMER_TBMR_TBILD:1;
      uint64_t TIMER_TBMR_TBPWMIE:1;
      uint64_t TIMER_TBMR_TBMRSU:1;
      uint64_t TIMER_TBMR_TBPLO:1;
      uint64_t TIMER_TBMR_TBCINTD:1;
      uint64_t TIMER_TBMR_TCACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_CTL_TAEN:1;
      uint64_t TIMER_CTL_TASTALL:1;
      uint64_t TIMER_CTL_TAEVENT:2;
      uint64_t TIMER_CTL_RTCEN:1;
      uint64_t TIMER_CTL_TAOTE:1;
      uint64_t TIMER_CTL_TAPWML:1;
      uint64_t reservedSpace0:1;
      uint64_t TIMER_CTL_TBEN:1;
      uint64_t TIMER_CTL_TBSTALL:1;
      uint64_t TIMER_CTL_TBEVENT:2;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_CTL_TBOTE:1;
      uint64_t TIMER_CTL_TBPWML:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_SYNC_SYNCT0:2;
      uint64_t TIMER_SYNC_SYNCT1:2;
      uint64_t TIMER_SYNC_SYNCT2:2;
      uint64_t TIMER_SYNC_SYNCT3:2;
      uint64_t TIMER_SYNC_SYNCT4:2;
      uint64_t TIMER_SYNC_SYNCT5:2;
      uint64_t TIMER_SYNC_SYNCT6:2;
      uint64_t TIMER_SYNC_SYNCT7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0SYNC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_IMR_TATOIM:1;
      uint64_t TIMER_IMR_CAMIM:1;
      uint64_t TIMER_IMR_CAEIM:1;
      uint64_t TIMER_IMR_RTCIM:1;
      uint64_t TIMER_IMR_TAMIM:1;
      uint64_t TIMER_IMR_DMAAIM:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_IMR_TBTOIM:1;
      uint64_t TIMER_IMR_CBMIM:1;
      uint64_t TIMER_IMR_CBEIM:1;
      uint64_t TIMER_IMR_TBMIM:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_IMR_DMABIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_RIS_TATORIS:1;
      uint64_t TIMER_RIS_CAMRIS:1;
      uint64_t TIMER_RIS_CAERIS:1;
      uint64_t TIMER_RIS_RTCRIS:1;
      uint64_t TIMER_RIS_TAMRIS:1;
      uint64_t TIMER_RIS_DMAARIS:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_RIS_TBTORIS:1;
      uint64_t TIMER_RIS_CBMRIS:1;
      uint64_t TIMER_RIS_CBERIS:1;
      uint64_t TIMER_RIS_TBMRIS:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_RIS_DMABRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_MIS_TATOMIS:1;
      uint64_t TIMER_MIS_CAMMIS:1;
      uint64_t TIMER_MIS_CAEMIS:1;
      uint64_t TIMER_MIS_RTCMIS:1;
      uint64_t TIMER_MIS_TAMMIS:1;
      uint64_t TIMER_MIS_DMAAMIS:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_MIS_TBTOMIS:1;
      uint64_t TIMER_MIS_CBMMIS:1;
      uint64_t TIMER_MIS_CBEMIS:1;
      uint64_t TIMER_MIS_TBMMIS:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_MIS_DMABMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_ICR_TATOCINT:1;
      uint64_t TIMER_ICR_CAMCINT:1;
      uint64_t TIMER_ICR_CAECINT:1;
      uint64_t TIMER_ICR_RTCCINT:1;
      uint64_t TIMER_ICR_TAMCINT:1;
      uint64_t TIMER_ICR_DMAAINT:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_ICR_TBTOCINT:1;
      uint64_t TIMER_ICR_CBMCINT:1;
      uint64_t TIMER_ICR_CBECINT:1;
      uint64_t TIMER_ICR_TBMCINT:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_ICR_DMABINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0ICR;

  uint32_t TIMER0TAILR;
  uint32_t TIMER0TBILR;
  uint32_t TIMER0TAMATCHR;
  uint32_t TIMER0TBMATCHR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAPR_TAPSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBPR_TBPSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAPMR_TAPSMR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBPMR_TBPSMR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBPMR;

  uint32_t TIMER0TAR;
  uint32_t TIMER0TBR;
  uint32_t TIMER0TAV;
  uint32_t TIMER0TBV;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_RTCPD_RTCPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0RTCPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAPS_PSS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBPS_PSS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBPS;

  uint32_t TIMER0TAPV;
  uint32_t TIMER0TBPV;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_DMAEV_TATODMAEN:1;
      uint64_t TIMER_DMAEV_CAMDMAEN:1;
      uint64_t TIMER_DMAEV_CAEDMAEN:1;
      uint64_t TIMER_DMAEV_RTCDMAEN:1;
      uint64_t TIMER_DMAEV_TAMDMAEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TIMER_DMAEV_TBTODMAEN:1;
      uint64_t TIMER_DMAEV_CBMDMAEN:1;
      uint64_t TIMER_DMAEV_CBEDMAEN:1;
      uint64_t TIMER_DMAEV_TBMDMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0DMAEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_ADCEV_TATOADCEN:1;
      uint64_t TIMER_ADCEV_CAMADCEN:1;
      uint64_t TIMER_ADCEV_CAEADCEN:1;
      uint64_t TIMER_ADCEV_RTCADCEN:1;
      uint64_t TIMER_ADCEV_TAMADCEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TIMER_ADCEV_TBTOADCEN:1;
      uint64_t TIMER_ADCEV_CBMADCEN:1;
      uint64_t TIMER_ADCEV_CBEADCEN:1;
      uint64_t TIMER_ADCEV_TBMADCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0ADCEV;

