iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res3[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL0_CIM:2;
      uint64_t ADC_DCCTL0_CIC:2;
      uint64_t ADC_DCCTL0_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL0_CTM:2;
      uint64_t ADC_DCCTL0_CTC:2;
      uint64_t ADC_DCCTL0_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL1_CIM:2;
      uint64_t ADC_DCCTL1_CIC:2;
      uint64_t ADC_DCCTL1_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL1_CTM:2;
      uint64_t ADC_DCCTL1_CTC:2;
      uint64_t ADC_DCCTL1_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL2_CIM:2;
      uint64_t ADC_DCCTL2_CIC:2;
      uint64_t ADC_DCCTL2_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL2_CTM:2;
      uint64_t ADC_DCCTL2_CTC:2;
      uint64_t ADC_DCCTL2_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL3_CIM:2;
      uint64_t ADC_DCCTL3_CIC:2;
      uint64_t ADC_DCCTL3_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL3_CTM:2;
      uint64_t ADC_DCCTL3_CTC:2;
      uint64_t ADC_DCCTL3_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL4_CIM:2;
      uint64_t ADC_DCCTL4_CIC:2;
      uint64_t ADC_DCCTL4_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL4_CTM:2;
      uint64_t ADC_DCCTL4_CTC:2;
      uint64_t ADC_DCCTL4_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL5_CIM:2;
      uint64_t ADC_DCCTL5_CIC:2;
      uint64_t ADC_DCCTL5_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL5_CTM:2;
      uint64_t ADC_DCCTL5_CTC:2;
      uint64_t ADC_DCCTL5_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL6_CIM:2;
      uint64_t ADC_DCCTL6_CIC:2;
      uint64_t ADC_DCCTL6_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL6_CTM:2;
      uint64_t ADC_DCCTL6_CTC:2;
      uint64_t ADC_DCCTL6_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL7_CIM:2;
      uint64_t ADC_DCCTL7_CIC:2;
      uint64_t ADC_DCCTL7_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL7_CTM:2;
      uint64_t ADC_DCCTL7_CTC:2;
      uint64_t ADC_DCCTL7_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL7;

  uint8_t res4[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP0_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP0_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP1_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP1_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP2_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP2_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP3_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP3_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP4_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP4_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP5_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP5_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP6_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP6_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP7_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP7_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP7;

  uint8_t res5[352];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_PP_MCR:4;
      uint64_t ADC_PP_CH:6;
      uint64_t ADC_PP_DC:6;
      uint64_t ADC_PP_TYPE:2;
      uint64_t ADC_PP_RSL:5;
      uint64_t ADC_PP_TS:1;
      uint64_t ADC_PP_APSHT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0PP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_PC_MCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CC_CS:4;
      uint64_t ADC_CC_CLKDIV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0CC;

};

#define ADC0_2 (*(volatile struct ADC0_2_tag *) 0x40038000)

struct ADC1_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_ACTSS_ASEN0:1;
      uint64_t ADC_ACTSS_ASEN1:1;
      uint64_t ADC_ACTSS_ASEN2:1;
      uint64_t ADC_ACTSS_ASEN3:1;
      uint64_t reservedSpace0:4;
      uint64_t ADC_ACTSS_ADEN0:1;
      uint64_t ADC_ACTSS_ADEN1:1;
      uint64_t ADC_ACTSS_ADEN2:1;
      uint64_t ADC_ACTSS_ADEN3:1;
      uint64_t reservedSpace1:4;
      uint64_t ADC_ACTSS_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0ACTSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_RIS_INR0:1;
      uint64_t ADC_RIS_INR1:1;
      uint64_t ADC_RIS_INR2:1;
      uint64_t ADC_RIS_INR3:1;
      uint64_t reservedSpace0:4;
      uint64_t ADC_RIS_DMAINR0:1;
      uint64_t ADC_RIS_DMAINR1:1;
      uint64_t ADC_RIS_DMAINR2:1;
      uint64_t ADC_RIS_DMAINR3:1;
      uint64_t reservedSpace1:4;
      uint64_t ADC_RIS_INRDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_IM_MASK0:1;
      uint64_t ADC_IM_MASK1:1;
      uint64_t ADC_IM_MASK2:1;
      uint64_t ADC_IM_MASK3:1;
      uint64_t reservedSpace0:4;
      uint64_t ADC_IM_DMAMASK0:1;
      uint64_t ADC_IM_DMAMASK1:1;
      uint64_t ADC_IM_DMAMASK2:1;
      uint64_t ADC_IM_DMAMASK3:1;
      uint64_t reservedSpace1:4;
      uint64_t ADC_IM_DCONSS0:1;
      uint64_t ADC_IM_DCONSS1:1;
      uint64_t ADC_IM_DCONSS2:1;
      uint64_t ADC_IM_DCONSS3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0IM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_ISC_IN0:1;
      uint64_t ADC_ISC_IN1:1;
      uint64_t ADC_ISC_IN2:1;
      uint64_t ADC_ISC_IN3:1;
      uint64_t reservedSpace0:4;
      uint64_t ADC_ISC_DMAIN0:1;
      uint64_t ADC_ISC_DMAIN1:1;
      uint64_t ADC_ISC_DMAIN2:1;
      uint64_t ADC_ISC_DMAIN3:1;
      uint64_t reservedSpace1:4;
      uint64_t ADC_ISC_DCINSS0:1;
      uint64_t ADC_ISC_DCINSS1:1;
      uint64_t ADC_ISC_DCINSS2:1;
      uint64_t ADC_ISC_DCINSS3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0ISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_OSTAT_OV0:1;
      uint64_t ADC_OSTAT_OV1:1;
      uint64_t ADC_OSTAT_OV2:1;
      uint64_t ADC_OSTAT_OV3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0OSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_EMUX_EM0:4;
      uint64_t ADC_EMUX_EM1:4;
      uint64_t ADC_EMUX_EM2:4;
      uint64_t ADC_EMUX_EM3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0EMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_USTAT_UV0:1;
      uint64_t ADC_USTAT_UV1:1;
      uint64_t ADC_USTAT_UV2:1;
      uint64_t ADC_USTAT_UV3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0USTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ADC_TSSEL_PS0:2;
      uint64_t reservedSpace1:6;
      uint64_t ADC_TSSEL_PS1:2;
      uint64_t reservedSpace2:6;
      uint64_t ADC_TSSEL_PS2:2;
      uint64_t reservedSpace3:6;
      uint64_t ADC_TSSEL_PS3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0TSSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSPRI_SS0:2;
      uint64_t reservedSpace0:2;
      uint64_t ADC_SSPRI_SS1:2;
      uint64_t reservedSpace1:2;
      uint64_t ADC_SSPRI_SS2:2;
      uint64_t reservedSpace2:2;
      uint64_t ADC_SSPRI_SS3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSPRI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SPC_PHASE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SPC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_PSSI_SS0:1;
      uint64_t ADC_PSSI_SS1:1;
      uint64_t ADC_PSSI_SS2:1;
      uint64_t ADC_PSSI_SS3:1;
      uint64_t reservedSpace0:23;
      uint64_t ADC_PSSI_SYNCWAIT:1;
      uint64_t reservedSpace1:3;
      uint64_t ADC_PSSI_GSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0PSSI;

