iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SAC_AVG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCISC_DCINT0:1;
      uint64_t ADC_DCISC_DCINT1:1;
      uint64_t ADC_DCISC_DCINT2:1;
      uint64_t ADC_DCISC_DCINT3:1;
      uint64_t ADC_DCISC_DCINT4:1;
      uint64_t ADC_DCISC_DCINT5:1;
      uint64_t ADC_DCISC_DCINT6:1;
      uint64_t ADC_DCISC_DCINT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CTL_VREF:1;
      uint64_t reservedSpace0:5;
      uint64_t ADC_CTL_DITHER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0CTL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSMUX0_MUX0:4;
      uint64_t ADC_SSMUX0_MUX1:4;
      uint64_t ADC_SSMUX0_MUX2:4;
      uint64_t ADC_SSMUX0_MUX3:4;
      uint64_t ADC_SSMUX0_MUX4:4;
      uint64_t ADC_SSMUX0_MUX5:4;
      uint64_t ADC_SSMUX0_MUX6:4;
      uint64_t ADC_SSMUX0_MUX7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSMUX0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSCTL0_D0:1;
      uint64_t ADC_SSCTL0_END0:1;
      uint64_t ADC_SSCTL0_IE0:1;
      uint64_t ADC_SSCTL0_TS0:1;
      uint64_t ADC_SSCTL0_D1:1;
      uint64_t ADC_SSCTL0_END1:1;
      uint64_t ADC_SSCTL0_IE1:1;
      uint64_t ADC_SSCTL0_TS1:1;
      uint64_t ADC_SSCTL0_D2:1;
      uint64_t ADC_SSCTL0_END2:1;
      uint64_t ADC_SSCTL0_IE2:1;
      uint64_t ADC_SSCTL0_TS2:1;
      uint64_t ADC_SSCTL0_D3:1;
      uint64_t ADC_SSCTL0_END3:1;
      uint64_t ADC_SSCTL0_IE3:1;
      uint64_t ADC_SSCTL0_TS3:1;
      uint64_t ADC_SSCTL0_D4:1;
      uint64_t ADC_SSCTL0_END4:1;
      uint64_t ADC_SSCTL0_IE4:1;
      uint64_t ADC_SSCTL0_TS4:1;
      uint64_t ADC_SSCTL0_D5:1;
      uint64_t ADC_SSCTL0_END5:1;
      uint64_t ADC_SSCTL0_IE5:1;
      uint64_t ADC_SSCTL0_TS5:1;
      uint64_t ADC_SSCTL0_D6:1;
      uint64_t ADC_SSCTL0_END6:1;
      uint64_t ADC_SSCTL0_IE6:1;
      uint64_t ADC_SSCTL0_TS6:1;
      uint64_t ADC_SSCTL0_D7:1;
      uint64_t ADC_SSCTL0_END7:1;
      uint64_t ADC_SSCTL0_IE7:1;
      uint64_t ADC_SSCTL0_TS7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFIFO0_DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFIFO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFSTAT0_TPTR:4;
      uint64_t ADC_SSFSTAT0_HPTR:4;
      uint64_t ADC_SSFSTAT0_EMPTY:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSFSTAT0_FULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSOP0_S0DCOP:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSOP0_S1DCOP:1;
      uint64_t reservedSpace1:3;
      uint64_t ADC_SSOP0_S2DCOP:1;
      uint64_t reservedSpace2:3;
      uint64_t ADC_SSOP0_S3DCOP:1;
      uint64_t reservedSpace3:3;
      uint64_t ADC_SSOP0_S4DCOP:1;
      uint64_t reservedSpace4:3;
      uint64_t ADC_SSOP0_S5DCOP:1;
      uint64_t reservedSpace5:3;
      uint64_t ADC_SSOP0_S6DCOP:1;
      uint64_t reservedSpace6:3;
      uint64_t ADC_SSOP0_S7DCOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSOP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSDC0_S0DCSEL:4;
      uint64_t ADC_SSDC0_S1DCSEL:4;
      uint64_t ADC_SSDC0_S2DCSEL:4;
      uint64_t ADC_SSDC0_S3DCSEL:4;
      uint64_t ADC_SSDC0_S4DCSEL:4;
      uint64_t ADC_SSDC0_S5DCSEL:4;
      uint64_t ADC_SSDC0_S6DCSEL:4;
      uint64_t ADC_SSDC0_S7DCSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSDC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSEMUX0_EMUX0:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSEMUX0_EMUX1:1;
      uint64_t reservedSpace1:3;
      uint64_t ADC_SSEMUX0_EMUX2:1;
      uint64_t reservedSpace2:3;
      uint64_t ADC_SSEMUX0_EMUX3:1;
      uint64_t reservedSpace3:3;
      uint64_t ADC_SSEMUX0_EMUX4:1;
      uint64_t reservedSpace4:3;
      uint64_t ADC_SSEMUX0_EMUX5:1;
      uint64_t reservedSpace5:3;
      uint64_t ADC_SSEMUX0_EMUX6:1;
      uint64_t reservedSpace6:3;
      uint64_t ADC_SSEMUX0_EMUX7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSEMUX0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSTSH0_TSH0:4;
      uint64_t ADC_SSTSH0_TSH1:4;
      uint64_t ADC_SSTSH0_TSH2:4;
      uint64_t ADC_SSTSH0_TSH3:4;
      uint64_t ADC_SSTSH0_TSH4:4;
      uint64_t ADC_SSTSH0_TSH5:4;
      uint64_t ADC_SSTSH0_TSH6:4;
      uint64_t ADC_SSTSH0_TSH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSTSH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSMUX1_MUX0:4;
      uint64_t ADC_SSMUX1_MUX1:4;
      uint64_t ADC_SSMUX1_MUX2:4;
      uint64_t ADC_SSMUX1_MUX3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSMUX1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSCTL1_D0:1;
      uint64_t ADC_SSCTL1_END0:1;
      uint64_t ADC_SSCTL1_IE0:1;
      uint64_t ADC_SSCTL1_TS0:1;
      uint64_t ADC_SSCTL1_D1:1;
      uint64_t ADC_SSCTL1_END1:1;
      uint64_t ADC_SSCTL1_IE1:1;
      uint64_t ADC_SSCTL1_TS1:1;
      uint64_t ADC_SSCTL1_D2:1;
      uint64_t ADC_SSCTL1_END2:1;
      uint64_t ADC_SSCTL1_IE2:1;
      uint64_t ADC_SSCTL1_TS2:1;
      uint64_t ADC_SSCTL1_D3:1;
      uint64_t ADC_SSCTL1_END3:1;
      uint64_t ADC_SSCTL1_IE3:1;
      uint64_t ADC_SSCTL1_TS3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFIFO1_DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFIFO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFSTAT1_TPTR:4;
      uint64_t ADC_SSFSTAT1_HPTR:4;
      uint64_t ADC_SSFSTAT1_EMPTY:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSFSTAT1_FULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFSTAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSOP1_S0DCOP:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSOP1_S1DCOP:1;
      uint64_t reservedSpace1:3;
      uint64_t ADC_SSOP1_S2DCOP:1;
      uint64_t reservedSpace2:3;
      uint64_t ADC_SSOP1_S3DCOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSOP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSDC1_S0DCSEL:4;
      uint64_t ADC_SSDC1_S1DCSEL:4;
      uint64_t ADC_SSDC1_S2DCSEL:4;
      uint64_t ADC_SSDC1_S3DCSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSDC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSEMUX1_EMUX0:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSEMUX1_EMUX1:1;
      uint64_t reservedSpace1:3;
      uint64_t ADC_SSEMUX1_EMUX2:1;
      uint64_t reservedSpace2:3;
      uint64_t ADC_SSEMUX1_EMUX3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSEMUX1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSTSH1_TSH0:4;
      uint64_t ADC_SSTSH1_TSH1:4;
      uint64_t ADC_SSTSH1_TSH2:4;
      uint64_t ADC_SSTSH1_TSH3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSTSH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSMUX2_MUX0:4;
      uint64_t ADC_SSMUX2_MUX1:4;
      uint64_t ADC_SSMUX2_MUX2:4;
      uint64_t ADC_SSMUX2_MUX3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSMUX2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSCTL2_D0:1;
      uint64_t ADC_SSCTL2_END0:1;
      uint64_t ADC_SSCTL2_IE0:1;
      uint64_t ADC_SSCTL2_TS0:1;
      uint64_t ADC_SSCTL2_D1:1;
      uint64_t ADC_SSCTL2_END1:1;
      uint64_t ADC_SSCTL2_IE1:1;
      uint64_t ADC_SSCTL2_TS1:1;
      uint64_t ADC_SSCTL2_D2:1;
      uint64_t ADC_SSCTL2_END2:1;
      uint64_t ADC_SSCTL2_IE2:1;
      uint64_t ADC_SSCTL2_TS2:1;
      uint64_t ADC_SSCTL2_D3:1;
      uint64_t ADC_SSCTL2_END3:1;
      uint64_t ADC_SSCTL2_IE3:1;
      uint64_t ADC_SSCTL2_TS3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFIFO2_DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFIFO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFSTAT2_TPTR:4;
      uint64_t ADC_SSFSTAT2_HPTR:4;
      uint64_t ADC_SSFSTAT2_EMPTY:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSFSTAT2_FULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFSTAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSOP2_S0DCOP:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSOP2_S1DCOP:1;
      uint64_t reservedSpace1:3;
      uint64_t ADC_SSOP2_S2DCOP:1;
      uint64_t reservedSpace2:3;
      uint64_t ADC_SSOP2_S3DCOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSOP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSDC2_S0DCSEL:4;
      uint64_t ADC_SSDC2_S1DCSEL:4;
      uint64_t ADC_SSDC2_S2DCSEL:4;
      uint64_t ADC_SSDC2_S3DCSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSDC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSEMUX2_EMUX0:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSEMUX2_EMUX1:1;
      uint64_t reservedSpace1:3;
      uint64_t ADC_SSEMUX2_EMUX2:1;
      uint64_t reservedSpace2:3;
      uint64_t ADC_SSEMUX2_EMUX3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSEMUX2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSTSH2_TSH0:4;
      uint64_t ADC_SSTSH2_TSH1:4;
      uint64_t ADC_SSTSH2_TSH2:4;
      uint64_t ADC_SSTSH2_TSH3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSTSH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSMUX3_MUX0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSMUX3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSCTL3_D0:1;
      uint64_t ADC_SSCTL3_END0:1;
      uint64_t ADC_SSCTL3_IE0:1;
      uint64_t ADC_SSCTL3_TS0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSCTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFIFO3_DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFIFO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSFSTAT3_TPTR:4;
      uint64_t ADC_SSFSTAT3_HPTR:4;
      uint64_t ADC_SSFSTAT3_EMPTY:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_SSFSTAT3_FULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSFSTAT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSOP3_S0DCOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSOP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSDC3_S0DCSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSDC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSEMUX3_EMUX0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSEMUX3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_SSTSH3_TSH0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0SSTSH3;

  uint8_t res2[3136];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCRIC_DCINT0:1;
      uint64_t ADC_DCRIC_DCINT1:1;
      uint64_t ADC_DCRIC_DCINT2:1;
      uint64_t ADC_DCRIC_DCINT3:1;
      uint64_t ADC_DCRIC_DCINT4:1;
      uint64_t ADC_DCRIC_DCINT5:1;
      uint64_t ADC_DCRIC_DCINT6:1;
      uint64_t ADC_DCRIC_DCINT7:1;
      uint64_t reservedSpace0:8;
      uint64_t ADC_DCRIC_DCTRIG0:1;
      uint64_t ADC_DCRIC_DCTRIG1:1;
      uint64_t ADC_DCRIC_DCTRIG2:1;
      uint64_t ADC_DCRIC_DCTRIG3:1;
      uint64_t ADC_DCRIC_DCTRIG4:1;
      uint64_t ADC_DCRIC_DCTRIG5:1;
      uint64_t ADC_DCRIC_DCTRIG6:1;
      uint64_t ADC_DCRIC_DCTRIG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCRIC;

