iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res3[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL0_CIM:2;
      uint64_t ADC_DCCTL0_CIC:2;
      uint64_t ADC_DCCTL0_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL0_CTM:2;
      uint64_t ADC_DCCTL0_CTC:2;
      uint64_t ADC_DCCTL0_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL1_CIM:2;
      uint64_t ADC_DCCTL1_CIC:2;
      uint64_t ADC_DCCTL1_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL1_CTM:2;
      uint64_t ADC_DCCTL1_CTC:2;
      uint64_t ADC_DCCTL1_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL2_CIM:2;
      uint64_t ADC_DCCTL2_CIC:2;
      uint64_t ADC_DCCTL2_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL2_CTM:2;
      uint64_t ADC_DCCTL2_CTC:2;
      uint64_t ADC_DCCTL2_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL3_CIM:2;
      uint64_t ADC_DCCTL3_CIC:2;
      uint64_t ADC_DCCTL3_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL3_CTM:2;
      uint64_t ADC_DCCTL3_CTC:2;
      uint64_t ADC_DCCTL3_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL4_CIM:2;
      uint64_t ADC_DCCTL4_CIC:2;
      uint64_t ADC_DCCTL4_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL4_CTM:2;
      uint64_t ADC_DCCTL4_CTC:2;
      uint64_t ADC_DCCTL4_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL5_CIM:2;
      uint64_t ADC_DCCTL5_CIC:2;
      uint64_t ADC_DCCTL5_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL5_CTM:2;
      uint64_t ADC_DCCTL5_CTC:2;
      uint64_t ADC_DCCTL5_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL6_CIM:2;
      uint64_t ADC_DCCTL6_CIC:2;
      uint64_t ADC_DCCTL6_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL6_CTM:2;
      uint64_t ADC_DCCTL6_CTC:2;
      uint64_t ADC_DCCTL6_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCTL7_CIM:2;
      uint64_t ADC_DCCTL7_CIC:2;
      uint64_t ADC_DCCTL7_CIE:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC_DCCTL7_CTM:2;
      uint64_t ADC_DCCTL7_CTC:2;
      uint64_t ADC_DCCTL7_CTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCTL7;

  uint8_t res4[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP0_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP0_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP1_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP1_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP2_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP2_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP3_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP3_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP4_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP4_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP5_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP5_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP6_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP6_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DCCMP7_COMP0:12;
      uint64_t reservedSpace0:4;
      uint64_t ADC_DCCMP7_COMP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DCCMP7;

  uint8_t res5[352];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_PP_MCR:4;
      uint64_t ADC_PP_CH:6;
      uint64_t ADC_PP_DC:6;
      uint64_t ADC_PP_TYPE:2;
      uint64_t ADC_PP_RSL:5;
      uint64_t ADC_PP_TS:1;
      uint64_t ADC_PP_APSHT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0PP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_PC_MCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CC_CS:4;
      uint64_t ADC_CC_CLKDIV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0CC;

};

#define ADC1_2 (*(volatile struct ADC1_2_tag *) 0x40039000)

struct COMP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP_ACMIS_IN0:1;
      uint64_t COMP_ACMIS_IN1:1;
      uint64_t COMP_ACMIS_IN2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPACMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP_ACRIS_IN0:1;
      uint64_t COMP_ACRIS_IN1:1;
      uint64_t COMP_ACRIS_IN2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPACRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP_ACINTEN_IN0:1;
      uint64_t COMP_ACINTEN_IN1:1;
      uint64_t COMP_ACINTEN_IN2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPACINTEN;

