iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res1[2676];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_PP_EDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAPP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_PC_EDM0:2;
      uint64_t GPIO_PC_EDM1:2;
      uint64_t GPIO_PC_EDM2:2;
      uint64_t GPIO_PC_EDM3:2;
      uint64_t GPIO_PC_EDM4:2;
      uint64_t GPIO_PC_EDM5:2;
      uint64_t GPIO_PC_EDM6:2;
      uint64_t GPIO_PC_EDM7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAPC;

};

#define GPIOL (*(volatile struct GPIOL_tag *) 0x400623fc)

struct GPIOM_tag
{
  uint32_t GPIOADATA;
  uint32_t GPIOADIR;
  uint32_t GPIOAIS;
  uint32_t GPIOAIBE;
  uint32_t GPIOAIEV;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_IM_GPIO:8;
      uint64_t GPIO_IM_DMAIME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_RIS_GPIO:8;
      uint64_t GPIO_RIS_DMARIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOARIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_MIS_GPIO:8;
      uint64_t GPIO_MIS_DMAMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_ICR_GPIO:8;
      uint64_t GPIO_ICR_DMAIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAICR;

  uint32_t GPIOAAFSEL;
  uint8_t res0[220];

  uint32_t GPIOADR2R;
  uint32_t GPIOADR4R;
  uint32_t GPIOADR8R;
  uint32_t GPIOAODR;
  uint32_t GPIOAPUR;
  uint32_t GPIOAPDR;
  uint32_t GPIOASLR;
  uint32_t GPIOADEN;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_LOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOALOCK;

  uint32_t GPIOACR;
  uint32_t GPIOAAMSEL;
  uint32_t GPIOAPCTL;
  uint32_t GPIOAADCCTL;
  uint32_t GPIOADMACTL;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_SI_SUM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOASI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_DR12R_DRV12:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOADR12R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t GPIO_WAKEPEN_WAKEP4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAWAKEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t GPIO_WAKELVL_WAKELVL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAWAKELVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t GPIO_WAKESTAT_STAT4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAWAKESTAT;

  uint8_t res1[2676];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_PP_EDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAPP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_PC_EDM0:2;
      uint64_t GPIO_PC_EDM1:2;
      uint64_t GPIO_PC_EDM2:2;
      uint64_t GPIO_PC_EDM3:2;
      uint64_t GPIO_PC_EDM4:2;
      uint64_t GPIO_PC_EDM5:2;
      uint64_t GPIO_PC_EDM6:2;
      uint64_t GPIO_PC_EDM7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAPC;

};

#define GPIOM (*(volatile struct GPIOM_tag *) 0x400633fc)

struct GPION_tag
{
  uint32_t GPIOADATA;
  uint32_t GPIOADIR;
  uint32_t GPIOAIS;
  uint32_t GPIOAIBE;
  uint32_t GPIOAIEV;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_IM_GPIO:8;
      uint64_t GPIO_IM_DMAIME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_RIS_GPIO:8;
      uint64_t GPIO_RIS_DMARIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOARIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_MIS_GPIO:8;
      uint64_t GPIO_MIS_DMAMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_ICR_GPIO:8;
      uint64_t GPIO_ICR_DMAIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAICR;

  uint32_t GPIOAAFSEL;
  uint8_t res0[220];

  uint32_t GPIOADR2R;
  uint32_t GPIOADR4R;
  uint32_t GPIOADR8R;
  uint32_t GPIOAODR;
  uint32_t GPIOAPUR;
  uint32_t GPIOAPDR;
  uint32_t GPIOASLR;
  uint32_t GPIOADEN;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_LOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOALOCK;

  uint32_t GPIOACR;
  uint32_t GPIOAAMSEL;
  uint32_t GPIOAPCTL;
  uint32_t GPIOAADCCTL;
  uint32_t GPIOADMACTL;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_SI_SUM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOASI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_DR12R_DRV12:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOADR12R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t GPIO_WAKEPEN_WAKEP4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAWAKEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t GPIO_WAKELVL_WAKELVL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAWAKELVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t GPIO_WAKESTAT_STAT4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAWAKESTAT;

  uint8_t res1[2676];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_PP_EDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAPP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_PC_EDM0:2;
      uint64_t GPIO_PC_EDM1:2;
      uint64_t GPIO_PC_EDM2:2;
      uint64_t GPIO_PC_EDM3:2;
      uint64_t GPIO_PC_EDM4:2;
      uint64_t GPIO_PC_EDM5:2;
      uint64_t GPIO_PC_EDM6:2;
      uint64_t GPIO_PC_EDM7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOAPC;

