iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EERDWR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEERDWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EERDWRINC_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEERDWRINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEDONE_WORKING:1;
      uint64_t reservedSpace0:1;
      uint64_t EEPROM_EEDONE_WKERASE:1;
      uint64_t EEPROM_EEDONE_WKCOPY:1;
      uint64_t EEPROM_EEDONE_NOPERM:1;
      uint64_t EEPROM_EEDONE_WRBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEDONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EEPROM_EESUPP_ERETRY:1;
      uint64_t EEPROM_EESUPP_PRETRY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEESUPP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEUNLOCK_UNLOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEUNLOCK;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEPROT_PROT:3;
      uint64_t EEPROM_EEPROT_ACC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEPASS0_PASS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEPASS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEPASS1_PASS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEPASS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEPASS2_PASS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEPASS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEINT_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEINT;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EEPROM_EEHIDE0_HN:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEHIDE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEHIDE1_HN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEHIDE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEHIDE2_HN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEHIDE2;

  uint8_t res3[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_EEDBGME_ME:1;
      uint64_t reservedSpace0:15;
      uint64_t EEPROM_EEDBGME_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMEEDBGME;

  uint8_t res4[3900];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEPROM_PP_SIZE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROMPP;

};

#define EEPROM_2 (*(volatile struct EEPROM_2_tag *) 0x400af000)

struct TIMER6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAMR_TAMR:2;
      uint64_t TIMER_TAMR_TACMR:1;
      uint64_t TIMER_TAMR_TAAMS:1;
      uint64_t TIMER_TAMR_TACDIR:1;
      uint64_t TIMER_TAMR_TAMIE:1;
      uint64_t TIMER_TAMR_TAWOT:1;
      uint64_t TIMER_TAMR_TASNAPS:1;
      uint64_t TIMER_TAMR_TAILD:1;
      uint64_t TIMER_TAMR_TAPWMIE:1;
      uint64_t TIMER_TAMR_TAMRSU:1;
      uint64_t TIMER_TAMR_TAPLO:1;
      uint64_t TIMER_TAMR_TACINTD:1;
      uint64_t TIMER_TAMR_TCACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBMR_TBMR:2;
      uint64_t TIMER_TBMR_TBCMR:1;
      uint64_t TIMER_TBMR_TBAMS:1;
      uint64_t TIMER_TBMR_TBCDIR:1;
      uint64_t TIMER_TBMR_TBMIE:1;
      uint64_t TIMER_TBMR_TBWOT:1;
      uint64_t TIMER_TBMR_TBSNAPS:1;
      uint64_t TIMER_TBMR_TBILD:1;
      uint64_t TIMER_TBMR_TBPWMIE:1;
      uint64_t TIMER_TBMR_TBMRSU:1;
      uint64_t TIMER_TBMR_TBPLO:1;
      uint64_t TIMER_TBMR_TBCINTD:1;
      uint64_t TIMER_TBMR_TCACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_CTL_TAEN:1;
      uint64_t TIMER_CTL_TASTALL:1;
      uint64_t TIMER_CTL_TAEVENT:2;
      uint64_t TIMER_CTL_RTCEN:1;
      uint64_t TIMER_CTL_TAOTE:1;
      uint64_t TIMER_CTL_TAPWML:1;
      uint64_t reservedSpace0:1;
      uint64_t TIMER_CTL_TBEN:1;
      uint64_t TIMER_CTL_TBSTALL:1;
      uint64_t TIMER_CTL_TBEVENT:2;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_CTL_TBOTE:1;
      uint64_t TIMER_CTL_TBPWML:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_SYNC_SYNCT0:2;
      uint64_t TIMER_SYNC_SYNCT1:2;
      uint64_t TIMER_SYNC_SYNCT2:2;
      uint64_t TIMER_SYNC_SYNCT3:2;
      uint64_t TIMER_SYNC_SYNCT4:2;
      uint64_t TIMER_SYNC_SYNCT5:2;
      uint64_t TIMER_SYNC_SYNCT6:2;
      uint64_t TIMER_SYNC_SYNCT7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0SYNC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_IMR_TATOIM:1;
      uint64_t TIMER_IMR_CAMIM:1;
      uint64_t TIMER_IMR_CAEIM:1;
      uint64_t TIMER_IMR_RTCIM:1;
      uint64_t TIMER_IMR_TAMIM:1;
      uint64_t TIMER_IMR_DMAAIM:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_IMR_TBTOIM:1;
      uint64_t TIMER_IMR_CBMIM:1;
      uint64_t TIMER_IMR_CBEIM:1;
      uint64_t TIMER_IMR_TBMIM:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_IMR_DMABIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_RIS_TATORIS:1;
      uint64_t TIMER_RIS_CAMRIS:1;
      uint64_t TIMER_RIS_CAERIS:1;
      uint64_t TIMER_RIS_RTCRIS:1;
      uint64_t TIMER_RIS_TAMRIS:1;
      uint64_t TIMER_RIS_DMAARIS:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_RIS_TBTORIS:1;
      uint64_t TIMER_RIS_CBMRIS:1;
      uint64_t TIMER_RIS_CBERIS:1;
      uint64_t TIMER_RIS_TBMRIS:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_RIS_DMABRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_MIS_TATOMIS:1;
      uint64_t TIMER_MIS_CAMMIS:1;
      uint64_t TIMER_MIS_CAEMIS:1;
      uint64_t TIMER_MIS_RTCMIS:1;
      uint64_t TIMER_MIS_TAMMIS:1;
      uint64_t TIMER_MIS_DMAAMIS:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_MIS_TBTOMIS:1;
      uint64_t TIMER_MIS_CBMMIS:1;
      uint64_t TIMER_MIS_CBEMIS:1;
      uint64_t TIMER_MIS_TBMMIS:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_MIS_DMABMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_ICR_TATOCINT:1;
      uint64_t TIMER_ICR_CAMCINT:1;
      uint64_t TIMER_ICR_CAECINT:1;
      uint64_t TIMER_ICR_RTCCINT:1;
      uint64_t TIMER_ICR_TAMCINT:1;
      uint64_t TIMER_ICR_DMAAINT:1;
      uint64_t reservedSpace0:2;
      uint64_t TIMER_ICR_TBTOCINT:1;
      uint64_t TIMER_ICR_CBMCINT:1;
      uint64_t TIMER_ICR_CBECINT:1;
      uint64_t TIMER_ICR_TBMCINT:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMER_ICR_DMABINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0ICR;

