iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint32_t TIMER0TAILR;
  uint32_t TIMER0TBILR;
  uint32_t TIMER0TAMATCHR;
  uint32_t TIMER0TBMATCHR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAPR_TAPSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBPR_TBPSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAPMR_TAPSMR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBPMR_TBPSMR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBPMR;

  uint32_t TIMER0TAR;
  uint32_t TIMER0TBR;
  uint32_t TIMER0TAV;
  uint32_t TIMER0TBV;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_RTCPD_RTCPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0RTCPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TAPS_PSS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TAPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_TBPS_PSS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0TBPS;

  uint32_t TIMER0TAPV;
  uint32_t TIMER0TBPV;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_DMAEV_TATODMAEN:1;
      uint64_t TIMER_DMAEV_CAMDMAEN:1;
      uint64_t TIMER_DMAEV_CAEDMAEN:1;
      uint64_t TIMER_DMAEV_RTCDMAEN:1;
      uint64_t TIMER_DMAEV_TAMDMAEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TIMER_DMAEV_TBTODMAEN:1;
      uint64_t TIMER_DMAEV_CBMDMAEN:1;
      uint64_t TIMER_DMAEV_CBEDMAEN:1;
      uint64_t TIMER_DMAEV_TBMDMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0DMAEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_ADCEV_TATOADCEN:1;
      uint64_t TIMER_ADCEV_CAMADCEN:1;
      uint64_t TIMER_ADCEV_CAEADCEN:1;
      uint64_t TIMER_ADCEV_RTCADCEN:1;
      uint64_t TIMER_ADCEV_TAMADCEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TIMER_ADCEV_TBTOADCEN:1;
      uint64_t TIMER_ADCEV_CBMADCEN:1;
      uint64_t TIMER_ADCEV_CBEADCEN:1;
      uint64_t TIMER_ADCEV_TBMADCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0ADCEV;

  uint8_t res1[3916];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER_PP_SIZE:4;
      uint64_t TIMER_PP_CHAIN:1;
      uint64_t TIMER_PP_SYNCCNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER0PP;

};

#define TIMER7 (*(volatile struct TIMER7_tag *) 0x400e1000)

struct EMAC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_CFG_PRELEN:2;
      uint64_t EMAC_CFG_RE:1;
      uint64_t EMAC_CFG_TE:1;
      uint64_t EMAC_CFG_DC:1;
      uint64_t EMAC_CFG_BL:2;
      uint64_t EMAC_CFG_ACS:1;
      uint64_t reservedSpace0:1;
      uint64_t EMAC_CFG_DR:1;
      uint64_t EMAC_CFG_IPC:1;
      uint64_t EMAC_CFG_DUPM:1;
      uint64_t EMAC_CFG_LOOPBM:1;
      uint64_t EMAC_CFG_DRO:1;
      uint64_t EMAC_CFG_FES:1;
      uint64_t EMAC_CFG_PS:1;
      uint64_t EMAC_CFG_DISCRS:1;
      uint64_t EMAC_CFG_IFG:3;
      uint64_t EMAC_CFG_JFEN:1;
      uint64_t reservedSpace1:1;
      uint64_t EMAC_CFG_JD:1;
      uint64_t EMAC_CFG_WDDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t EMAC_CFG_CST:1;
      uint64_t reservedSpace3:1;
      uint64_t EMAC_CFG_TWOKPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_FRAMEFLTR_PR:1;
      uint64_t EMAC_FRAMEFLTR_HUC:1;
      uint64_t EMAC_FRAMEFLTR_HMC:1;
      uint64_t EMAC_FRAMEFLTR_DAIF:1;
      uint64_t EMAC_FRAMEFLTR_PM:1;
      uint64_t EMAC_FRAMEFLTR_DBF:1;
      uint64_t EMAC_FRAMEFLTR_PCF:2;
      uint64_t EMAC_FRAMEFLTR_SAIF:1;
      uint64_t EMAC_FRAMEFLTR_SAF:1;
      uint64_t EMAC_FRAMEFLTR_HPF:1;
      uint64_t reservedSpace0:5;
      uint64_t EMAC_FRAMEFLTR_VTFE:1;
      uint64_t reservedSpace1:14;
      uint64_t EMAC_FRAMEFLTR_RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0FRAMEFLTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_HASHTBLH_HTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0HASHTBLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_HASHTBLL_HTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0HASHTBLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MIIADDR_MIIB:1;
      uint64_t EMAC_MIIADDR_MIIW:1;
      uint64_t EMAC_MIIADDR_CR:4;
      uint64_t EMAC_MIIADDR_MII:5;
      uint64_t EMAC_MIIADDR_PLA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MIIADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MIIDATA_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MIIDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_FLOWCTL_FCBBPA:1;
      uint64_t EMAC_FLOWCTL_TFE:1;
      uint64_t EMAC_FLOWCTL_RFE:1;
      uint64_t EMAC_FLOWCTL_UP:1;
      uint64_t EMAC_FLOWCTL_PLT:2;
      uint64_t reservedSpace0:1;
      uint64_t EMAC_FLOWCTL_DZQP:1;
      uint64_t reservedSpace1:8;
      uint64_t EMAC_FLOWCTL_PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0FLOWCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_VLANTG_VL:16;
      uint64_t EMAC_VLANTG_ETV:1;
      uint64_t EMAC_VLANTG_VTIM:1;
      uint64_t EMAC_VLANTG_ESVL:1;
      uint64_t EMAC_VLANTG_VTHM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0VLANTG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_STATUS_RPE:1;
      uint64_t EMAC_STATUS_RFCFC:2;
      uint64_t reservedSpace0:1;
      uint64_t EMAC_STATUS_RWC:1;
      uint64_t EMAC_STATUS_RRC:2;
      uint64_t reservedSpace1:1;
      uint64_t EMAC_STATUS_RXF:2;
      uint64_t reservedSpace2:6;
      uint64_t EMAC_STATUS_TPE:1;
      uint64_t EMAC_STATUS_TFC:2;
      uint64_t EMAC_STATUS_TXPAUSED:1;
      uint64_t EMAC_STATUS_TRC:2;
      uint64_t EMAC_STATUS_TWC:1;
      uint64_t reservedSpace3:1;
      uint64_t EMAC_STATUS_TXFE:1;
      uint64_t EMAC_STATUS_TXFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_RWUFF_WAKEUPFIL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RWUFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_PMTCTLSTAT_PWRDWN:1;
      uint64_t EMAC_PMTCTLSTAT_MGKPKTEN:1;
      uint64_t EMAC_PMTCTLSTAT_WUPFREN:1;
      uint64_t reservedSpace0:2;
      uint64_t EMAC_PMTCTLSTAT_MGKPRX:1;
      uint64_t EMAC_PMTCTLSTAT_WUPRX:1;
      uint64_t reservedSpace1:2;
      uint64_t EMAC_PMTCTLSTAT_GLBLUCAST:1;
      uint64_t reservedSpace2:14;
      uint64_t EMAC_PMTCTLSTAT_RWKPTR:3;
      uint64_t reservedSpace3:4;
      uint64_t EMAC_PMTCTLSTAT_WUPFRRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0PMTCTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_LPICTLSTAT_TLPIEN:1;
      uint64_t EMAC_LPICTLSTAT_TLPIEX:1;
      uint64_t EMAC_LPICTLSTAT_RLPIEN:1;
      uint64_t EMAC_LPICTLSTAT_RLPIEX:1;
      uint64_t reservedSpace0:4;
      uint64_t EMAC_LPICTLSTAT_TLPIST:1;
      uint64_t EMAC_LPICTLSTAT_RLPIST:1;
      uint64_t reservedSpace1:6;
      uint64_t EMAC_LPICTLSTAT_LPIEN:1;
      uint64_t EMAC_LPICTLSTAT_PLS:1;
      uint64_t EMAC_LPICTLSTAT_PLSEN:1;
      uint64_t EMAC_LPICTLSTAT_LPITXA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0LPICTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_LPITIMERCTL_TWT:16;
      uint64_t EMAC_LPITIMERCTL_LST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0LPITIMERCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t EMAC_RIS_PMT:1;
      uint64_t EMAC_RIS_MMC:1;
      uint64_t EMAC_RIS_MMCRX:1;
      uint64_t EMAC_RIS_MMCTX:1;
      uint64_t reservedSpace1:2;
      uint64_t EMAC_RIS_TS:1;
      uint64_t EMAC_RIS_LPI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t EMAC_IM_PMT:1;
      uint64_t reservedSpace1:5;
      uint64_t EMAC_IM_TSI:1;
      uint64_t EMAC_IM_LPII:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0IM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR0H_ADDRHI:16;
      uint64_t reservedSpace0:15;
      uint64_t EMAC_ADDR0H_AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR0H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR0L_ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR0L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR1H_ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t EMAC_ADDR1H_MBC:6;
      uint64_t EMAC_ADDR1H_SA:1;
      uint64_t EMAC_ADDR1H_AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR1H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR1L_ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR2H_ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t EMAC_ADDR2H_MBC:6;
      uint64_t EMAC_ADDR2H_SA:1;
      uint64_t EMAC_ADDR2H_AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR2H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR2L_ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR3H_ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t EMAC_ADDR3H_MBC:6;
      uint64_t EMAC_ADDR3H_SA:1;
      uint64_t EMAC_ADDR3H_AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR3H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_ADDR3L_ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0ADDR3L;

  uint8_t res1[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_WDOGTO_WTO:14;
      uint64_t reservedSpace0:2;
      uint64_t EMAC_WDOGTO_PWE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0WDOGTO;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MMCCTRL_CNTRST:1;
      uint64_t EMAC_MMCCTRL_CNTSTPRO:1;
      uint64_t EMAC_MMCCTRL_RSTONRD:1;
      uint64_t EMAC_MMCCTRL_CNTFREEZ:1;
      uint64_t EMAC_MMCCTRL_CNTPRST:1;
      uint64_t EMAC_MMCCTRL_CNTPRSTLVL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMAC_MMCCTRL_UCDBC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MMCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MMCRXRIS_GBF:1;
      uint64_t reservedSpace0:4;
      uint64_t EMAC_MMCRXRIS_CRCERR:1;
      uint64_t EMAC_MMCRXRIS_ALGNERR:1;
      uint64_t reservedSpace1:10;
      uint64_t EMAC_MMCRXRIS_UCGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MMCRXRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EMAC_MMCTXRIS_GBF:1;
      uint64_t reservedSpace1:12;
      uint64_t EMAC_MMCTXRIS_SCOLLGF:1;
      uint64_t EMAC_MMCTXRIS_MCOLLGF:1;
      uint64_t reservedSpace2:4;
      uint64_t EMAC_MMCTXRIS_OCTCNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MMCTXRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MMCRXIM_GBF:1;
      uint64_t reservedSpace0:4;
      uint64_t EMAC_MMCRXIM_CRCERR:1;
      uint64_t EMAC_MMCRXIM_ALGNERR:1;
      uint64_t reservedSpace1:10;
      uint64_t EMAC_MMCRXIM_UCGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MMCRXIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EMAC_MMCTXIM_GBF:1;
      uint64_t reservedSpace1:12;
      uint64_t EMAC_MMCTXIM_SCOLLGF:1;
      uint64_t EMAC_MMCTXIM_MCOLLGF:1;
      uint64_t reservedSpace2:4;
      uint64_t EMAC_MMCTXIM_OCTCNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MMCTXIM;

