iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TXCNTGB_TXFRMGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TXCNTGB;

  uint8_t res4[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TXCNTSCOL_TXSNGLCOLG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TXCNTSCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TXCNTMCOL_TXMULTCOLG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TXCNTMCOL;

  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TXOCTCNTG_TXOCTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TXOCTCNTG;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_RXCNTGB_RXFRMGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RXCNTGB;

  uint8_t res7[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_RXCNTCRCERR_RXCRCERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RXCNTCRCERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_RXCNTALGNERR_RXALGNERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RXCNTALGNERR;

  uint8_t res8[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_RXCNTGUNI_RXUCASTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RXCNTGUNI;

  uint8_t res9[956];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_VLNINCREP_VLT:16;
      uint64_t EMAC_VLNINCREP_VLC:2;
      uint64_t EMAC_VLNINCREP_VLP:1;
      uint64_t EMAC_VLNINCREP_CSVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0VLNINCREP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_VLANHASH_VLHT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0VLANHASH;

  uint8_t res10[372];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TIMSTCTRL_TSEN:1;
      uint64_t EMAC_TIMSTCTRL_TSFCUPDT:1;
      uint64_t EMAC_TIMSTCTRL_TSINIT:1;
      uint64_t EMAC_TIMSTCTRL_TSUPDT:1;
      uint64_t EMAC_TIMSTCTRL_INTTRIG:1;
      uint64_t EMAC_TIMSTCTRL_ADDREGUP:1;
      uint64_t reservedSpace0:2;
      uint64_t EMAC_TIMSTCTRL_ALLF:1;
      uint64_t EMAC_TIMSTCTRL_DGTLBIN:1;
      uint64_t EMAC_TIMSTCTRL_PTPVER2:1;
      uint64_t EMAC_TIMSTCTRL_PTPETH:1;
      uint64_t EMAC_TIMSTCTRL_PTPIPV6:1;
      uint64_t EMAC_TIMSTCTRL_PTPIPV4:1;
      uint64_t EMAC_TIMSTCTRL_TSEVNT:1;
      uint64_t EMAC_TIMSTCTRL_TSMAST:1;
      uint64_t EMAC_TIMSTCTRL_SELPTP:2;
      uint64_t EMAC_TIMSTCTRL_PTPFLTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TIMSTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_SUBSECINC_SSINC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0SUBSECINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TIMSEC_TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TIMSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TIMNANO_TSSS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TIMNANO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TIMSECU_TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TIMSECU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TIMNANOU_TSSS:31;
      uint64_t EMAC_TIMNANOU_ADDSUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TIMNANOU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TIMADD_TSAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TIMADD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TARGSEC_TSTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TARGSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TARGNANO_TTSLO:31;
      uint64_t EMAC_TARGNANO_TRGTBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TARGNANO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_HWORDSEC_TSHWR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0HWORDSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TIMSTAT_TSSOVF:1;
      uint64_t EMAC_TIMSTAT_TSTARGT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TIMSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_PPSCTRL_PPSCTRL:4;
      uint64_t EMAC_PPSCTRL_PPSEN0:1;
      uint64_t EMAC_PPSCTRL_TRGMODS0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0PPSCTRL;

  uint8_t res11[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_PPS0INTVL_PPS0INT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0PPS0INTVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_PPS0WIDTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0PPS0WIDTH;

  uint8_t res12[1176];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_DMABUSMOD_SWR:1;
      uint64_t EMAC_DMABUSMOD_DA:1;
      uint64_t EMAC_DMABUSMOD_DSL:5;
      uint64_t EMAC_DMABUSMOD_ATDS:1;
      uint64_t EMAC_DMABUSMOD_PBL:6;
      uint64_t EMAC_DMABUSMOD_PR:2;
      uint64_t EMAC_DMABUSMOD_FB:1;
      uint64_t EMAC_DMABUSMOD_RPBL:6;
      uint64_t EMAC_DMABUSMOD_USP:1;
      uint64_t EMAC_DMABUSMOD_8XPBL:1;
      uint64_t EMAC_DMABUSMOD_AAL:1;
      uint64_t EMAC_DMABUSMOD_MB:1;
      uint64_t EMAC_DMABUSMOD_TXPR:1;
      uint64_t reservedSpace0:3;
      uint64_t EMAC_DMABUSMOD_RIB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0DMABUSMOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_TXPOLLD_TPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TXPOLLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_RXPOLLD_RPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RXPOLLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EMAC_RXDLADDR_STRXLIST:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RXDLADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EMAC_TXDLADDR_TXDLADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0TXDLADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_DMARIS_TI:1;
      uint64_t EMAC_DMARIS_TPS:1;
      uint64_t EMAC_DMARIS_TU:1;
      uint64_t EMAC_DMARIS_TJT:1;
      uint64_t EMAC_DMARIS_OVF:1;
      uint64_t EMAC_DMARIS_UNF:1;
      uint64_t EMAC_DMARIS_RI:1;
      uint64_t EMAC_DMARIS_RU:1;
      uint64_t EMAC_DMARIS_RPS:1;
      uint64_t EMAC_DMARIS_RWT:1;
      uint64_t EMAC_DMARIS_ETI:1;
      uint64_t reservedSpace0:2;
      uint64_t EMAC_DMARIS_FBI:1;
      uint64_t EMAC_DMARIS_ERI:1;
      uint64_t EMAC_DMARIS_AIS:1;
      uint64_t EMAC_DMARIS_NIS:1;
      uint64_t EMAC_DMARIS_RS:3;
      uint64_t EMAC_DMARIS_TS:3;
      uint64_t EMAC_DMARIS_AE:3;
      uint64_t reservedSpace1:1;
      uint64_t EMAC_DMARIS_MMC:1;
      uint64_t EMAC_DMARIS_PMT:1;
      uint64_t EMAC_DMARIS_TT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0DMARIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EMAC_DMAOPMODE_SR:1;
      uint64_t EMAC_DMAOPMODE_OSF:1;
      uint64_t EMAC_DMAOPMODE_RTC:2;
      uint64_t EMAC_DMAOPMODE_DGF:1;
      uint64_t EMAC_DMAOPMODE_FUF:1;
      uint64_t EMAC_DMAOPMODE_FEF:1;
      uint64_t reservedSpace1:5;
      uint64_t EMAC_DMAOPMODE_ST:1;
      uint64_t EMAC_DMAOPMODE_TTC:3;
      uint64_t reservedSpace2:3;
      uint64_t EMAC_DMAOPMODE_FTF:1;
      uint64_t EMAC_DMAOPMODE_TSF:1;
      uint64_t reservedSpace3:2;
      uint64_t EMAC_DMAOPMODE_DFF:1;
      uint64_t EMAC_DMAOPMODE_RSF:1;
      uint64_t EMAC_DMAOPMODE_DT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0DMAOPMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_DMAIM_TIE:1;
      uint64_t EMAC_DMAIM_TSE:1;
      uint64_t EMAC_DMAIM_TUE:1;
      uint64_t EMAC_DMAIM_TJE:1;
      uint64_t EMAC_DMAIM_OVE:1;
      uint64_t EMAC_DMAIM_UNE:1;
      uint64_t EMAC_DMAIM_RIE:1;
      uint64_t EMAC_DMAIM_RUE:1;
      uint64_t EMAC_DMAIM_RSE:1;
      uint64_t EMAC_DMAIM_RWE:1;
      uint64_t EMAC_DMAIM_ETE:1;
      uint64_t reservedSpace0:2;
      uint64_t EMAC_DMAIM_FBE:1;
      uint64_t EMAC_DMAIM_ERE:1;
      uint64_t EMAC_DMAIM_AIE:1;
      uint64_t EMAC_DMAIM_NIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0DMAIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MFBOC_MISFRMCNT:16;
      uint64_t EMAC_MFBOC_MISCNTOVF:1;
      uint64_t EMAC_MFBOC_OVFFRMCNT:11;
      uint64_t EMAC_MFBOC_OVFCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0MFBOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_RXINTWDT_RIWT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0RXINTWDT;

  uint8_t res13[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_HOSTXDESC_CURTXDESC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0HOSTXDESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_HOSRXDESC_CURRXDESC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0HOSRXDESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_HOSTXBA_CURTXBUFA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0HOSTXBA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_HOSRXBA_CURRXBUFA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0HOSRXBA;

  uint8_t res14[872];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_PP_PHYTYPE:3;
      uint64_t reservedSpace0:5;
      uint64_t EMAC_PP_MACTYPE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0PP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_PC_PHYHOLD:1;
      uint64_t EMAC_PC_ANMODE:2;
      uint64_t EMAC_PC_ANEN:1;
      uint64_t EMAC_PC_FASTANSEL:2;
      uint64_t EMAC_PC_FASTANEN:1;
      uint64_t EMAC_PC_EXTFD:1;
      uint64_t EMAC_PC_FASTLUPD:1;
      uint64_t EMAC_PC_FASTRXDV:1;
      uint64_t EMAC_PC_MDIXEN:1;
      uint64_t EMAC_PC_FASTMDIX:1;
      uint64_t EMAC_PC_RBSTMDIX:1;
      uint64_t EMAC_PC_MDISWAP:1;
      uint64_t EMAC_PC_POLSWAP:1;
      uint64_t EMAC_PC_FASTLDMODE:5;
      uint64_t EMAC_PC_TDRRUN:1;
      uint64_t EMAC_PC_LRR:1;
      uint64_t EMAC_PC_ISOMIILL:1;
      uint64_t EMAC_PC_RXERIDLE:1;
      uint64_t EMAC_PC_NIBDETDIS:1;
      uint64_t EMAC_PC_DIGRESTART:1;
      uint64_t reservedSpace0:2;
      uint64_t EMAC_PC_PINTFS:3;
      uint64_t EMAC_PC_PHYEXT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t EMAC_CC_POL:1;
      uint64_t EMAC_CC_PTPCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0CC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_EPHYRIS_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0EPHYRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_EPHYIM_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0EPHYIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_EPHYMISC_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC0EPHYMISC;

