iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define EMAC0 (*(volatile struct EMAC0_tag *) 0x400ec000)

struct SYSEXC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSEXC_RIS_FPIDCRIS:1;
      uint64_t SYSEXC_RIS_FPDZCRIS:1;
      uint64_t SYSEXC_RIS_FPIOCRIS:1;
      uint64_t SYSEXC_RIS_FPUFCRIS:1;
      uint64_t SYSEXC_RIS_FPOFCRIS:1;
      uint64_t SYSEXC_RIS_FPIXCRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSEXCRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSEXC_IM_FPIDCIM:1;
      uint64_t SYSEXC_IM_FPDZCIM:1;
      uint64_t SYSEXC_IM_FPIOCIM:1;
      uint64_t SYSEXC_IM_FPUFCIM:1;
      uint64_t SYSEXC_IM_FPOFCIM:1;
      uint64_t SYSEXC_IM_FPIXCIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSEXCIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSEXC_MIS_FPIDCMIS:1;
      uint64_t SYSEXC_MIS_FPDZCMIS:1;
      uint64_t SYSEXC_MIS_FPIOCMIS:1;
      uint64_t SYSEXC_MIS_FPUFCMIS:1;
      uint64_t SYSEXC_MIS_FPOFCMIS:1;
      uint64_t SYSEXC_MIS_FPIXCMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSEXCMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSEXC_IC_FPIDCIC:1;
      uint64_t SYSEXC_IC_FPDZCIC:1;
      uint64_t SYSEXC_IC_FPIOCIC:1;
      uint64_t SYSEXC_IC_FPUFCIC:1;
      uint64_t SYSEXC_IC_FPOFCIC:1;
      uint64_t SYSEXC_IC_FPIXCIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSEXCIC;

};

#define SYSEXC (*(volatile struct SYSEXC_tag *) 0x400f9000)

struct HIB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_RTCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBRTCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_RTCM0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBRTCM0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_RTCLD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBRTCLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CTL_RTCEN:1;
      uint64_t HIB_CTL_HIBREQ:1;
      uint64_t reservedSpace0:1;
      uint64_t HIB_CTL_RTCWEN:1;
      uint64_t HIB_CTL_PINWEN:1;
      uint64_t reservedSpace1:1;
      uint64_t HIB_CTL_CLK32EN:1;
      uint64_t HIB_CTL_VABORT:1;
      uint64_t HIB_CTL_VDD3ON:1;
      uint64_t HIB_CTL_BATWKEN:1;
      uint64_t HIB_CTL_BATCHK:1;
      uint64_t reservedSpace2:2;
      uint64_t HIB_CTL_VBATSEL:2;
      uint64_t reservedSpace3:1;
      uint64_t HIB_CTL_OSCBYP:1;
      uint64_t HIB_CTL_OSCDRV:1;
      uint64_t reservedSpace4:1;
      uint64_t HIB_CTL_OSCSEL:1;
      uint64_t reservedSpace5:10;
      uint64_t HIB_CTL_RETCLR:1;
      uint64_t HIB_CTL_WRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_IM_RTCALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t HIB_IM_LOWBAT:1;
      uint64_t HIB_IM_EXTW:1;
      uint64_t HIB_IM_WC:1;
      uint64_t HIB_IM_PADIOWK:1;
      uint64_t HIB_IM_RSTWK:1;
      uint64_t HIB_IM_VDDFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_RIS_RTCALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t HIB_RIS_LOWBAT:1;
      uint64_t HIB_RIS_EXTW:1;
      uint64_t HIB_RIS_WC:1;
      uint64_t HIB_RIS_PADIOWK:1;
      uint64_t HIB_RIS_RSTWK:1;
      uint64_t HIB_RIS_VDDFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_MIS_RTCALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t HIB_MIS_LOWBAT:1;
      uint64_t HIB_MIS_EXTW:1;
      uint64_t HIB_MIS_WC:1;
      uint64_t HIB_MIS_PADIOWK:1;
      uint64_t HIB_MIS_RSTWK:1;
      uint64_t HIB_MIS_VDDFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_IC_RTCALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t HIB_IC_LOWBAT:1;
      uint64_t HIB_IC_EXTW:1;
      uint64_t HIB_IC_WC:1;
      uint64_t HIB_IC_PADIOWK:1;
      uint64_t HIB_IC_RSTWK:1;
      uint64_t HIB_IC_VDDFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBIC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_RTCT_TRIM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBRTCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_RTCSS_RTCSSC:15;
      uint64_t reservedSpace0:1;
      uint64_t HIB_RTCSS_RTCSSM:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBRTCSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_IO_WUUNLK:1;
      uint64_t reservedSpace0:3;
      uint64_t HIB_IO_WURSTEN:1;
      uint64_t reservedSpace1:26;
      uint64_t HIB_IO_IOWRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_DATA_RTD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBDATA;

  uint8_t res1[716];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CALCTL_CALEN:1;
      uint64_t reservedSpace0:1;
      uint64_t HIB_CALCTL_CAL24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCALCTL;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CAL0_SEC:6;
      uint64_t reservedSpace0:2;
      uint64_t HIB_CAL0_MIN:6;
      uint64_t reservedSpace1:2;
      uint64_t HIB_CAL0_HR:5;
      uint64_t reservedSpace2:1;
      uint64_t HIB_CAL0_AMPM:1;
      uint64_t reservedSpace3:8;
      uint64_t HIB_CAL0_VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CAL1_DOM:5;
      uint64_t reservedSpace0:3;
      uint64_t HIB_CAL1_MON:4;
      uint64_t reservedSpace1:4;
      uint64_t HIB_CAL1_YEAR:7;
      uint64_t reservedSpace2:1;
      uint64_t HIB_CAL1_DOW:3;
      uint64_t reservedSpace3:4;
      uint64_t HIB_CAL1_VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCAL1;

