iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CALLD0_SEC:6;
      uint64_t reservedSpace0:2;
      uint64_t HIB_CALLD0_MIN:6;
      uint64_t reservedSpace1:2;
      uint64_t HIB_CALLD0_HR:5;
      uint64_t reservedSpace2:1;
      uint64_t HIB_CALLD0_AMPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCALLD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CALLD1_DOM:5;
      uint64_t reservedSpace0:3;
      uint64_t HIB_CALLD1_MON:4;
      uint64_t reservedSpace1:4;
      uint64_t HIB_CALLD1_YEAR:7;
      uint64_t reservedSpace2:1;
      uint64_t HIB_CALLD1_DOW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCALLD1;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CALM0_SEC:6;
      uint64_t reservedSpace0:2;
      uint64_t HIB_CALM0_MIN:6;
      uint64_t reservedSpace1:2;
      uint64_t HIB_CALM0_HR:5;
      uint64_t reservedSpace2:1;
      uint64_t HIB_CALM0_AMPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCALM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CALM1_DOM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCALM1;

  uint8_t res5[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_LOCK_HIBLOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBLOCK;

  uint8_t res6[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPCTL_TPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t HIB_TPCTL_TPCLR:1;
      uint64_t reservedSpace1:3;
      uint64_t HIB_TPCTL_MEMCLR:2;
      uint64_t reservedSpace2:1;
      uint64_t HIB_TPCTL_WAKE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPSTAT_XOSCFAIL:1;
      uint64_t HIB_TPSTAT_XOSCST:1;
      uint64_t HIB_TPSTAT_STATE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPSTAT;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPIO_EN0:1;
      uint64_t HIB_TPIO_LEV0:1;
      uint64_t HIB_TPIO_PUEN0:1;
      uint64_t HIB_TPIO_GFLTR0:1;
      uint64_t reservedSpace0:4;
      uint64_t HIB_TPIO_EN1:1;
      uint64_t HIB_TPIO_LEV1:1;
      uint64_t HIB_TPIO_PUEN1:1;
      uint64_t HIB_TPIO_GFLTR1:1;
      uint64_t reservedSpace1:4;
      uint64_t HIB_TPIO_EN2:1;
      uint64_t HIB_TPIO_LEV2:1;
      uint64_t HIB_TPIO_PUEN2:1;
      uint64_t HIB_TPIO_GFLTR2:1;
      uint64_t reservedSpace2:4;
      uint64_t HIB_TPIO_EN3:1;
      uint64_t HIB_TPIO_LEV3:1;
      uint64_t HIB_TPIO_PUEN3:1;
      uint64_t HIB_TPIO_GFLTR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPIO;

  uint8_t res8[204];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG0_TIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG1_TRIG0:1;
      uint64_t HIB_TPLOG1_TRIG1:1;
      uint64_t HIB_TPLOG1_TRIG2:1;
      uint64_t HIB_TPLOG1_TRIG3:1;
      uint64_t reservedSpace0:12;
      uint64_t HIB_TPLOG1_XOSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG2_TIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG3_TRIG0:1;
      uint64_t HIB_TPLOG3_TRIG1:1;
      uint64_t HIB_TPLOG3_TRIG2:1;
      uint64_t HIB_TPLOG3_TRIG3:1;
      uint64_t reservedSpace0:12;
      uint64_t HIB_TPLOG3_XOSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG4_TIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG5_TRIG0:1;
      uint64_t HIB_TPLOG5_TRIG1:1;
      uint64_t HIB_TPLOG5_TRIG2:1;
      uint64_t HIB_TPLOG5_TRIG3:1;
      uint64_t reservedSpace0:12;
      uint64_t HIB_TPLOG5_XOSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG6_TIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_TPLOG7_TRIG0:1;
      uint64_t HIB_TPLOG7_TRIG1:1;
      uint64_t HIB_TPLOG7_TRIG2:1;
      uint64_t HIB_TPLOG7_TRIG3:1;
      uint64_t reservedSpace0:12;
      uint64_t HIB_TPLOG7_XOSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBTPLOG7;

  uint8_t res9[2752];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_PP_WAKENC:1;
      uint64_t HIB_PP_TAMPER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBPP;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB_CC_SYSCLKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIBCC;

};

#define HIB (*(volatile struct HIB_tag *) 0x400fc000)

struct FLASH_CTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMA_OFFSET:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMD_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMC_WRITE:1;
      uint64_t FLASH_FMC_ERASE:1;
      uint64_t FLASH_FMC_MERASE:1;
      uint64_t FLASH_FMC_COMT:1;
      uint64_t reservedSpace0:13;
      uint64_t FLASH_FMC_WRKEY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FCRIS_ARIS:1;
      uint64_t FLASH_FCRIS_PRIS:1;
      uint64_t FLASH_FCRIS_ERIS:1;
      uint64_t reservedSpace0:6;
      uint64_t FLASH_FCRIS_VOLTRIS:1;
      uint64_t FLASH_FCRIS_INVDRIS:1;
      uint64_t FLASH_FCRIS_ERRIS:1;
      uint64_t reservedSpace1:1;
      uint64_t FLASH_FCRIS_PROGRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFCRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FCIM_AMASK:1;
      uint64_t FLASH_FCIM_PMASK:1;
      uint64_t FLASH_FCIM_EMASK:1;
      uint64_t reservedSpace0:6;
      uint64_t FLASH_FCIM_VOLTMASK:1;
      uint64_t FLASH_FCIM_INVDMASK:1;
      uint64_t FLASH_FCIM_ERMASK:1;
      uint64_t reservedSpace1:1;
      uint64_t FLASH_FCIM_PROGMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFCIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FCMISC_AMISC:1;
      uint64_t FLASH_FCMISC_PMISC:1;
      uint64_t FLASH_FCMISC_EMISC:1;
      uint64_t reservedSpace0:6;
      uint64_t FLASH_FCMISC_VOLTMISC:1;
      uint64_t FLASH_FCMISC_INVDMISC:1;
      uint64_t FLASH_FCMISC_ERMISC:1;
      uint64_t reservedSpace1:1;
      uint64_t FLASH_FCMISC_PROGMISC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFCMISC;

