iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMC2_WRBUF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMC2;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBVAL_FWB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBVAL;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FLPEKEY_PEKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFLPEKEY;

  uint8_t res3[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FWBN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFWBN_31;

  uint8_t res4[3648];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_PP_SIZE:16;
      uint64_t FLASH_PP_MAINSS:3;
      uint64_t FLASH_PP_EESS:4;
      uint64_t reservedSpace0:5;
      uint64_t FLASH_PP_DFA:1;
      uint64_t FLASH_PP_FMM:1;
      uint64_t FLASH_PP_PFC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLPP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_SSIZE_SIZE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLSSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t FLASH_CONF_FPFOFF:1;
      uint64_t FLASH_CONF_FPFON:1;
      uint64_t reservedSpace1:2;
      uint64_t FLASH_CONF_CLRTV:1;
      uint64_t reservedSpace2:8;
      uint64_t FLASH_CONF_SPFE:1;
      uint64_t FLASH_CONF_FMME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_ROMSWMAP_SW0EN:2;
      uint64_t FLASH_ROMSWMAP_SW1EN:2;
      uint64_t FLASH_ROMSWMAP_SW2EN:2;
      uint64_t FLASH_ROMSWMAP_SW3EN:2;
      uint64_t FLASH_ROMSWMAP_SW4EN:2;
      uint64_t FLASH_ROMSWMAP_SW5EN:2;
      uint64_t FLASH_ROMSWMAP_SW6EN:2;
      uint64_t FLASH_ROMSWMAP_SW7EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLROMSWMAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_DMASZ_SIZE:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLDMASZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FLASH_DMAST_ADDR:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLDMAST;

  uint8_t res5[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_RVP_RV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLRVP;

