iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res6[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_BOOTCFG_DBG0:1;
      uint64_t FLASH_BOOTCFG_DBG1:1;
      uint64_t reservedSpace0:2;
      uint64_t FLASH_BOOTCFG_KEY:1;
      uint64_t reservedSpace1:3;
      uint64_t FLASH_BOOTCFG_EN:1;
      uint64_t FLASH_BOOTCFG_POL:1;
      uint64_t FLASH_BOOTCFG_PIN:3;
      uint64_t FLASH_BOOTCFG_PORT:3;
      uint64_t reservedSpace2:15;
      uint64_t FLASH_BOOTCFG_NW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLBOOTCFG;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_USERREG0_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLUSERREG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_USERREG1_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLUSERREG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_USERREG2_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLUSERREG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_USERREG3_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLUSERREG3;

  uint8_t res8[16];

  uint32_t FLASH_CTRLFMPRE0;
  uint32_t FLASH_CTRLFMPRE1;
  uint32_t FLASH_CTRLFMPRE2;
  uint32_t FLASH_CTRLFMPRE3;
  uint32_t FLASH_CTRLFMPRE4;
  uint32_t FLASH_CTRLFMPRE5;
  uint32_t FLASH_CTRLFMPRE6;
  uint32_t FLASH_CTRLFMPRE7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE8_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE9_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE10_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE11_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE12_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE13_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE14_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPRE15_READ_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPRE15;

  uint8_t res9[448];

  uint32_t FLASH_CTRLFMPPE0;
  uint32_t FLASH_CTRLFMPPE1;
  uint32_t FLASH_CTRLFMPPE2;
  uint32_t FLASH_CTRLFMPPE3;
  uint32_t FLASH_CTRLFMPPE4;
  uint32_t FLASH_CTRLFMPPE5;
  uint32_t FLASH_CTRLFMPPE6;
  uint32_t FLASH_CTRLFMPPE7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE8_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE9_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE10_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE11_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE12_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE13_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE14_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_FMPPE15_PROG_ENABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTRLFMPPE15;

};

#define FLASH_CTRL (*(volatile struct FLASH_CTRL_tag *) 0x400fd000)

struct SYSCTL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DID0_MIN:8;
      uint64_t SYSCTL_DID0_MAJ:8;
      uint64_t SYSCTL_DID0_CLASS:8;
      uint64_t reservedSpace0:4;
      uint64_t SYSCTL_DID0_VER:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DID1_QUAL:2;
      uint64_t SYSCTL_DID1_ROHS:1;
      uint64_t SYSCTL_DID1_PKG:2;
      uint64_t SYSCTL_DID1_TEMP:3;
      uint64_t reservedSpace0:5;
      uint64_t SYSCTL_DID1_PINCNT:3;
      uint64_t SYSCTL_DID1_PRTNO:8;
      uint64_t SYSCTL_DID1_FAM:4;
      uint64_t SYSCTL_DID1_VER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDID1;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PTBOCTL_VDD_UBOR:2;
      uint64_t reservedSpace0:6;
      uint64_t SYSCTL_PTBOCTL_VDDA_UBOR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPTBOCTL;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCTL_RIS_BORRIS:1;
      uint64_t reservedSpace1:1;
      uint64_t SYSCTL_RIS_MOFRIS:1;
      uint64_t reservedSpace2:2;
      uint64_t SYSCTL_RIS_PLLLRIS:1;
      uint64_t reservedSpace3:1;
      uint64_t SYSCTL_RIS_MOSCPUPRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCTL_IMC_BORIM:1;
      uint64_t reservedSpace1:1;
      uint64_t SYSCTL_IMC_MOFIM:1;
      uint64_t reservedSpace2:2;
      uint64_t SYSCTL_IMC_PLLLIM:1;
      uint64_t reservedSpace3:1;
      uint64_t SYSCTL_IMC_MOSCPUPIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLIMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCTL_MISC_BORMIS:1;
      uint64_t reservedSpace1:1;
      uint64_t SYSCTL_MISC_MOFMIS:1;
      uint64_t reservedSpace2:2;
      uint64_t SYSCTL_MISC_PLLLMIS:1;
      uint64_t reservedSpace3:1;
      uint64_t SYSCTL_MISC_MOSCPUPMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLMISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RESC_EXT:1;
      uint64_t SYSCTL_RESC_POR:1;
      uint64_t SYSCTL_RESC_BOR:1;
      uint64_t SYSCTL_RESC_WDT0:1;
      uint64_t SYSCTL_RESC_SW:1;
      uint64_t SYSCTL_RESC_WDT1:1;
      uint64_t SYSCTL_RESC_HIB:1;
      uint64_t reservedSpace0:5;
      uint64_t SYSCTL_RESC_HSSR:1;
      uint64_t reservedSpace1:3;
      uint64_t SYSCTL_RESC_MOSCFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PWRTC_VDD_UBOR:1;
      uint64_t reservedSpace0:3;
      uint64_t SYSCTL_PWRTC_VDDA_UBOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPWRTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_NMIC_EXTERNAL:1;
      uint64_t reservedSpace0:1;
      uint64_t SYSCTL_NMIC_POWER:1;
      uint64_t SYSCTL_NMIC_WDT0:1;
      uint64_t reservedSpace1:1;
      uint64_t SYSCTL_NMIC_WDT1:1;
      uint64_t reservedSpace2:3;
      uint64_t SYSCTL_NMIC_TAMPER:1;
      uint64_t reservedSpace3:6;
      uint64_t SYSCTL_NMIC_MOSCFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLNMIC;

