iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_MOSCCTL_CVAL:1;
      uint64_t SYSCTL_MOSCCTL_MOSCIM:1;
      uint64_t SYSCTL_MOSCCTL_NOXTAL:1;
      uint64_t SYSCTL_MOSCCTL_PWRDN:1;
      uint64_t SYSCTL_MOSCCTL_OSCRNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLMOSCCTL;

  uint8_t res3[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RSCLKCFG_PSYSDIV:10;
      uint64_t SYSCTL_RSCLKCFG_OSYSDIV:10;
      uint64_t SYSCTL_RSCLKCFG_OSCSRC:4;
      uint64_t SYSCTL_RSCLKCFG_PLLSRC:4;
      uint64_t SYSCTL_RSCLKCFG_USEPLL:1;
      uint64_t SYSCTL_RSCLKCFG_ACG:1;
      uint64_t SYSCTL_RSCLKCFG_NEWFREQ:1;
      uint64_t SYSCTL_RSCLKCFG_MEMTIMU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRSCLKCFG;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_MEMTIM0_FWS:4;
      uint64_t RESERVED0:1;
      uint64_t SYSCTL_MEMTIM0_FBCE:1;
      uint64_t SYSCTL_MEMTIM0_FBCHT:4;
      uint64_t reservedSpace0:6;
      uint64_t SYSCTL_MEMTIM0_EWS:4;
      uint64_t RESERVED1:1;
      uint64_t SYSCTL_MEMTIM0_EBCE:1;
      uint64_t SYSCTL_MEMTIM0_EBCHT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLMEMTIM0;

  uint8_t res5[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_ALTCLKCFG_ALTCLK:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLALTCLKCFG;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DSCLKCFG_DSSYSDIV:10;
      uint64_t reservedSpace0:10;
      uint64_t SYSCTL_DSCLKCFG_DSOSCSRC:4;
      uint64_t reservedSpace1:6;
      uint64_t SYSCTL_DSCLKCFG_MOSCDPD:1;
      uint64_t SYSCTL_DSCLKCFG_PIOSCPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDSCLKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DIVSCLK_DIV:8;
      uint64_t reservedSpace0:8;
      uint64_t SYSCTL_DIVSCLK_SRC:2;
      uint64_t reservedSpace1:13;
      uint64_t SYSCTL_DIVSCLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDIVSCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SYSPROP_FPU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSYSPROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PIOSCCAL_UT:7;
      uint64_t reservedSpace0:1;
      uint64_t SYSCTL_PIOSCCAL_UPDATE:1;
      uint64_t SYSCTL_PIOSCCAL_CAL:1;
      uint64_t reservedSpace1:21;
      uint64_t SYSCTL_PIOSCCAL_UTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPIOSCCAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PIOSCSTAT_CT:7;
      uint64_t reservedSpace0:1;
      uint64_t SYSCTL_PIOSCSTAT_CR:2;
      uint64_t reservedSpace1:6;
      uint64_t SYSCTL_PIOSCSTAT_DT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPIOSCSTAT;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PLLFREQ0_MINT:10;
      uint64_t SYSCTL_PLLFREQ0_MFRAC:10;
      uint64_t reservedSpace0:3;
      uint64_t SYSCTL_PLLFREQ0_PLLPWR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPLLFREQ0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PLLFREQ1_N:5;
      uint64_t reservedSpace0:3;
      uint64_t SYSCTL_PLLFREQ1_Q:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPLLFREQ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PLLSTAT_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPLLSTAT;

  uint8_t res8[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SLPPWRCFG_SRAMPM:2;
      uint64_t reservedSpace0:2;
      uint64_t SYSCTL_SLPPWRCFG_FLASHPM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSLPPWRCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DSLPPWRCFG_SRAMPM:2;
      uint64_t reservedSpace0:2;
      uint64_t SYSCTL_DSLPPWRCFG_FLASHPM:2;
      uint64_t reservedSpace1:2;
      uint64_t SYSCTL_DSLPPWRCFG_TSPD:1;
      uint64_t SYSCTL_DSLPPWRCFG_LDOSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDSLPPWRCFG;

  uint8_t res9[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_NVMSTAT_FWB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLNVMSTAT;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_LDOSPCTL_VLDO:8;
      uint64_t reservedSpace0:23;
      uint64_t SYSCTL_LDOSPCTL_VADJEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLLDOSPCTL;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_LDODPCTL_VLDO:8;
      uint64_t reservedSpace0:23;
      uint64_t SYSCTL_LDODPCTL_VADJEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLLDODPCTL;

  uint8_t res12[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RESBEHAVCTL_EXTRES:2;
      uint64_t SYSCTL_RESBEHAVCTL_BOR:2;
      uint64_t SYSCTL_RESBEHAVCTL_WDOG0:2;
      uint64_t SYSCTL_RESBEHAVCTL_WDOG1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRESBEHAVCTL;

  uint8_t res13[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_HSSR_CDOFF:24;
      uint64_t SYSCTL_HSSR_KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLHSSR;

  uint8_t res14[136];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_USBPDS_PWRSTAT:2;
      uint64_t SYSCTL_USBPDS_MEMSTAT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLUSBPDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_USBMPC_PWRCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLUSBMPC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_EMACPDS_PWRSTAT:2;
      uint64_t SYSCTL_EMACPDS_MEMSTAT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLEMACPDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_EMACMPC_PWRCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLEMACMPC;

  uint8_t res15[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPWD_P0:1;
      uint64_t SYSCTL_PPWD_P1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPTIMER_P0:1;
      uint64_t SYSCTL_PPTIMER_P1:1;
      uint64_t SYSCTL_PPTIMER_P2:1;
      uint64_t SYSCTL_PPTIMER_P3:1;
      uint64_t SYSCTL_PPTIMER_P4:1;
      uint64_t SYSCTL_PPTIMER_P5:1;
      uint64_t SYSCTL_PPTIMER_P6:1;
      uint64_t SYSCTL_PPTIMER_P7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPGPIO_P0:1;
      uint64_t SYSCTL_PPGPIO_P1:1;
      uint64_t SYSCTL_PPGPIO_P2:1;
      uint64_t SYSCTL_PPGPIO_P3:1;
      uint64_t SYSCTL_PPGPIO_P4:1;
      uint64_t SYSCTL_PPGPIO_P5:1;
      uint64_t SYSCTL_PPGPIO_P6:1;
      uint64_t SYSCTL_PPGPIO_P7:1;
      uint64_t SYSCTL_PPGPIO_P8:1;
      uint64_t SYSCTL_PPGPIO_P9:1;
      uint64_t SYSCTL_PPGPIO_P10:1;
      uint64_t SYSCTL_PPGPIO_P11:1;
      uint64_t SYSCTL_PPGPIO_P12:1;
      uint64_t SYSCTL_PPGPIO_P13:1;
      uint64_t SYSCTL_PPGPIO_P14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPGPIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPDMA_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPDMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPEPI_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPEPI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPHIB_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPHIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPUART_P0:1;
      uint64_t SYSCTL_PPUART_P1:1;
      uint64_t SYSCTL_PPUART_P2:1;
      uint64_t SYSCTL_PPUART_P3:1;
      uint64_t SYSCTL_PPUART_P4:1;
      uint64_t SYSCTL_PPUART_P5:1;
      uint64_t SYSCTL_PPUART_P6:1;
      uint64_t SYSCTL_PPUART_P7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPUART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPSSI_P0:1;
      uint64_t SYSCTL_PPSSI_P1:1;
      uint64_t SYSCTL_PPSSI_P2:1;
      uint64_t SYSCTL_PPSSI_P3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPSSI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPI2C_P0:1;
      uint64_t SYSCTL_PPI2C_P1:1;
      uint64_t SYSCTL_PPI2C_P2:1;
      uint64_t SYSCTL_PPI2C_P3:1;
      uint64_t SYSCTL_PPI2C_P4:1;
      uint64_t SYSCTL_PPI2C_P5:1;
      uint64_t SYSCTL_PPI2C_P6:1;
      uint64_t SYSCTL_PPI2C_P7:1;
      uint64_t SYSCTL_PPI2C_P8:1;
      uint64_t SYSCTL_PPI2C_P9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPI2C;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPUSB_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPUSB;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPEPHY_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPEPHY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPCAN_P0:1;
      uint64_t SYSCTL_PPCAN_P1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPCAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPADC_P0:1;
      uint64_t SYSCTL_PPADC_P1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPACMP_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPACMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPPWM_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPPWM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPQEI_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPQEI;

  uint8_t res18[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPEEPROM_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPEEPROM;

  uint8_t res19[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPCCM_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPCCM;

  uint8_t res20[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPLCD_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPLCD;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPOWIRE_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPOWIRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PPEMAC_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPPEMAC;

