iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res22[352];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRWD_R0:1;
      uint64_t SYSCTL_SRWD_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRTIMER_R0:1;
      uint64_t SYSCTL_SRTIMER_R1:1;
      uint64_t SYSCTL_SRTIMER_R2:1;
      uint64_t SYSCTL_SRTIMER_R3:1;
      uint64_t SYSCTL_SRTIMER_R4:1;
      uint64_t SYSCTL_SRTIMER_R5:1;
      uint64_t SYSCTL_SRTIMER_R6:1;
      uint64_t SYSCTL_SRTIMER_R7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRGPIO_R0:1;
      uint64_t SYSCTL_SRGPIO_R1:1;
      uint64_t SYSCTL_SRGPIO_R2:1;
      uint64_t SYSCTL_SRGPIO_R3:1;
      uint64_t SYSCTL_SRGPIO_R4:1;
      uint64_t SYSCTL_SRGPIO_R5:1;
      uint64_t SYSCTL_SRGPIO_R6:1;
      uint64_t SYSCTL_SRGPIO_R7:1;
      uint64_t SYSCTL_SRGPIO_R8:1;
      uint64_t SYSCTL_SRGPIO_R9:1;
      uint64_t SYSCTL_SRGPIO_R10:1;
      uint64_t SYSCTL_SRGPIO_R11:1;
      uint64_t SYSCTL_SRGPIO_R12:1;
      uint64_t SYSCTL_SRGPIO_R13:1;
      uint64_t SYSCTL_SRGPIO_R14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRGPIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRDMA_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRDMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SREPI_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSREPI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRHIB_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRHIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRUART_R0:1;
      uint64_t SYSCTL_SRUART_R1:1;
      uint64_t SYSCTL_SRUART_R2:1;
      uint64_t SYSCTL_SRUART_R3:1;
      uint64_t SYSCTL_SRUART_R4:1;
      uint64_t SYSCTL_SRUART_R5:1;
      uint64_t SYSCTL_SRUART_R6:1;
      uint64_t SYSCTL_SRUART_R7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRUART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRSSI_R0:1;
      uint64_t SYSCTL_SRSSI_R1:1;
      uint64_t SYSCTL_SRSSI_R2:1;
      uint64_t SYSCTL_SRSSI_R3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRSSI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRI2C_R0:1;
      uint64_t SYSCTL_SRI2C_R1:1;
      uint64_t SYSCTL_SRI2C_R2:1;
      uint64_t SYSCTL_SRI2C_R3:1;
      uint64_t SYSCTL_SRI2C_R4:1;
      uint64_t SYSCTL_SRI2C_R5:1;
      uint64_t SYSCTL_SRI2C_R6:1;
      uint64_t SYSCTL_SRI2C_R7:1;
      uint64_t SYSCTL_SRI2C_R8:1;
      uint64_t SYSCTL_SRI2C_R9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRI2C;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRUSB_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRUSB;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SREPHY_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSREPHY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRCAN_R0:1;
      uint64_t SYSCTL_SRCAN_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRCAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRADC_R0:1;
      uint64_t SYSCTL_SRADC_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRACMP_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRACMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRPWM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRPWM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRQEI_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRQEI;

  uint8_t res25[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SREEPROM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSREEPROM;

  uint8_t res26[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SRCCM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSRCCM;

  uint8_t res27[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SREMAC_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSREMAC;

  uint8_t res28[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCWD_R0:1;
      uint64_t SYSCTL_RCGCWD_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCTIMER_R0:1;
      uint64_t SYSCTL_RCGCTIMER_R1:1;
      uint64_t SYSCTL_RCGCTIMER_R2:1;
      uint64_t SYSCTL_RCGCTIMER_R3:1;
      uint64_t SYSCTL_RCGCTIMER_R4:1;
      uint64_t SYSCTL_RCGCTIMER_R5:1;
      uint64_t SYSCTL_RCGCTIMER_R6:1;
      uint64_t SYSCTL_RCGCTIMER_R7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCGPIO_R0:1;
      uint64_t SYSCTL_RCGCGPIO_R1:1;
      uint64_t SYSCTL_RCGCGPIO_R2:1;
      uint64_t SYSCTL_RCGCGPIO_R3:1;
      uint64_t SYSCTL_RCGCGPIO_R4:1;
      uint64_t SYSCTL_RCGCGPIO_R5:1;
      uint64_t SYSCTL_RCGCGPIO_R6:1;
      uint64_t SYSCTL_RCGCGPIO_R7:1;
      uint64_t SYSCTL_RCGCGPIO_R8:1;
      uint64_t SYSCTL_RCGCGPIO_R9:1;
      uint64_t SYSCTL_RCGCGPIO_R10:1;
      uint64_t SYSCTL_RCGCGPIO_R11:1;
      uint64_t SYSCTL_RCGCGPIO_R12:1;
      uint64_t SYSCTL_RCGCGPIO_R13:1;
      uint64_t SYSCTL_RCGCGPIO_R14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCGPIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCDMA_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCDMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCEPI_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCEPI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCHIB_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCHIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCUART_R0:1;
      uint64_t SYSCTL_RCGCUART_R1:1;
      uint64_t SYSCTL_RCGCUART_R2:1;
      uint64_t SYSCTL_RCGCUART_R3:1;
      uint64_t SYSCTL_RCGCUART_R4:1;
      uint64_t SYSCTL_RCGCUART_R5:1;
      uint64_t SYSCTL_RCGCUART_R6:1;
      uint64_t SYSCTL_RCGCUART_R7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCUART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCSSI_R0:1;
      uint64_t SYSCTL_RCGCSSI_R1:1;
      uint64_t SYSCTL_RCGCSSI_R2:1;
      uint64_t SYSCTL_RCGCSSI_R3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCSSI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCI2C_R0:1;
      uint64_t SYSCTL_RCGCI2C_R1:1;
      uint64_t SYSCTL_RCGCI2C_R2:1;
      uint64_t SYSCTL_RCGCI2C_R3:1;
      uint64_t SYSCTL_RCGCI2C_R4:1;
      uint64_t SYSCTL_RCGCI2C_R5:1;
      uint64_t SYSCTL_RCGCI2C_R6:1;
      uint64_t SYSCTL_RCGCI2C_R7:1;
      uint64_t SYSCTL_RCGCI2C_R8:1;
      uint64_t SYSCTL_RCGCI2C_R9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCI2C;

