iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCUSB_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCUSB;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCEPHY_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCEPHY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCCAN_R0:1;
      uint64_t SYSCTL_RCGCCAN_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCCAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCADC_R0:1;
      uint64_t SYSCTL_RCGCADC_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCACMP_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCACMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCPWM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCPWM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCQEI_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCQEI;

  uint8_t res31[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCEEPROM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCEEPROM;

  uint8_t res32[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCCCM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCCCM;

  uint8_t res33[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_RCGCEMAC_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLRCGCEMAC;

  uint8_t res34[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCWD_S0:1;
      uint64_t SYSCTL_SCGCWD_S1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCTIMER_S0:1;
      uint64_t SYSCTL_SCGCTIMER_S1:1;
      uint64_t SYSCTL_SCGCTIMER_S2:1;
      uint64_t SYSCTL_SCGCTIMER_S3:1;
      uint64_t SYSCTL_SCGCTIMER_S4:1;
      uint64_t SYSCTL_SCGCTIMER_S5:1;
      uint64_t SYSCTL_SCGCTIMER_S6:1;
      uint64_t SYSCTL_SCGCTIMER_S7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCGPIO_S0:1;
      uint64_t SYSCTL_SCGCGPIO_S1:1;
      uint64_t SYSCTL_SCGCGPIO_S2:1;
      uint64_t SYSCTL_SCGCGPIO_S3:1;
      uint64_t SYSCTL_SCGCGPIO_S4:1;
      uint64_t SYSCTL_SCGCGPIO_S5:1;
      uint64_t SYSCTL_SCGCGPIO_S6:1;
      uint64_t SYSCTL_SCGCGPIO_S7:1;
      uint64_t SYSCTL_SCGCGPIO_S8:1;
      uint64_t SYSCTL_SCGCGPIO_S9:1;
      uint64_t SYSCTL_SCGCGPIO_S10:1;
      uint64_t SYSCTL_SCGCGPIO_S11:1;
      uint64_t SYSCTL_SCGCGPIO_S12:1;
      uint64_t SYSCTL_SCGCGPIO_S13:1;
      uint64_t SYSCTL_SCGCGPIO_S14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCGPIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCDMA_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCDMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCEPI_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCEPI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCHIB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCHIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCUART_S0:1;
      uint64_t SYSCTL_SCGCUART_S1:1;
      uint64_t SYSCTL_SCGCUART_S2:1;
      uint64_t SYSCTL_SCGCUART_S3:1;
      uint64_t SYSCTL_SCGCUART_S4:1;
      uint64_t SYSCTL_SCGCUART_S5:1;
      uint64_t SYSCTL_SCGCUART_S6:1;
      uint64_t SYSCTL_SCGCUART_S7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCUART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCSSI_S0:1;
      uint64_t SYSCTL_SCGCSSI_S1:1;
      uint64_t SYSCTL_SCGCSSI_S2:1;
      uint64_t SYSCTL_SCGCSSI_S3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCSSI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCI2C_S0:1;
      uint64_t SYSCTL_SCGCI2C_S1:1;
      uint64_t SYSCTL_SCGCI2C_S2:1;
      uint64_t SYSCTL_SCGCI2C_S3:1;
      uint64_t SYSCTL_SCGCI2C_S4:1;
      uint64_t SYSCTL_SCGCI2C_S5:1;
      uint64_t SYSCTL_SCGCI2C_S6:1;
      uint64_t SYSCTL_SCGCI2C_S7:1;
      uint64_t SYSCTL_SCGCI2C_S8:1;
      uint64_t SYSCTL_SCGCI2C_S9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCI2C;

  uint8_t res35[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCUSB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCUSB;

  uint8_t res36[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCEPHY_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCEPHY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCCAN_S0:1;
      uint64_t SYSCTL_SCGCCAN_S1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCCAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCADC_S0:1;
      uint64_t SYSCTL_SCGCADC_S1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCACMP_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCACMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCPWM_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCPWM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCQEI_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCQEI;

  uint8_t res37[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCEEPROM_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCEEPROM;

  uint8_t res38[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCCCM_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCCCM;

  uint8_t res39[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_SCGCEMAC_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLSCGCEMAC;

  uint8_t res40[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCWD_D0:1;
      uint64_t SYSCTL_DCGCWD_D1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCTIMER_D0:1;
      uint64_t SYSCTL_DCGCTIMER_D1:1;
      uint64_t SYSCTL_DCGCTIMER_D2:1;
      uint64_t SYSCTL_DCGCTIMER_D3:1;
      uint64_t SYSCTL_DCGCTIMER_D4:1;
      uint64_t SYSCTL_DCGCTIMER_D5:1;
      uint64_t SYSCTL_DCGCTIMER_D6:1;
      uint64_t SYSCTL_DCGCTIMER_D7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCGPIO_D0:1;
      uint64_t SYSCTL_DCGCGPIO_D1:1;
      uint64_t SYSCTL_DCGCGPIO_D2:1;
      uint64_t SYSCTL_DCGCGPIO_D3:1;
      uint64_t SYSCTL_DCGCGPIO_D4:1;
      uint64_t SYSCTL_DCGCGPIO_D5:1;
      uint64_t SYSCTL_DCGCGPIO_D6:1;
      uint64_t SYSCTL_DCGCGPIO_D7:1;
      uint64_t SYSCTL_DCGCGPIO_D8:1;
      uint64_t SYSCTL_DCGCGPIO_D9:1;
      uint64_t SYSCTL_DCGCGPIO_D10:1;
      uint64_t SYSCTL_DCGCGPIO_D11:1;
      uint64_t SYSCTL_DCGCGPIO_D12:1;
      uint64_t SYSCTL_DCGCGPIO_D13:1;
      uint64_t SYSCTL_DCGCGPIO_D14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCGPIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCDMA_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCDMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCEPI_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCEPI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCHIB_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCHIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCUART_D0:1;
      uint64_t SYSCTL_DCGCUART_D1:1;
      uint64_t SYSCTL_DCGCUART_D2:1;
      uint64_t SYSCTL_DCGCUART_D3:1;
      uint64_t SYSCTL_DCGCUART_D4:1;
      uint64_t SYSCTL_DCGCUART_D5:1;
      uint64_t SYSCTL_DCGCUART_D6:1;
      uint64_t SYSCTL_DCGCUART_D7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCUART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCSSI_D0:1;
      uint64_t SYSCTL_DCGCSSI_D1:1;
      uint64_t SYSCTL_DCGCSSI_D2:1;
      uint64_t SYSCTL_DCGCSSI_D3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCSSI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCI2C_D0:1;
      uint64_t SYSCTL_DCGCI2C_D1:1;
      uint64_t SYSCTL_DCGCI2C_D2:1;
      uint64_t SYSCTL_DCGCI2C_D3:1;
      uint64_t SYSCTL_DCGCI2C_D4:1;
      uint64_t SYSCTL_DCGCI2C_D5:1;
      uint64_t SYSCTL_DCGCI2C_D6:1;
      uint64_t SYSCTL_DCGCI2C_D7:1;
      uint64_t SYSCTL_DCGCI2C_D8:1;
      uint64_t SYSCTL_DCGCI2C_D9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCI2C;

