iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res41[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCUSB_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCUSB;

  uint8_t res42[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCEPHY_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCEPHY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCCAN_D0:1;
      uint64_t SYSCTL_DCGCCAN_D1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCCAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCADC_D0:1;
      uint64_t SYSCTL_DCGCADC_D1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCACMP_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCACMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCPWM_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCPWM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCQEI_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCQEI;

  uint8_t res43[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCEEPROM_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCEEPROM;

  uint8_t res44[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCCCM_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCCCM;

  uint8_t res45[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_DCGCEMAC_D0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLDCGCEMAC;

  uint8_t res46[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCWD_P0:1;
      uint64_t SYSCTL_PCWD_P1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCTIMER_P0:1;
      uint64_t SYSCTL_PCTIMER_P1:1;
      uint64_t SYSCTL_PCTIMER_P2:1;
      uint64_t SYSCTL_PCTIMER_P3:1;
      uint64_t SYSCTL_PCTIMER_P4:1;
      uint64_t SYSCTL_PCTIMER_P5:1;
      uint64_t SYSCTL_PCTIMER_P6:1;
      uint64_t SYSCTL_PCTIMER_P7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCGPIO_P0:1;
      uint64_t SYSCTL_PCGPIO_P1:1;
      uint64_t SYSCTL_PCGPIO_P2:1;
      uint64_t SYSCTL_PCGPIO_P3:1;
      uint64_t SYSCTL_PCGPIO_P4:1;
      uint64_t SYSCTL_PCGPIO_P5:1;
      uint64_t SYSCTL_PCGPIO_P6:1;
      uint64_t SYSCTL_PCGPIO_P7:1;
      uint64_t SYSCTL_PCGPIO_P8:1;
      uint64_t SYSCTL_PCGPIO_P9:1;
      uint64_t SYSCTL_PCGPIO_P10:1;
      uint64_t SYSCTL_PCGPIO_P11:1;
      uint64_t SYSCTL_PCGPIO_P12:1;
      uint64_t SYSCTL_PCGPIO_P13:1;
      uint64_t SYSCTL_PCGPIO_P14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCGPIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCDMA_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCDMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCEPI_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCEPI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCHIB_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCHIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCUART_P0:1;
      uint64_t SYSCTL_PCUART_P1:1;
      uint64_t SYSCTL_PCUART_P2:1;
      uint64_t SYSCTL_PCUART_P3:1;
      uint64_t SYSCTL_PCUART_P4:1;
      uint64_t SYSCTL_PCUART_P5:1;
      uint64_t SYSCTL_PCUART_P6:1;
      uint64_t SYSCTL_PCUART_P7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCUART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCSSI_P0:1;
      uint64_t SYSCTL_PCSSI_P1:1;
      uint64_t SYSCTL_PCSSI_P2:1;
      uint64_t SYSCTL_PCSSI_P3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCSSI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCI2C_P0:1;
      uint64_t SYSCTL_PCI2C_P1:1;
      uint64_t SYSCTL_PCI2C_P2:1;
      uint64_t SYSCTL_PCI2C_P3:1;
      uint64_t SYSCTL_PCI2C_P4:1;
      uint64_t SYSCTL_PCI2C_P5:1;
      uint64_t SYSCTL_PCI2C_P6:1;
      uint64_t SYSCTL_PCI2C_P7:1;
      uint64_t SYSCTL_PCI2C_P8:1;
      uint64_t SYSCTL_PCI2C_P9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCI2C;

  uint8_t res47[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCUSB_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCUSB;

  uint8_t res48[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCEPHY_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCEPHY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCCAN_P0:1;
      uint64_t SYSCTL_PCCAN_P1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCCAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCADC_P0:1;
      uint64_t SYSCTL_PCADC_P1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCACMP_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCACMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCPWM_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCPWM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCQEI_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCQEI;

  uint8_t res49[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCEEPROM_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCEEPROM;

