iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res50[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCCCM_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCCCM;

  uint8_t res51[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PCEMAC_P0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPCEMAC;

  uint8_t res52[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRWD_R0:1;
      uint64_t SYSCTL_PRWD_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRTIMER_R0:1;
      uint64_t SYSCTL_PRTIMER_R1:1;
      uint64_t SYSCTL_PRTIMER_R2:1;
      uint64_t SYSCTL_PRTIMER_R3:1;
      uint64_t SYSCTL_PRTIMER_R4:1;
      uint64_t SYSCTL_PRTIMER_R5:1;
      uint64_t SYSCTL_PRTIMER_R6:1;
      uint64_t SYSCTL_PRTIMER_R7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRGPIO_R0:1;
      uint64_t SYSCTL_PRGPIO_R1:1;
      uint64_t SYSCTL_PRGPIO_R2:1;
      uint64_t SYSCTL_PRGPIO_R3:1;
      uint64_t SYSCTL_PRGPIO_R4:1;
      uint64_t SYSCTL_PRGPIO_R5:1;
      uint64_t SYSCTL_PRGPIO_R6:1;
      uint64_t SYSCTL_PRGPIO_R7:1;
      uint64_t SYSCTL_PRGPIO_R8:1;
      uint64_t SYSCTL_PRGPIO_R9:1;
      uint64_t SYSCTL_PRGPIO_R10:1;
      uint64_t SYSCTL_PRGPIO_R11:1;
      uint64_t SYSCTL_PRGPIO_R12:1;
      uint64_t SYSCTL_PRGPIO_R13:1;
      uint64_t SYSCTL_PRGPIO_R14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRGPIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRDMA_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRDMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PREPI_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPREPI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRHIB_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRHIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRUART_R0:1;
      uint64_t SYSCTL_PRUART_R1:1;
      uint64_t SYSCTL_PRUART_R2:1;
      uint64_t SYSCTL_PRUART_R3:1;
      uint64_t SYSCTL_PRUART_R4:1;
      uint64_t SYSCTL_PRUART_R5:1;
      uint64_t SYSCTL_PRUART_R6:1;
      uint64_t SYSCTL_PRUART_R7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRUART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRSSI_R0:1;
      uint64_t SYSCTL_PRSSI_R1:1;
      uint64_t SYSCTL_PRSSI_R2:1;
      uint64_t SYSCTL_PRSSI_R3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRSSI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRI2C_R0:1;
      uint64_t SYSCTL_PRI2C_R1:1;
      uint64_t SYSCTL_PRI2C_R2:1;
      uint64_t SYSCTL_PRI2C_R3:1;
      uint64_t SYSCTL_PRI2C_R4:1;
      uint64_t SYSCTL_PRI2C_R5:1;
      uint64_t SYSCTL_PRI2C_R6:1;
      uint64_t SYSCTL_PRI2C_R7:1;
      uint64_t SYSCTL_PRI2C_R8:1;
      uint64_t SYSCTL_PRI2C_R9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRI2C;

  uint8_t res53[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRUSB_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRUSB;

  uint8_t res54[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PREPHY_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPREPHY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRCAN_R0:1;
      uint64_t SYSCTL_PRCAN_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRCAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRADC_R0:1;
      uint64_t SYSCTL_PRADC_R1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRACMP_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRACMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRPWM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRPWM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRQEI_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRQEI;

  uint8_t res55[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PREEPROM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPREEPROM;

  uint8_t res56[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PRCCM_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPRCCM;

  uint8_t res57[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCTL_PREMAC_R0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCTLPREMAC;

  uint8_t res58[1152];

  uint32_t SYSCTLUNIQUEID0;
  uint32_t SYSCTLUNIQUEID1;
  uint32_t SYSCTLUNIQUEID2;
  uint32_t SYSCTLUNIQUEID3;
};

#define SYSCTL (*(volatile struct SYSCTL_tag *) 0x400fe000)

struct UDMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_STAT_MASTEN:1;
      uint64_t reservedSpace0:3;
      uint64_t UDMA_STAT_STATE:4;
      uint64_t reservedSpace1:8;
      uint64_t UDMA_STAT_DMACHANS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMASTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_CFG_MASTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t UDMA_CTLBASE_ADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACTLBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_ALTBASE_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAALTBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_WAITSTAT_WAITREQ:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAWAITSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_SWREQ:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMASWREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_USEBURSTSET_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAUSEBURSTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_USEBURSTCLR_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAUSEBURSTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_REQMASKSET_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAREQMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_REQMASKCLR_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAREQMASKCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_ENASET_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAENASET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_ENACLR_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAENACLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_ALTSET_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAALTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_ALTCLR_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAALTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_PRIOSET_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAPRIOSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_PRIOCLR_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAPRIOCLR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_ERRCLR_ERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMAERRCLR;

  uint8_t res1[1216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_CHMAP0_CH0SEL:4;
      uint64_t UDMA_CHMAP0_CH1SEL:4;
      uint64_t UDMA_CHMAP0_CH2SEL:4;
      uint64_t UDMA_CHMAP0_CH3SEL:4;
      uint64_t UDMA_CHMAP0_CH4SEL:4;
      uint64_t UDMA_CHMAP0_CH5SEL:4;
      uint64_t UDMA_CHMAP0_CH6SEL:4;
      uint64_t UDMA_CHMAP0_CH7SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACHMAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_CHMAP1_CH8SEL:4;
      uint64_t UDMA_CHMAP1_CH9SEL:4;
      uint64_t UDMA_CHMAP1_CH10SEL:4;
      uint64_t UDMA_CHMAP1_CH11SEL:4;
      uint64_t UDMA_CHMAP1_CH12SEL:4;
      uint64_t UDMA_CHMAP1_CH13SEL:4;
      uint64_t UDMA_CHMAP1_CH14SEL:4;
      uint64_t UDMA_CHMAP1_CH15SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACHMAP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_CHMAP2_CH16SEL:4;
      uint64_t UDMA_CHMAP2_CH17SEL:4;
      uint64_t UDMA_CHMAP2_CH18SEL:4;
      uint64_t UDMA_CHMAP2_CH19SEL:4;
      uint64_t UDMA_CHMAP2_CH20SEL:4;
      uint64_t UDMA_CHMAP2_CH21SEL:4;
      uint64_t UDMA_CHMAP2_CH22SEL:4;
      uint64_t UDMA_CHMAP2_CH23SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACHMAP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDMA_CHMAP3_CH24SEL:4;
      uint64_t UDMA_CHMAP3_CH25SEL:4;
      uint64_t UDMA_CHMAP3_CH26SEL:4;
      uint64_t UDMA_CHMAP3_CH27SEL:4;
      uint64_t UDMA_CHMAP3_CH28SEL:4;
      uint64_t UDMA_CHMAP3_CH29SEL:4;
      uint64_t UDMA_CHMAP3_CH30SEL:4;
      uint64_t UDMA_CHMAP3_CH31SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACHMAP3;

