iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define UDMA (*(volatile struct UDMA_tag *) 0x400ff000)

struct CCM0_tag
{
  uint32_t CCM0CCMCGREQ;
};

#define CCM0 (*(volatile struct CCM0_tag *) 0x44030204)

struct CRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_CTRL_TYPE:4;
      uint64_t CRC_CTRL_ENDIAN:2;
      uint64_t reservedSpace0:1;
      uint64_t CRC_CTRL_BR:1;
      uint64_t CRC_CTRL_OBR:1;
      uint64_t CRC_CTRL_RESINV:1;
      uint64_t reservedSpace1:2;
      uint64_t CRC_CTRL_SIZE:1;
      uint64_t CRC_CTRL_INIT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEED_SEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCSEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_DIN_DATAIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCDIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_RSLTPP_RSLTPP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCRSLTPP;

};

#define CRC (*(volatile struct CRC_tag *) 0x44030400)

struct SHAMD5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_A_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_B_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_C_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_D_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_D;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_E_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_F_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_F;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_G_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_G;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_ODIGEST_H_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5ODIGEST_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_A_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_B_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_C_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_D_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_D;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_E_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_F_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_F;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_G_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_G;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IDIGEST_H_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IDIGEST_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DIGEST_COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DIGEST_COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_MODE_ALGO:3;
      uint64_t SHAMD5_MODE_ALGO_CONSTANT:1;
      uint64_t SHAMD5_MODE_CLOSE_HASH:1;
      uint64_t SHAMD5_MODE_HMAC_KEY_PROC:1;
      uint64_t reservedSpace0:1;
      uint64_t SHAMD5_MODE_HMAC_OUTER_HASH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_LENGTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5LENGTH;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_0_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_0_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_1_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_1_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_2_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_2_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_3_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_3_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_4_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_4_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_5_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_5_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_6_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_6_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_7_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_7_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_8_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_8_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_9_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_9_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_10_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_10_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_11_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_11_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_12_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_12_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_13_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_13_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_14_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_14_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DATA_15_IN_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5DATA_15_IN;

  uint8_t res1[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_REVISION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5REVISION;

