iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SHAMD5_SYSCONFIG_SOFTRESET:1;
      uint64_t SHAMD5_SYSCONFIG_IT_EN:1;
      uint64_t SHAMD5_SYSCONFIG_DMA_EN:1;
      uint64_t SHAMD5_SYSCONFIG_SIDLE:2;
      uint64_t reservedSpace1:1;
      uint64_t SHAMD5_SYSCONFIG_SADVANCED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5SYSCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_SYSSTATUS_RESETDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5SYSSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IRQSTATUS_OUTPUT_READY:1;
      uint64_t SHAMD5_IRQSTATUS_INPUT_READY:1;
      uint64_t reservedSpace0:1;
      uint64_t SHAMD5_IRQSTATUS_CONTEXT_READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_IRQENABLE_OUTPUT_READY:1;
      uint64_t SHAMD5_IRQENABLE_INPUT_READY:1;
      uint64_t reservedSpace0:1;
      uint64_t SHAMD5_IRQENABLE_CONTEXT_READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5IRQENABLE;

};

#define SHAMD5 (*(volatile struct SHAMD5_tag *) 0x44034000)

struct SHAMD5_DMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DMAIM_CIN:1;
      uint64_t SHAMD5_DMAIM_COUT:1;
      uint64_t SHAMD5_DMAIM_DIN:1;
      uint64_t SHAMD5_DMAIM_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5_DMASHAMD5_DMAIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DMARIS_CIN:1;
      uint64_t SHAMD5_DMARIS_COUT:1;
      uint64_t SHAMD5_DMARIS_DIN:1;
      uint64_t SHAMD5_DMARIS_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5_DMASHAMD5_DMARIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DMAMIS_CIN:1;
      uint64_t SHAMD5_DMAMIS_COUT:1;
      uint64_t SHAMD5_DMAMIS_DIN:1;
      uint64_t SHAMD5_DMAMIS_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5_DMASHAMD5_DMAMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAMD5_DMAIC_CIN:1;
      uint64_t SHAMD5_DMAIC_COUT:1;
      uint64_t SHAMD5_DMAIC_DIN:1;
      uint64_t SHAMD5_DMAIC_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAMD5_DMASHAMD5_DMAIC;

};

#define SHAMD5_DMA (*(volatile struct SHAMD5_DMA_tag *) 0x44030010)

struct AES_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_6_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_7_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_4_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_5_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_2_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_3_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_0_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY2_1_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY2_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_6_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_7_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_4_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_5_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_2_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_3_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_0_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEY1_1_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IV_IN_0_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESIV_IN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IV_IN_1_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESIV_IN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IV_IN_2_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESIV_IN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IV_IN_3_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESIV_IN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_CTRL_OUTPUT_READY:1;
      uint64_t AES_CTRL_INPUT_READY:1;
      uint64_t AES_CTRL_DIRECTION:1;
      uint64_t AES_CTRL_KEY_SIZE:2;
      uint64_t AES_CTRL_MODE:1;
      uint64_t AES_CTRL_CTR:1;
      uint64_t AES_CTRL_CTR_WIDTH:2;
      uint64_t AES_CTRL_ICM:1;
      uint64_t AES_CTRL_CFB:1;
      uint64_t AES_CTRL_XTS:2;
      uint64_t AES_CTRL_F8:1;
      uint64_t AES_CTRL_F9:1;
      uint64_t AES_CTRL_CBCMAC:1;
      uint64_t AES_CTRL_GCM:2;
      uint64_t AES_CTRL_CCM:1;
      uint64_t AES_CTRL_CCM_L:3;
      uint64_t AES_CTRL_CCM_M:3;
      uint64_t reservedSpace0:4;
      uint64_t AES_CTRL_SAVE_CONTEXT:1;
      uint64_t AES_CTRL_SVCTXTRDY:1;
      uint64_t AES_CTRL_CTXTRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_C_LENGTH_0_LENGTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESC_LENGTH_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_C_LENGTH_1_LENGTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESC_LENGTH_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_AUTH_LENGTH_AUTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESAUTH_LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DATA_IN_0_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESDATA_IN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DATA_IN_1_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESDATA_IN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DATA_IN_2_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESDATA_IN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DATA_IN_3_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESDATA_IN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_TAG_OUT_0_HASH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESTAG_OUT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_TAG_OUT_1_HASH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESTAG_OUT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_TAG_OUT_2_HASH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESTAG_OUT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_TAG_OUT_3_HASH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESTAG_OUT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_REVISION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESREVISION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AES_SYSCONFIG_SOFTRESET:1;
      uint64_t reservedSpace1:3;
      uint64_t AES_SYSCONFIG_DMA_REQ_DATA_IN_EN:1;
      uint64_t AES_SYSCONFIG_DMA_REQ_DATA_OUT_EN:1;
      uint64_t AES_SYSCONFIG_DMA_REQ_CONTEXT_IN_EN:1;
      uint64_t AES_SYSCONFIG_DMA_REQ_CONTEXT_OUT_EN:1;
      uint64_t AES_SYSCONFIG_MAP_CONTEXT_OUT_ON_DATA_OUT:1;
      uint64_t reservedSpace2:1;
      uint64_t AES_SYSCONFIG_KEYENC:1;
      uint64_t AES_SYSCONFIG_K3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESSYSCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SYSSTATUS_RESETDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESSYSSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IRQSTATUS_CONTEXT_IN:1;
      uint64_t AES_IRQSTATUS_DATA_IN:1;
      uint64_t AES_IRQSTATUS_DATA_OUT:1;
      uint64_t AES_IRQSTATUS_CONTEXT_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESIRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IRQENABLE_CONTEXT_IN:1;
      uint64_t AES_IRQENABLE_DATA_IN:1;
      uint64_t AES_IRQENABLE_DATA_OUT:1;
      uint64_t AES_IRQENABLE_CONTEXT_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESIRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DIRTYBITS_S_ACCESS:1;
      uint64_t AES_DIRTYBITS_S_DIRTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESDIRTYBITS;

