iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/MSP432E401Y_sfr.h
};

#define AES (*(volatile struct AES_tag *) 0x44036000)

struct AES_DMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DMAIM_CIN:1;
      uint64_t AES_DMAIM_COUT:1;
      uint64_t AES_DMAIM_DIN:1;
      uint64_t AES_DMAIM_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_DMAAES_DMAIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DMARIS_CIN:1;
      uint64_t AES_DMARIS_COUT:1;
      uint64_t AES_DMARIS_DIN:1;
      uint64_t AES_DMARIS_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_DMAAES_DMARIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DMAMIS_CIN:1;
      uint64_t AES_DMAMIS_COUT:1;
      uint64_t AES_DMAMIS_DIN:1;
      uint64_t AES_DMAMIS_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_DMAAES_DMAMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DMAIC_CIN:1;
      uint64_t AES_DMAIC_COUT:1;
      uint64_t AES_DMAIC_DIN:1;
      uint64_t AES_DMAIC_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AES_DMAAES_DMAIC;

};

#define AES_DMA (*(volatile struct AES_DMA_tag *) 0x44030020)

struct DES_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_KEY3_L_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESKEY3_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_KEY3_H_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESKEY3_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_KEY2_L_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESKEY2_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_KEY2_H_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESKEY2_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_KEY1_L_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESKEY1_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_KEY1_H_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESKEY1_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_IV_L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESIV_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_IV_H:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESIV_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_CTRL_OUTPUT_READY:1;
      uint64_t DES_CTRL_INPUT_READY:1;
      uint64_t DES_CTRL_DIRECTION:1;
      uint64_t DES_CTRL_TDES:1;
      uint64_t DES_CTRL_MODE:2;
      uint64_t reservedSpace0:25;
      uint64_t DES_CTRL_CONTEXT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_LENGTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESLENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_DATA_L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESDATA_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_DATA_H:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESDATA_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_REVISION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESREVISION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DES_SYSCONFIG_SOFTRESET:1;
      uint64_t DES_SYSCONFIG_SIDLE:2;
      uint64_t reservedSpace1:1;
      uint64_t DES_SYSCONFIG_DMA_REQ_DATA_IN_EN:1;
      uint64_t DES_SYSCONFIG_DMA_REQ_DATA_OUT_EN:1;
      uint64_t DES_SYSCONFIG_DMA_REQ_CONTEXT_IN_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESSYSCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_SYSSTATUS_RESETDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESSYSSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_IRQSTATUS_CONTEX_IN:1;
      uint64_t DES_IRQSTATUS_DATA_IN:1;
      uint64_t DES_IRQSTATUS_DATA_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESIRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_IRQENABLE_M_CONTEX_IN:1;
      uint64_t DES_IRQENABLE_M_DATA_IN:1;
      uint64_t DES_IRQENABLE_M_DATA_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESIRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_DIRTYBITS_S_ACCESS:1;
      uint64_t DES_DIRTYBITS_S_DIRTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESDIRTYBITS;

};

#define DES (*(volatile struct DES_tag *) 0x44038000)

struct DES_DMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_DMAIM_CIN:1;
      uint64_t DES_DMAIM_COUT:1;
      uint64_t DES_DMAIM_DIN:1;
      uint64_t DES_DMAIM_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DES_DMADES_DMAIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_DMARIS_CIN:1;
      uint64_t DES_DMARIS_COUT:1;
      uint64_t DES_DMARIS_DIN:1;
      uint64_t DES_DMARIS_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DES_DMADES_DMARIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_DMAMIS_CIN:1;
      uint64_t DES_DMAMIS_COUT:1;
      uint64_t DES_DMAMIS_DIN:1;
      uint64_t DES_DMAMIS_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DES_DMADES_DMAMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_DMAIC_CIN:1;
      uint64_t DES_DMAIC_COUT:1;
      uint64_t DES_DMAIC_DIN:1;
      uint64_t DES_DMAIC_DOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DES_DMADES_DMAIC;

};

#define DES_DMA (*(volatile struct DES_DMA_tag *) 0x44030030)

